(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\の
  #\な
  #\【
  #\】
  #\に
  #\て
  #\こ
  #\？
  #\だ
  #\、
  #\っ
  #\た
  #\。
  #\は
  #\る
  #\ん
  #\封
  #\筒
  #\か
  #\が
  #\０
  #\！
  #\で
  #\を
  #\も
  #\あ
  #\う
  #\ロ
  #\つ
  #\く
  #\中)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (while
  (== 1 1)
  (<>
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((&& (== V 108) (== (: 158) 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】ここでお金の入った封筒を拾ったんだよな・・・キョロキョロキョロ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、そんなに何度も落ちてないか。")
      (wait)
      (set-reg: 10 1)
      (break)))
    ((&& (== V 108) (== (: 158) 1) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】なあ・・・ゴミでも拾うつもりか？")
      (wait)
      (set-reg: 10 2)
      (break)))
    ((&& (== V 108) (== (: 158) 1) (== (: 10) 2))
     (<>
      (text #:color 7 "【" 0 "】おい・・・草むしりでもするのか？")
      (wait)
      (set-reg: 10 3)
      (break)))
    ((&& (== V 108) (== (: 158) 1) (== (: 10) 3))
     (<> (text #:color 7 "【" 0 "】ここにいても退屈なだけだ・・・他の場所に行かないか？") (wait) (break)))
    ((&& (== V 108) (== (: 159) 0) (== (: 158) 0))
     (<>
      (text #:color 7 "【" 0 "】なんだよ・・・どうして俺はこんな場所に来たんだ？")
      (wait)
      (text #:color 7 "【" 0 "】ったく、靴がドロドロになっちまったじゃないか・・・あれれ！？")
      (wait)
      (text #:color 7 "【" 0 "】なんだこりゃ？封筒が落ちているぞ・・・中を開けてみるかい？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "はい") (text "いいえ")))
      (set-arr~ @ 7 1)
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】なになに・・・『この封筒の中のお金は、あなたの物です。』")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】『あなたの最後の夏休み・・・甘酸っぱい青春の思い出をつくる為に役立ててください。』・・・！？")
         (wait)
         (text #:color 7 "【" 0 "】い、１００００円だ！？・・・いったい誰が、こんな封筒を！？")
         (wait)
         (sound 1)
         (set-var I 58)
         (proc 26)
         (set-reg: 835 0)
         (set-var M (+ M 10000))
         (proc 11)
         (text #:color 7 "【" 0 "】うーん、俺様には幸運の女神がついてるに違いない。")
         (wait)
         (sound 1)
         (set-var I 50)
         (proc 26)
         (set-reg: 835 1)
         (set-reg: 158 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・この封筒の中には、ゴキブリの死体でも入っているに違いない。")
         (wait)
         (set-reg: 159 1)))
       (else (<>)))
      (break)))
    ((&& (== V 108) (== (: 158) 0) (== (: 159) 1))
     (<>
      (text #:color 7 "【" 0 "】またこの場所か・・・まだ封筒が地面に落ちているぞ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】今度こそ、開けるのか？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "はい") (text "いいえ")))
      (set-arr~ @ 7 1)
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】なになに・・・『この封筒の中のお金は、あなたの物です。』")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】『あなたの最後の夏休み・・・甘酸っぱい青春の思い出をつくる為に役立ててください。』・・・！？")
         (wait)
         (text #:color 7 "【" 0 "】い、１００００円だ！？・・・いったい誰が、こんな封筒を！？")
         (wait)
         (sound 1)
         (set-var I 58)
         (proc 26)
         (set-reg: 835 0)
         (set-var M (+ M 10000))
         (proc 11)
         (text #:color 7 "【" 0 "】うーん、俺様には幸運の女神がついてるに違いない。")
         (wait)
         (sound 1)
         (set-var I 50)
         (proc 26)
         (set-reg: 835 1)
         (set-reg: 158 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・この封筒の中には、ハエの幼虫が入っているに決っている。")
         (wait)))
       (else (<>)))
      (break)))
    (else (<>)))))
 (set-arr~ @ 7 1))