(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\。
  #\て
  #\の
  #\子
  #\夏
  #\っ
  #\、
  #\ん
  #\だ
  #\る
  #\か
  #\う
  #\は
  #\し
  #\に
  #\？
  #\ら
  #\一
  #\も
  #\が
  #\た
  #\よ
  #\で
  #\哉
  #\あ
  #\と
  #\さ
  #\れ
  #\そ
  #\く
  #\を
  #\わ
  #\こ
  #\け
  #\ど
  #\君
  #\ね
  #\ー
  #\ま
  #\ゃ
  #\え
  #\り
  #\事
  #\す
  #\俺
  #\言
  #\き
  #\女
  #\つ
  #\じ
  #\何
  #\ン
  #\や
  #\み
  #\ト
  #\！
  #\お
  #\ス
  #\へ
  #\ろ
  #\人
  #\ふ
  #\ぜ
  #\ち
  #\来
  #\ょ
  #\レ
  #\ば
  #\日
  #\気
  #\見
  #\彼
  #\店
  #\私
  #\プ
  #\合
  #\パ
  #\緒
  #\デ
  #\思
  #\服
  #\ほ
  #\分
  #\（
  #\）
  #\イ
  #\休
  #\ル
  #\会
  #\好
  #\今
  #\め
  #\ゼ
  #\方
  #\時
  #\性
  #\前
  #\本
  #\当
  #\１
  #\大
  #\顔
  #\着
  #\出
  #\買
  #\バ
  #\ぞ
  #\変
  #\長
  #\せ
  #\達
  #\自
  #\生
  #\歳
  #\目
  #\ぐ
  #\素
  #\敵
  #\黒
  #\首
  #\知
  #\手
  #\話)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "55.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "j.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "jan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "j.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 30)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "55.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 151) 0)
   (<>
    (text #:color 2 "【夏子】いらっしゃいませ・・・あら、一哉君。")
    (wait)
    (text #:color 5 "【一哉】へらへらへらへらへら。")
    (wait)
    (text #:color 7 "【" 0 "】なるほどね・・・そういう事か。")
    (wait)
    (text #:color 2 "【夏子】今日はお友達も一緒なのね・・・はじめまして、私は『正樹　夏子』って言います。")
    (wait)
    (text #:color 7 "【" 0 "】俺は・・・" 0 "。")
    (wait)
    (text #:color 5 "【一哉】へらへらへらへら・・・" 0 "、ちゃんと挨拶しろよ。")
    (wait)
    (text #:color 7 "【" 0 "】だから、ちゃんと自分の名前を言ったじゃないか。")
    (wait)
    (text #:color 5 "【一哉】夏子さん、こいつ上がってるんだよ・・・夏子さんが、あまりにも奇麗だから。")
    (wait)
    (text #:color 2 "【夏子】お世辞でもうれしいわ。")
    (wait)
    (text #:color 7 "【" 0 "】（でも・・・本当に奇麗な人だな。）")
    (wait)))
  ((&& (== (: 151) 1) (< H 812))
   (<> (text #:color 2 "【夏子】いらっしゃいませ・・・今日は一人なの？") (wait)))
  ((&& (> H 811) (== (: 254) 0))
   (<>
    (text #:color 2 "【夏子】いらっしゃい・・・あら、" 0 "君。")
    (wait)
    (text #:color 2 "【夏子】彼女ができて、プレゼントする気になったの？・・・それともまた冷やかしかしら、ふふふ。")
    (wait)
    (set-reg: 254 1)))
  ((&& (== (: 254) 1) (== H 812))
   (<>
    (text #:color 2 "【夏子】" 0 "君・・・最近、よく来るわね。")
    (wait)
    (text #:color 7 "【" 0 "】夏子さんがいる限り俺はここに来ます、毎日来ます。")
    (wait)
    (text #:color 2 "【夏子】子供の癖に言うわね・・・もっとも、一哉君の友達だから納得できるけど。")
    (wait)))
  ((== H 813)
   (<>
    (text #:color 2 "【夏子】あら・・・" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】夏子さん、今日は何日だか知ってます？")
    (wait)
    (text #:color 2 "【夏子】えーと・・・今日は８月１３日でしょ？")
    (wait)
    (text #:color 7 "【" 0 "】大当りっ！！・・・商品として、俺様とのデートが一回できますけど。")
    (wait)
    (text #:color 2 "【夏子】ふふっ・・・遠慮しておくわ。")
    (wait)))
  ((== H 814)
   (<>
    (text #:color 2 "【夏子】いらっしゃい・・・" 0 "君は、ここに涼みに来てるんでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】確かに涼しいけど、それだけじゃないぜ・・・夏子さんの顔を一日一回見ないと落ち着かないんだ。")
    (wait)
    (text #:color 2 "【夏子】本当に" 0 "君って口が上手ねー・・・営業マンになったら出世するわよ。")
    (wait)))
  ((== H 815)
   (<>
    (text #:color 2 "【夏子】いらっしゃい・・・あら、また来たの？")
    (wait)
    (text #:color 7 "【" 0 "】また来たのって・・・そんな言い方をされると傷つくな。")
    (wait)
    (text #:color 2 "【夏子】ふふふ・・・最近一哉君もよく来るのよ、" 0 "君と一緒で何も買ってかないけど。")
    (wait)
    (text #:color 7 "【" 0 "】何も買ってかないって・・・その言葉も傷つくなあ。")
    (wait)))
  ((== H 816)
   (<>
    (text #:color 2 "【夏子】いらっしゃい・・・何も買わなくていいから、ゆっくり涼んでいってね。")
    (wait)
    (text #:color 7 "【" 0 "】嫌味で言われてるのかな・・・？")
    (wait)
    (text #:color 2 "【夏子】今日は土曜日ね・・・" 0 "君はどこかに出かけないの？")
    (wait)
    (text #:color 7 "【" 0 "】できれば夏子さんと一緒に出かけたいな。")
    (wait)
    (text
     #:color
     2
     "【夏子】誘ってくれるのはうれしいけど、専門学校の課題って厳しいのよ・・・バイトが終ったら家に帰ってやらないと間に合わないわ。")
    (wait)))
  ((&& (> H 816) (== (: 480) 0))
   (<>
    (text #:color 2 "【夏子】あ・・・" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】やあやあ、夏子さんっ！！")
    (wait)
    (text #:color 2 "【夏子】いらっしゃい・・・。")
    (wait)
    (text #:color 7 "【" 0 "】あれれ、どうしたの？・・・なんだか元気がないけど。")
    (wait)
    (text #:color 2 "【夏子】色々と考えてるのよ・・・これでも。")
    (wait)
    (text #:color 7 "【" 0 "】へ？")
    (wait)
    (text #:color 2 "【夏子】確かにここにいればお金にはなるんだけど、何もしないで立ってるのも・・・退屈だし、時間の無駄だと思わない？")
    (wait)
    (text #:color 2 "【夏子】夏休みも残り少ないしね・・・専門学校の課題を一生懸命やらないと、終りそうにないし。")
    (wait)
    (text #:color 7 "【" 0 "】ふんふん。")
    (wait)
    (text #:color 2 "【夏子】私・・・この店のアルバイト、やめる事にしたの。")
    (wait)
    (text #:color 7 "【" 0 "】え！？")
    (wait)
    (text #:color 2 "【夏子】もうオーナーにも話したのよ・・・幸い、代わりの人も見つかったみたいだし。")
    (wait)
    (text #:color 7 "【" 0 "】代わりの人って・・・どんな人？")
    (wait)
    (text #:color 2 "【夏子】おばさんみたいよ、４０歳くらいの。")
    (wait)
    (text #:color 7 "【" 0 "】げげっ！！・・・か、一哉は知ってるの？")
    (wait)
    (text #:color 2 "【夏子】う、うん・・・知ってると思うわ。")
    (wait)
    (text
     #:color
     2
     "【夏子】最後に"
     0
     "君に会えてよかったわ・・・私もこれから帰るところだったの、オーナーも今日は店を閉めていいって言ってくれたし。")
    (wait)
    (text #:color 7 "【" 0 "】そ、そんなあ。")
    (wait)
    (text #:color 2 "【夏子】さてと・・・がんばって課題をやらないと。")
    (wait)
    (text #:color 7 "【" 0 "】（夏子さんのいない店なんて・・・肉の入ってないギョウザのようなもんだあ。）")
    (wait)
    (set-reg: 480 1))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 151) 0))
        (<> (text #:color 5 "【一哉】まだ帰るなよ・・・何も買ってないじゃないか。") (wait)))
       ((&& (== N 1) (== (: 151) 1) (== (: 235) 0))
        (<>
         (text #:color 2 "【夏子】一哉君、いつもありがとう・・・また来てね。")
         (wait)
         (text #:color 5 "【一哉】へらへらへら・・・毎日来ますよ、へらへらへら。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君も・・・彼女にプレゼントしたい時は、うちの店に来てね。")
         (wait)
         (text
          #:color
          5
          "【一哉】ははは・・・"
          0
          "は彼女と呼べる女性はいないけど、プレゼントする女性は山ほどいるやつだから。")
         (wait)
         (text #:color 7 "【" 0 "】うるさいなあ・・・。")
         (wait)
         (field 14 1 1)
         (field 13 0 0)
         (field 13 1 1)
         (set-reg: 1001 0)
         (set-reg: 235 1)
         (set-reg: 175 1)
         (set-var N 12)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 1) (== (: 235) 1) (== (: 480) 0))
        (<>
         (text #:color 2 "【夏子】あら、もう帰るの？")
         (wait)
         (text #:color 2 "【夏子】一哉君によろしくね・・・また来てくださいって。")
         (wait)
         (set-var N 12)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 1) (== (: 480) 1))
        (<>
         (text #:color 2 "【夏子】じゃあね、" 0 "君・・・またどこかで会えたらいいわね。")
         (wait)
         (text #:color 7 "【" 0 "】夏子さんも帰るんでしょ？・・・一緒に出ようよ。")
         (wait)
         (text #:color 2 "【夏子】う、ううん・・・私はいいの。")
         (wait)
         (text #:color 7 "【" 0 "】そう・・・。")
         (wait)
         (set-var N 12)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (== (: 151) 0))
        (<>
         (text #:color 5 "【一哉】そうだよ、まだここにいてくれ。")
         (wait)
         (text #:color 7 "【" 0 "】いてくれって・・・何の為に俺を連れて来たんだ？")
         (wait)
         (text #:color 5 "【一哉】いいじゃないか、細かい事を気にするなよ。")
         (wait)))
       ((&& (== N 2) (== (: 151) 1) (== (: 235) 0))
        (<>
         (text #:color 5 "【一哉】" 0 "、俺はもうプレゼントを買ったぜ。")
         (wait)
         (text #:color 7 "【" 0 "】それがどうした。")
         (wait)))
       ((&& (== N 2) (== (: 235) 1) (== (: 480) 0))
        (<> (text #:color 7 "【" 0 "】そうなんだよ・・・俺はもっと夏子さんと話をしたいんだ。") (wait)))
       ((&& (== N 2) (== (: 480) 1))
        (<>
         (text #:color 2 "【夏子】" 0 "君・・・今日はもう店を閉めるわよ。")
         (wait)
         (text #:color 7 "【" 0 "】うん・・・。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 235) 0) (== (: 10) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君は、一哉君と同じ歳なのかしら？")
      (wait)
      (text #:color 5 "【一哉】俺はいやだけど、なぜかそうなんだよな。")
      (wait)
      (text #:color 7 "【" 0 "】それは俺のセリフだ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 235) 0) (== (: 10) 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんって・・・この店のオーナーとか？")
      (wait)
      (text #:color 2 "【夏子】まさか・・・私は専門学校の学生で・・・夏休みの間、このブティックでアルバイトしてるだけよ。")
      (wait)
      (text #:color 5 "【一哉】夏子さんはだな、テキスタイルを勉強してるんだ・・・どうだ、偉いだろう。")
      (wait)
      (text #:color 2 "【夏子】こんなお店が持てたらいいわね・・・自分でデザインした服を並べて、お客さんがそれを買ってくれる・・・。")
      (wait)
      (text #:color 2 "【夏子】考えただけで、幸せな気分になってくるわ。")
      (wait)
      (text #:color 5 "【一哉】夏子さん・・・あなただったら、きっとできますよ。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君もそう思う？")
      (wait)
      (text #:color 7 "【" 0 "】え？・・・俺？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "できると思う") (text "無理だよ") (text "パパをみつけろ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】できると思うぜ・・・そんな気がする。")
         (wait)
         (text #:color 2 "【夏子】・・・ありがとう。")
         (wait)
         (set-reg: 109 (+ (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】無理に決ってるじゃないか・・・世の中はそんなに甘くない。")
         (wait)
         (text #:color 2 "【夏子】そうよね・・・そうかもしれないわ。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】パパを見つければ、何とかなるかな？")
         (wait)
         (text #:color 2 "【夏子】・・・パパ？")
         (wait)
         (text #:color 7 "【" 0 "】パトロンの事だよ・・・自分の身体を捧げて、スポンサーになってもらうのさ。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 5 "【一哉】お前・・・とんでもない事を言うな。")
         (wait)
         (set-reg: 109 (- (: 109) 2))))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 235) 0) (== (: 11) 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君も、何か欲しい服があれば・・・一緒に選んであげる。")
      (wait)
      (text #:color 7 "【" 0 "】いや・・・俺は一哉につきあっただけだから。")
      (wait)
      (text #:color 5 "【一哉】くるみのプレゼント・・・何にしようかな？")
      (wait)
      (text #:color 2 "【夏子】そうね・・・前に一緒に来た事がある女の子でしょ？")
      (wait)
      (text #:color 2 "【夏子】彼女だったら、あまりハデな服は好みそうにないし・・・こんなのはどうかしら？")
      (wait)
      (text #:color 5 "【一哉】うーん・・・俺はもっと、ハデなのが好きなんだけど。")
      (wait)
      (text #:color 2 "【夏子】じゃあ・・・こんなのはどう？")
      (wait)
      (text #:color 5 "【一哉】もっと、胸元がガバッと開いてるのがいい。")
      (wait)
      (text #:color 2 "【夏子】彼女にそんな服をあげるの？・・・一哉君、真面目に考えてる？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・一哉がプレゼントをする目的は不純だからな。")
      (wait)
      (text #:color 5 "【一哉】それ以上喋ったら、本気で怒るぞ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 235) 0) (== (: 12) 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、くるみちゃんの事を知ってるんだ。")
      (wait)
      (text #:color 2 "【夏子】ええ、２回ぐらいかしら・・・一哉君と一緒に来た事があるのよ。")
      (wait)
      (text #:color 7 "【" 0 "】なるほど・・・１回目は偶然店に入っただけで、２回目は夏子さんが目当てで来たんだな。")
      (wait)
      (text #:color 5 "【一哉】分析をするな、分析を。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 235) 0) (== (: 13) 1) (== (: 151) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんって・・・いくつなんだろう？")
      (wait)
      (text #:color 5 "【一哉】夏子さんの事は、俺にまかせておけ・・・彼女は２１歳だ。")
      (wait)
      (text #:color 7 "【" 0 "】一哉に聞いてないだろ？")
      (wait)
      (text
       #:color
       2
       "【夏子】私って、歳上に見られるのよ・・・仕事をしてる時はその方がいいんだけど、プライベートの時はちょっと悔しいわね。")
      (wait)
      (text #:color 5 "【一哉】夏子さん、これなんかどうかな・・・くるみには、白が似合いそうな気がするんだ。")
      (wait)
      (text #:color 2 "【夏子】そうね・・・いいじゃない、彼女に似合いそうだわ。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】なーるほど・・・それを着てもらって、汗をかけば下着がスケスケになって・・・そのままダーーーッといくわけか。")
      (wait)
      (text #:color 5 "【一哉】うるさい・・・そんな事より、悪いな" 0 "。")
      (wait)
      (text #:color 7 "【" 0 "】何がだ？")
      (wait)
      (text #:color 5 "【一哉】俺は金がない・・・貸してくれ。")
      (wait)
      (text #:color 7 "【" 0 "】なんでお前の彼女のプレゼントを、俺が買わなきゃならんのだ！？")
      (wait)
      (text #:color 5 "【一哉】何も買ってくれとは言ってない・・・貸してくれって言ってるんだ。")
      (wait)
      (text #:color 7 "【" 0 "】あのなあ・・・。")
      (wait)
      (text #:color 5 "【一哉】利子をつけて返すなんて事は言わないし、返す時はいつでもいいって言ってるじゃないか。")
      (wait)
      (text #:color 7 "【" 0 "】お前、自分に有利な事ばかり言ってるぞ。")
      (wait)
      (text #:color 5 "【一哉】頼むよ、くるみの誕生日は明日なんだ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "貸す") (text "貸さない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】仕方がないなあ・・・１００倍にして返せよ。")
         (wait)
         (text #:color 5 "【一哉】悪い！！恩にきるぜ、" 0 "・・・たったの１万円だ。")
         (wait)
         (text #:color 7 "【" 0 "】何が『たった』だよ・・・ほら。")
         (wait)
         (set-var M (- M 10000))
         (proc 11)
         (text #:color 5 "【一哉】いやあ、悪いなあ・・・これで俺の未来は明るくなったぞ。")
         (wait)
         (text #:color 7 "【" 0 "】ったく、調子のいいやつだ。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (set-reg: 236 1)
         (set-reg: 109 (+ (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いやだ。")
         (wait)
         (text #:color 5 "【一哉】そんな事を言わないで・・・な？")
         (wait)
         (text #:color 7 "【" 0 "】いやだってば。")
         (wait)
         (text #:color 5 "【一哉】" 0 "ーーー。")
         (wait)
         (text #:color 7 "【" 0 "】犬のような目をして、猫のような声を出すな。")
         (wait)
         (text #:color 2 "【夏子】もう・・・一哉君わかったわ、私が貸してあげる。")
         (wait)
         (text #:color 5 "【一哉】えっ！？・・・ほ、本当に！？")
         (wait)
         (text #:color 2 "【夏子】だって・・・見てられないんですもの。")
         (wait)
         (text #:color 5 "【一哉】うっうっうっ・・・夏子さんは優しいなあ。")
         (wait)
         (text #:color 7 "【" 0 "】な、情けない・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 151 1)))
    ((&& (== V 2) (== N 1) (== (: 235) 0) (== (: 151) 1))
     (<>
      (text #:color 2 "【夏子】今年の夏は暑いわね・・・プールにでも行きたくなっちゃうわ。")
      (wait)
      (text #:color 7 "【" 0 "】プールかあ・・・。")
      (wait)
      (text #:color 5 "【一哉】" 0 "、夏子さんの水着姿を想像しただろ？")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 235) 1) (== (: 10) 0) (== (: 254) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君も誰かにプレゼント？")
      (wait)
      (text #:color 7 "【" 0 "】プレゼント？・・・相手がいなけりゃ始まらないよ。")
      (wait)
      (text #:color 2 "【夏子】へえ・・・" 0 "君って、モテそうに見えるけど。")
      (wait)
      (set-reg: 10 1)))
    ((&&
      (== V 2)
      (== N 1)
      (== (: 235) 1)
      (== (: 10) 1)
      (== (: 11) 0)
      (== (: 254) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君、ここはレディス専門店なのよ。")
      (wait)
      (text #:color 7 "【" 0 "】知ってるさ・・・夏子さんの顔が見たくなったんだ。")
      (wait)
      (text #:color 2 "【夏子】やだ・・・変な事を言う子ね。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 235) 1) (== (: 11) 1) (== (: 254) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君は彼女がいないの？・・・せっかくの夏休みなのに寂しくない？")
      (wait)
      (text #:color 7 "【" 0 "】こうやって、夏子さんに会ってる時だけが寂しくないな。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君って、口がうまいのね。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 254) 1) (== (: 255) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえ夏子さん・・・。")
      (wait)
      (text #:color 2 "【夏子】なに？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "デートしよう") (text "キスしよう") (text "パンツを脱ごう")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺とデートしない？")
         (wait)
         (text #:color 2 "【夏子】よく言うわね・・・私、仕事があるから。")
         (wait)
         (text #:color 7 "【" 0 "】仕事を休んで、俺とデートしようよ。")
         (wait)
         (text #:color 2 "【夏子】大人はね、そんな事はできないの・・・わかった？")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ここで・・・キスしない？")
         (wait)
         (text #:color 2 "【夏子】え！？")
         (wait)
         (text #:color 7 "【" 0 "】都合がいい事に俺達以外、誰もいないし・・・いいだろ？")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、私はいったい何なの？")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・怒った？")
         (wait)
         (text #:color 2 "【夏子】あたり前でしょ。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】パンツを脱ごう・・・一緒に。")
         (wait)
         (text #:color 2 "【夏子】女装でもするの？・・・" 0 "君に似合う服を用意してあげるわよ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、似合うかな・・・こんなりりしい顔をした俺様が女装だなんて。")
         (wait)
         (text #:color 2 "【夏子】けっこういけるんじゃない？・・・化粧をすれば、バッチリかもしれないわ。")
         (wait)))
       (else (<>)))
      (set-reg: 255 1)))
    ((&& (== V 2) (== N 1) (== (: 255) 1) (== (: 10) 0) (< H 813))
     (<>
      (text #:color 2 "【夏子】ねえ、一哉君はどうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】どうしたのって・・・いつも一緒に行動してる訳じゃないさ。")
      (wait)
      (text #:color 2 "【夏子】そうよね・・・そうだったわね。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 255) 1) (== (: 10) 1) (< H 813))
     (<>
      (text #:color 2 "【夏子】この店も夏休みがあるのよ・・・まだいつになるか決ってないけど。")
      (wait)
      (text #:color 7 "【" 0 "】へえ、夏休みか・・・考えてみたら一ヶ月以上休んでるのは、俺達学生だけだもんな。")
      (wait)
      (text
       #:color
       2
       "【夏子】そうよー・・・今は気がつかないかもしれないけど、社会人になってから初めて、夏休みの有難みがわかってくるのよ。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん、そんなもんかねえ。")
      (wait)
      (set-reg: 10 2)))
    ((&& (== V 2) (== N 1) (== (: 255) 1) (== (: 10) 2) (< H 813))
     (<>
      (text #:color 7 "【" 0 "】どうでもいいけど、いつもお客さんがいないな。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、何か買ってくれる？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ぐーぐー。")
      (wait)
      (text #:color 2 "【夏子】寝たフリをしないで。")
      (wait)))
    ((&& (== V 2) (== N 1) (> H 812) (== (: 303) 0))
     (<>
      (text #:color 7 "【" 0 "】ねー、夏子さん・・・俺とデートしようよ。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、彼女は本当にいないの？")
      (wait)
      (text #:color 7 "【" 0 "】いないって言うか・・・特定の女の子とつき合うのが苦手なんだ。")
      (wait)
      (text #:color 2 "【夏子】ふーん・・・でもどうして？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "面倒だから") (text "単なる浮気者") (text "バカだから")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】なんとなく面倒なんだよな・・・真剣なおつき合いって言うのが。")
         (wait)
         (text #:color 2 "【夏子】じゃあ、不真面目につき合うのは得意なのね。")
         (wait)
         (text #:color 7 "【" 0 "】あれれ！？・・・そういう事になってしまうのか！？")
         (wait)
         (text #:color 2 "【夏子】ようするに" 0 "君は、遊びでないと女の子とはつき合えないんだ。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】俺って浮気者なんじゃないか？")
         (wait)
         (text #:color 2 "【夏子】自分でそう思っちゃうの？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】だって・・・かわいい子はたくさんいるし、美人もたくさんいるし・・・誰にしていいかわからないよ。")
         (wait)
         (text #:color 2 "【夏子】外見だけで女性を選ぶのもいいけど・・・長くおつき合いするのなら、中身も大事じゃない？")
         (wait)
         (text #:color 7 "【" 0 "】そうか・・・そうだよな。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】バカなんだろうな・・・俺。")
         (wait)
         (text #:color 2 "【夏子】どうしてそう思うの？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】だってさ・・・正直言って、いつも女の子の事ばかり考えて、実際に女の子のお尻を追っかけて・・・。")
         (wait)
         (text #:color 2 "【夏子】それで？")
         (wait)
         (text #:color 7 "【" 0 "】それで本当に好きな女性ができないなんて・・・バカだよ、俺は。")
         (wait)
         (text #:color 2 "【夏子】真剣に悩んでいる男の子の顔って、母性本能をくすぐられちゃうわね・・・ふふふ。")
         (wait)
         (set-reg: 109 (+ (: 109) 1))))
       (else (<>)))
      (set-reg: 303 1)))
    ((&& (== V 2) (== N 1) (== H 813) (== (: 10) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君って・・・ワンパク少年って感じね。")
      (wait)
      (text #:color 7 "【" 0 "】ワンパクって死語だぜ。")
      (wait)
      (text #:color 2 "【夏子】そうかしら？・・・昔、ＣＭでよく聞いた覚えがあるけど。")
      (wait)
      (text #:color 7 "【" 0 "】それって、１０年くらい前じゃない？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== H 813) (== (: 10) 1))
     (<>
      (text #:color 2 "【夏子】" 0 "君、いつか素敵な彼女が見つかるわよ。")
      (wait)
      (text #:color 7 "【" 0 "】なんか、夏子さんにそんな事を言われたくないなあ・・・。")
      (wait)))
    ((&& (== V 2) (== N 1) (== H 814) (== (: 10) 0))
     (<>
      (text #:color 2 "【夏子】ねえ・・・一哉君と彼女って、うまくいってるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】どうしてそんな事を聞くんだい？")
      (wait)
      (text #:color 2 "【夏子】なんだか様子が変なのよ・・・一緒に来なくなったし、一哉君と話をしても彼女の話をしないし。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 2 "【夏子】以前は、彼女の話ばかりしてたのよ・・・変でしょ？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== H 814) (== (: 10) 1))
     (<>
      (text
       #:color
       2
       "【夏子】夏は出会いの季節なのよね・・・何も行動しなければ、日に焼ける事もないし、素敵な人と知り合える事もない・・・か。")
      (wait)
      (text #:color 7 "【" 0 "】俺と知り合えたじゃないか・・・ははは。")
      (wait)
      (text #:color 2 "【夏子】だって・・・" 0 "君って歳下でしょ？")
      (wait)
      (text #:color 7 "【" 0 "】平均寿命は女の方が長いんだから、歳下ぐらいが丁度いいんだよ。")
      (wait)))
    ((&& (== V 2) (== N 1) (== H 815) (== (: 304) 0))
     (<>
      (text #:color 2 "【夏子】恋愛をすればするほど、男も女も素敵になっていくのよ・・・わかるかしら？")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ、夏子さんは恋愛ばかりしてるんだ。")
      (wait)
      (text #:color 2 "【夏子】どうして？")
      (wait)
      (text #:color 7 "【" 0 "】だって・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "スケベだから") (text "素敵だから") (text "黒そうだから")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】だって・・・夏子さんってスケベそうだから。")
         (wait)
         (text #:color 2 "【夏子】失礼ね・・・女はね、好きな人だけにスケベになるのよ。")
         (wait)
         (text #:color 7 "【" 0 "】ほーら、スケベなんじゃないか。")
         (wait)
         (text #:color 2 "【夏子】残念でした・・・私は今、好きな人がいないからスケベじゃないわよ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】素敵だから・・・。")
         (wait)
         (text #:color 2 "【夏子】やだ・・・照れちゃうわね。")
         (wait)
         (text #:color 7 "【" 0 "】いや・・・本当に素敵だと思う。")
         (wait)
         (text #:color 2 "【夏子】悪い気はしないけど・・・どこが素敵なのか、自分ではよくわからないわ。")
         (wait)
         (set-reg: 109 (+ (: 109) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】黒そうだな・・・うん。")
         (wait)
         (text #:color 2 "【夏子】え？")
         (wait)
         (text #:color 7 "【" 0 "】夏子さんって、乳首もコーマンも黒そうだって言ったのさ。")
         (wait)
         (text #:color 2 "【夏子】ひ、ひどーいっ！！")
         (wait)
         (text #:color 7 "【" 0 "】ははは、冗談だよ・・・シャレだよ、シャレ。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       (else (<>)))
      (set-reg: 304 1)))
    ((&& (== V 2) (== N 1) (== H 815) (== (: 304) 1))
     (<>
      (text #:color 2 "【夏子】働きながら、勉強して・・・私って真面目だわ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・自分で言ってるよ。")
      (wait)))
    ((&& (== V 2) (== N 1) (== H 816) (== (: 10) 0) (== (: 480) 0))
     (<>
      (text
       #:color
       2
       "【夏子】夏休みの土曜の夜は、何かが起こりそうって・・・学生の時はいつも思ってたのよ、"
       0
       "君もそうでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】土曜の夜は何かが起こるって・・・もしかして恐い話？")
      (wait)
      (text #:color 2 "【夏子】違うわよ・・・何もない一日より、たとえ悪い事でも変化があった方がいいって事。")
      (wait)
      (text #:color 7 "【" 0 "】変な考え方だな・・・悪い事なんて起こらない方がいいに決まってる。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== H 816) (== (: 10) 1) (== (: 480) 0))
     (<>
      (text #:color 2 "【夏子】この店も連休があるのよ・・・まだいつになるか決まってないけど。")
      (wait)
      (text #:color 7 "【" 0 "】（連休があるのか・・・その時がチャンスだな。）")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 480) 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君、一哉君と会ってるの？")
      (wait)
      (text #:color 7 "【" 0 "】会ってると言うか・・・街で偶然出会って、ちょっと話をするぐらいだな。")
      (wait)
      (text #:color 2 "【夏子】ふーん・・・。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 480) 1) (== (: 10) 1))
     (<>
      (text #:color 2 "【夏子】" 0 "君、また会えるといいわね。")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんて・・・どこに住んでるの？")
      (wait)
      (text #:color 2 "【夏子】ふふふ・・・内緒よ。")
      (wait)))
    ((&& (== V 2) (== N 1)) (<> (text #:color 2 "【夏子】" 0 "君、私に何か用？") (wait)))
    ((&& (== V 1) (== N 2) (== (: 235) 0) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】黒くて、長い髪だ・・・。")
      (wait)
      (text #:color 5 "【一哉】" 0 "、ぞぞっと来ないか？・・・あの髪を触ってみたいって。")
      (wait)
      (text #:color 7 "【" 0 "】くるくる。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 2) (== (: 235) 0) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】長いぜ・・・すごく長い。")
      (wait)
      (text #:color 5 "【一哉】俺のポコチンか？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・一哉のは、直径５センチで長さ３センチだろ？")
      (wait)
      (text #:color 5 "【一哉】缶詰じゃないか、それじゃあ。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 235) 1) (== (: 14) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】奇麗な黒髪だな・・・もしかして夏子さんは、カラスの生まれ変わりとか？")
      (wait)
      (text #:color 2 "【夏子】変な事を言わないで。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 2) (== (: 235) 1) (== (: 14) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】長い黒髪・・・長いまつ毛。")
      (wait)
      (text #:color 7 "【" 0 "】そして、妙に長い脇毛。")
      (wait)
      (text #:color 2 "【夏子】・・・見えないでしょ？")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】（この髪の毛を見るのも・・・最後なのか？）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 235) 0) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】奇麗な人だよな・・・。")
      (wait)
      (text #:color 5 "【一哉】な？・・・俺に感謝しただろ？")
      (wait)
      (text #:color 7 "【" 0 "】まあ・・・な。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 3) (== (: 235) 0) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】肌が奇麗だな・・・まるで『らっきょう』みたいだ。")
      (wait)
      (text #:color 5 "【一哉】もう少し・・・マシなたとえがあるだろ？")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 235) 1) (== (: 15) 0) (== (: 480) 0))
     (<> (text #:color 7 "【" 0 "】大人の女性って感じだぜ・・・。") (wait) (set-reg: 15 1)))
    ((&& (== V 1) (== N 3) (== (: 235) 1) (== (: 15) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】彼女は俺の事を見てるな・・・気があるのか？")
      (wait)
      (text #:color 2 "【夏子】ずいぶんと自信があるのね・・・でも、私と" 0 "君しかいないのよ。")
      (wait)
      (text #:color 7 "【" 0 "】くっくっくっ・・・二人きりか。")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】（夏子さんの顔も・・・これで見おさめなのかな？）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 235) 0) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】白魚の踊りを食べているような手だ。")
      (wait)
      (text #:color 5 "【一哉】え！？")
      (wait)
      (text #:color 7 "【" 0 "】いいんだよ、俺はそう思ったんだから。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 4) (== (: 235) 0) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】ああ・・・あの白い手で、こすってもらいたい。")
      (wait)
      (text #:color 7 "【" 0 "】と、一哉は思ってるんだろ？")
      (wait)
      (text #:color 5 "【一哉】人にふるな、人に。")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 235) 1) (== (: 16) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえ、どうして手を顔にくっつけてるんだ？")
      (wait)
      (text #:color 2 "【夏子】別にくっつけてる訳じゃないわ・・・癖なの。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 4) (== (: 235) 1) (== (: 16) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】指輪をしてないようだな・・・独身でしょ？")
      (wait)
      (text #:color 2 "【夏子】あたりまえよ・・・３０歳まで結婚をする気はないわ。")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】（結局、夏子さんの手すら握る事ができなかった・・・。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 235) 0) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】女の人って、どうして首が細いんだろ？")
      (wait)
      (text #:color 5 "【一哉】その分、顔も小さいんじゃないか？")
      (wait)
      (text #:color 7 "【" 0 "】俺達はでかいもんな・・・頭蓋骨は夏子さんの１．５倍はあるぜ。")
      (wait)
      (text #:color 5 "【一哉】俺達って言うなよ。")
      (wait)
      (text #:color 7 "【" 0 "】何を言ってるんだ・・・俺は１．５倍だが、一哉は２倍だぜ。")
      (wait)
      (text #:color 5 "【一哉】俺は化物かよう。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 5) (== (: 235) 0) (== (: 17) 1))
     (<>
      (text #:color 5 "【一哉】一週間ぐらい何も食べなければ、夏子さんと同じような首になれるかな？")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】仮りに細くなったとしても、顔の大きさは変わってないぜ・・・バランスが悪くなるだけだ、歩くたびに顔がグラグラしていたらみっともないぜ。")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 235) 1) (== (: 17) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】細い首だ・・・内緒だけどキスしたい。")
      (wait)
      (text #:color 2 "【夏子】聞こえてるわよ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 5) (== (: 235) 1) (== (: 17) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ、そんなに首が細いと・・・折れた事が何度かあるでしょ？")
      (wait)
      (text #:color 2 "【夏子】ないわよ・・・首の骨が折れたら死んじゃうわ。")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 480) 1))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんの首筋を・・・ああ、一度もなめないで俺は一生を終えるのか！？）")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 235) 0) (== (: 18) 0))
     (<>
      (text #:color 5 "【一哉】" 0 "・・・でかいだろ？")
      (wait)
      (text #:color 7 "【" 0 "】まあな。")
      (wait)
      (text #:color 5 "【一哉】お前、何の事を言ってるんだ！？")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 6) (== (: 235) 0) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・想像しただけで、心の中が甘酸っぱくなりそうだ。")
      (wait)
      (text #:color 5 "【一哉】くんくんくん・・・俺は脇の下が甘酸っぱいぞ。")
      (wait)
      (text #:color 7 "【" 0 "】それは汗くさいだけだ・・・くるみちゃんに嫌われるぞ。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 235) 1) (== (: 18) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】けっこうでかいぜ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、でかい。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】でかいなあ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 6) (== (: 235) 1) (== (: 18) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんは色黒だから、乳首も真っ黒だろう。")
      (wait)
      (text #:color 2 "【夏子】ピンクよ・・・見てみる？")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】（俺の人生とは無関係の胸だな・・・ちぇっ。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 235) 0) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】一哉がへらへらしてる理由がわかったよ。")
      (wait)
      (text #:color 5 "【一哉】だろう？")
      (wait)
      (text #:color 7 "【" 0 "】しかし一哉もいい根性してるよな・・・彼女のプレゼントを口実に、夏子さんに会いに来てるんだから。")
      (wait)
      (text #:color 5 "【一哉】それはそれ、これはこれ、だ。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 7) (== (: 235) 0) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん、素敵な人だ・・・お友達になりたい。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】正直に言うと、お友達以上の関係になりたい。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 235) 1) (== (: 19) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんだぜ・・・一哉が毎晩『おなにい』のネタにしてる女性だ。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、何か言った？")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 7) (== (: 235) 1) (== (: 19) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】『正樹　夏子』さんだ・・・テキスタイルの勉強をしてて、２１歳で、男の人が大好きなんだ。")
      (wait)
      (text #:color 2 "【夏子】男の人は好きだけど、大好きって言われると・・・ちょっと抵抗があるわね。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】（夏子さん・・・もう会えないのか？）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 20) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】色々な服がディスプレイされているが・・・みんな女性の服ばかりだ。")
      (wait)
      (text #:color 2 "【夏子】ここはレディス専門なの・・・ごめんなさいね。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】" 0 "だったら、女性物の下着でも大丈夫だよな。") (wait))
        (<>))
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 8) (== (: 20) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】色々な服が飾られているな・・・。")
      (wait)
      (if-else (== (: 235) 0) (<> (text #:color 5 "【一哉】盗むなよ。") (wait)) (<>))))
    ((&& (== V 1) (== N 8) (== (: 480) 1))
     (<> (text #:color 2 "【夏子】洋服に囲まれて仕事をするのも、これでおしまいね。") (wait)))
    ((&& (== V 1) (== N 9) (== (: 21) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】ここは試着室だな・・・入ってもいい？")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、ここはレディス専用よ・・・それに何に着替えるの？")
      (wait)
      (text #:color 7 "【" 0 "】セーラー服。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君って、そんなものを持ち歩いてるの？")
      (wait)
      (if-else (== (: 235) 0)
        (<>
         (text #:color 5 "【一哉】夏子さん、それだけじゃないですよ・・・看護婦の制服とスチュワーデスの制服も持ち歩いています。")
         (wait))
        (<>))
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 9) (== (: 21) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】試着室だな・・・中は女体の臭気でいっぱいだ。")
      (wait)
      (text #:color 2 "【夏子】いやな言い方をするわね・・・。")
      (wait)
      (if-else (== (: 235) 0)
        (<>
         (text #:color 5 "【一哉】そうだぜ・・・どうせだったら、体臭でいっぱいだと言え。")
         (wait)
         (text #:color 2 "【夏子】それもいやね。")
         (wait))
        (<>))))
    ((&& (== V 1) (== N 9) (== (: 480) 1))
     (<> (text #:color 2 "【夏子】この試着室を使ったお客さんって・・・数えるほどしかいなかったわ。") (wait)))
    ((&& (== V 1) (== N 10) (== (: 22) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】小さな絵が飾ってある・・・風景画のようだ。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君も絵に興味があるの？・・・私も絵が大好きよ。")
      (wait)
      (text #:color 7 "【" 0 "】俺は絵よりも、夏子さんの身体に興味がある。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】ちょっと待て・・・俺の方が先だぜ。") (wait))
        (<>))
      (text #:color 2 "【夏子】あまりにもすごい事を言うから、逆に気にならないわね。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 10) (== (: 22) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】絵だな・・・興味はないぜ。")
      (wait)
      (text #:color 2 "【夏子】言い切ったわね。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】" 0 "には、情緒ってもんがないからなあ。") (wait))
        (<>))))
    ((&& (== V 1) (== N 10) (== (: 480) 1))
     (<>
      (text #:color 2 "【夏子】" 0 "君って絵が好きなの？")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんが好き。")
      (wait)
      (text #:color 2 "【夏子】ありがとう・・・うれしいわ。")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 23) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】何かのパネルだな・・・アクリルの板が光ってて、よく見えないや。")
      (wait)
      (if-else (== (: 235) 0)
        (<>
         (text #:color 5 "【一哉】" 0 "、きょろきょろしていると誤解されるぜ・・・。")
         (wait)
         (text #:color 7 "【" 0 "】いったい何を誤解されるんだ！？")
         (wait))
        (<>))
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 11) (== (: 23) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】アルミフレームのパネルだ・・・俗に言う『イレパネ』ってやつだな。")
      (wait)
      (text #:color 2 "【夏子】へえ・・・詳しいのね。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】夏子さん、感心するほどの事じゃないですよ。") (wait))
        (<>))))
    ((&& (== V 1) (== N 11) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】（あーあ・・・何を見てもため息が出るだけだ。）") (wait)))
    ((&& (== V 1) (== N 12) (== (: 24) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】ぼんやりと、５ワットぐらいの電球がともっている・・・。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】どうして５ワットってわかるんだ？") (wait))
        (<>))
      (text #:color 2 "【夏子】そんな言い方をされると、裸電球が天井から下がっているみたい・・・インテリアの一部になってる間接光よ。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 12) (== (: 24) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】店が営業してる時は、この電気はいつもついてるんだろう。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】" 0 "、この店は午後７時までやってるんだぜ。") (wait))
        (<>))))
    ((&& (== V 1) (== N 12) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】照明なんかどうでもいいよ・・・もう。") (wait)))
    ((&& (== V 1) (== N 13) (== (: 25) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】靴も売ってるんだな・・・夏子さん、シークレットシューズは売ってないの？")
      (wait)
      (text #:color 2 "【夏子】ありません。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】" 0 "、くだらない事ばかり言うな。") (wait))
        (<>))
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 13) (== (: 25) 1) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】靴が並べられている・・・俺に似合いそうなハイヒールはないぞ。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】なあ・・・本当に変なやつだと思われるぜ。") (wait))
        (<>))))
    ((&& (== V 1) (== N 13) (== (: 480) 1))
     (<>
      (text #:color 7 "【" 0 "】あーあ・・・靴までむなしく見えるぜ。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、そんな事を言わないで。")
      (wait)))
    ((&& (== V 1) (== N 14) (== (: 26) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】店内はさほど広くないな・・・。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】だからいいんだよ・・・店の中には夏子さんしかいないしな。") (wait))
        (<>))
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 14) (== (: 27) 0) (== (: 480) 0))
     (<>
      (text #:color 7 "【" 0 "】冷房がきいてて気持ちいいな・・・これからちょくちょく涼みに来よう。")
      (wait)
      (if-else (== (: 235) 0)
        (<> (text #:color 5 "【一哉】夏子さんに迷惑をかけるんじゃないぞ。") (wait))
        (<>))))
    ((&& (== V 1) (== N 14) (== (: 480) 1))
     (<> (text #:color 7 "【" 0 "】（この店から夏子さんがいなくなるなんて・・・ああ、なんてこったい！！）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))