(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\し
  #\い
  #\。
  #\な
  #\よ
  #\こ
  #\っ
  #\の
  #\、
  #\て
  #\た
  #\で
  #\は
  #\ん
  #\に
  #\か
  #\だ
  #\う
  #\ま
  #\ら
  #\す
  #\？
  #\あ
  #\と
  #\が
  #\る
  #\ー
  #\を
  #\も
  #\れ
  #\君
  #\り
  #\（
  #\）
  #\く
  #\事
  #\け
  #\ど
  #\き
  #\そ
  #\生
  #\言
  #\ゃ
  #\じ
  #\ね
  #\さ
  #\ン
  #\わ
  #\え
  #\子
  #\先
  #\ょ
  #\俺
  #\学
  #\目
  #\せ
  #\コ
  #\ち
  #\来
  #\話
  #\ピ
  #\知
  #\ぜ
  #\女
  #\み
  #\タ
  #\や
  #\何
  #\ュ
  #\見
  #\聞
  #\つ
  #\真
  #\面
  #\校
  #\人
  #\将
  #\男
  #\今
  #\私
  #\気
  #\お
  #\中
  #\ろ
  #\一
  #\ふ
  #\ト
  #\ラ
  #\好
  #\分
  #\チ
  #\変
  #\駄
  #\思
  #\ア
  #\め
  #\へ
  #\時
  #\ロ
  #\ッ
  #\ル
  #\関
  #\係
  #\卒
  #\自
  #\ご
  #\イ
  #\ス
  #\怒
  #\業)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "12.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "c.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "can.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "c.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 60)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "c13.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 633) 0)
   (<>
    (text #:color 6 "【よしこ】あ・・・" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】ごきげんよう、よしこ先生。")
    (wait)
    (text #:color 6 "【よしこ】ちょっと待ちなさい・・・今日は" 0 "君に用があって来たんです。")
    (wait)
    (text #:color 7 "【" 0 "】俺のサインが欲しいとか？")
    (wait)
    (text #:color 6 "【よしこ】いいえ・・・" 0 "君のお家に、お邪魔したくて来たんです。")
    (wait)
    (text #:color 7 "【" 0 "】お断わりします。")
    (wait)
    (text #:color 6 "【よしこ】駄目ですよ、特にあなたは問題児なんですから。")
    (wait)
    (text #:color 7 "【" 0 "】よしこ先生、そういう言い方はよくないと思うぜ。")
    (wait)
    (text #:color 6 "【よしこ】さあ、家の中に入りましょう。")
    (wait)
    (text #:color 7 "【" 0 "】ち、ちょっと・・・人の言う事、聞いてる！？")
    (wait)
    (slot 1 2)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "42.pd8")
    (proc 15)
    (set-arr~ @ 6 1)
    (image "c.pd8")
    (proc 16)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "can.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "c.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】あーあ・・・勝手に部屋に入っちゃったよ。")
    (wait)
    (text #:color 6 "【よしこ】人聞きの悪い事を言わないで・・・あなたが鍵を開けてくれたんじゃないですか。")
    (wait)
    (text #:color 7 "【" 0 "】ドアの前でじっと立たれたら、開けないわけにいかないだろう？")
    (wait)
    (text #:color 6 "【よしこ】思ったよりも汚れてませんね・・・。")
    (wait)
    (text #:color 7 "【" 0 "】（うーん、俺の言う事を聞いてないな。）")
    (wait)
    (text #:color 6 "【よしこ】今日は" 0 "君の将来について、じっくりと話をしましょう。")
    (wait)
    (text #:color 7 "【" 0 "】俺の将来？・・・いいよ、別に。")
    (wait)
    (text #:color 6 "【よしこ】そうはいきません、あなただけ特別扱いする訳にはいきませんから・・・他の生徒と同様に進路指導をしないと。")
    (wait)
    (text #:color 7 "【" 0 "】（苦手なんだよなあ・・・こういうの。）")
    (wait)
    (text #:color 6 "【よしこ】" 0 "君、椅子を借りますよ・・・いいですね。")
    (wait)
    (slot 1 7)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "c13.pd8")
    (proc 15)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "c13an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "c13.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 6 "【よしこ】さあ、これでいいです・・・話をしましょう、" 0 "君。")
    (wait)
    (set-reg: 633 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "逃げる") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 6 "【よしこ】" 0 "君、どこに行くんですか・・・まだ話は終ってませんよ。")
         (wait)
         (set-reg: 50 1)))
       ((&& (== N 1) (== (: 50) 1))
        (<> (text #:color 6 "【よしこ】" 0 "君、きょろきょろしないで。") (wait)))
       ((&& (== N 2) (== (: 49) 0))
        (<> (text #:color 7 "【" 0 "】（あきらめて・・・話をするか。）") (wait)))
       ((&& (== N 2) (== (: 49) 1))
        (<> (text #:color 7 "【" 0 "】（うーん・・・退屈だけど、仕方がないな。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 6 "【よしこ】" 0 "君は確か、一人暮しでしたね。")
      (wait)
      (text #:color 7 "【" 0 "】そうだよーん。")
      (wait)
      (text #:color 6 "【よしこ】真面目に話をしなさい。")
      (wait)
      (text #:color 7 "【" 0 "】へいへい。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 10) 1))
     (<>
      (text #:color 6 "【よしこ】一人暮しは・・・寂しくないですか？")
      (wait)
      (text #:color 7 "【" 0 "】ふっ・・・よしこ先生、俺はこれでも世界で２番目に孤独を愛する男なんだぜ。")
      (wait)
      (text #:color 6 "【よしこ】１番目は誰なんですか？")
      (wait)
      (text #:color 7 "【" 0 "】スナフキン。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君・・・時間の無駄ですから、真面目に話をしましょうね。")
      (wait)
      (set-reg: 10 2)))
    ((&& (== V 2) (== N 1) (== (: 10) 2))
     (<>
      (cond
       ((== (: 15) 0)
        (<>
         (text #:color 6 "【よしこ】" 0 "君は、将来何になりたいの？")
         (wait)
         (text #:color 7 "【" 0 "】飛行機のパイロット。")
         (wait)
         (text #:color 6 "【よしこ】子供に聞いてる訳じゃないです・・・真面目に答えなさい。")
         (wait)
         (text #:color 7 "【" 0 "】えーと・・・。")
         (wait)))
       ((== (: 15) 1)
        (<>
         (text #:color 6 "【よしこ】もう一度聞きます・・・" 0 "君は、何になるつもりなの？")
         (wait)
         (text #:color 7 "【" 0 "】えーと、俺は・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 11) 0) (text "パイロット"))
        (if (== (: 12) 0) (text "ウルトラマン"))
        (if (== (: 13) 0) (text "女になりたい"))
        (if (== (: 14) 0) (text "ジゴロ"))
        (text "真面目に答える")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】僕、パイロットになりたい。")
         (wait)
         (text #:color 6 "【よしこ】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・怒ったでしょ？")
         (wait)
         (set-reg: 11 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】僕、ウルトラマンになりたい。")
         (wait)
         (text #:color 6 "【よしこ】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・怒ったでしょ？")
         (wait)
         (set-reg: 12 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】やだあ、私ってえ、女になりたいのお。")
         (wait)
         (text #:color 6 "【よしこ】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・怒ったでしょ？")
         (wait)
         (set-reg: 13 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】ふっ・・・俺みたいな男は、ジゴロになるしかないだろ、ん？")
         (wait)
         (text #:color 6 "【よしこ】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・怒ったでしょ？")
         (wait)
         (set-reg: 14 1)))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】そうだなあ・・・俺が得意な事って言うと、女の子とコンピューターだからな。")
         (wait)
         (text #:color 6 "【よしこ】コンピューター？")
         (wait)
         (text #:color 7 "【" 0 "】ほら、机の上に乗ってる・・・その機械の事さ。")
         (wait)
         (text #:color 6 "【よしこ】" 0 "君って、コンピューターが好きだったの・・・知りませんでした。")
         (wait)
         (text #:color 7 "【" 0 "】知らなくて当然だよ・・・一哉ぐらいしか知らないからな。")
         (wait)
         (set-reg: 10 3)))
       (else (<>)))
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 10) 3))
     (<>
      (text #:color 6 "【よしこ】将来はコンピューター関係に進みたいんですね。")
      (wait)
      (text #:color 7 "【" 0 "】女の子とコンピューターって言ったんだぜ・・・将来は女の子関係に進みたいんだ。")
      (wait)
      (text #:color 6 "【よしこ】真面目に話をしましょう・・・コンピューター関係ですね？")
      (wait)
      (text #:color 7 "【" 0 "】いいや、わからないな・・・もしかしたら、本当にパイロットになってるかも。")
      (wait)
      (text #:color 6 "【よしこ】来年は卒業なのに、そんなふざけた事を言ってていいんですか？")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・セックスがしたいなあ。")
      (wait)
      (text #:color 6 "【よしこ】はあ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】そんな深いため息をつかないでくれよう。")
      (wait)
      (set-reg: 10 4)))
    ((&& (== V 2) (== N 1) (== (: 10) 4))
     (<>
      (text #:color 6 "【よしこ】" 0 "君は頭はいいと思うけど・・・どうして学校の成績は悪いのかしら。")
      (wait)
      (text #:color 7 "【" 0 "】簡単だよ、学校の勉強に興味がないからさ。")
      (wait)
      (text #:color 6 "【よしこ】じゃあ・・・何に興味があるの？")
      (wait)
      (text #:color 7 "【" 0 "】女の子。")
      (wait)
      (text #:color 6 "【よしこ】女の子の事は、学校を卒業してからでも遅くないでしょう？")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】ちっちっちっ・・・２０歳でフェラーリに乗れるのと、１００歳になってからフェラーリに乗れるのとじゃ、その人の人生ってまったく違うと思わない？")
      (wait)
      (text #:color 6 "【よしこ】？？？")
      (wait)
      (text #:color 7 "【" 0 "】ようするに・・・俺が今したい事は、今じゃなきゃ駄目なんだ。")
      (wait)
      (text #:color 6 "【よしこ】先生は・・・車に詳しくありません。")
      (wait)
      (text #:color 7 "【" 0 "】駄目だなあ・・・もっと広く、色々な事を勉強しないと。")
      (wait)
      (text #:color 6 "【よしこ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】学校で教える事だけが知識じゃないぜ・・・ん？")
      (wait)
      (set-reg: 10 5)))
    ((&& (== V 2) (== N 1) (== (: 45) 0))
     (<>
      (text #:color 6 "【よしこ】コンピューター関係って事は、専門学校に進むつもりですか？")
      (wait)
      (text #:color 7 "【" 0 "】うん、専門学校もいいな・・・花嫁学校なんかどう？")
      (wait)
      (text #:color 6 "【よしこ】はあ？")
      (wait)
      (text #:color 7 "【" 0 "】あれは専門学校じゃないか・・・ははは、失礼しました。")
      (wait)
      (text #:color 6 "【よしこ】自分で言って、自分でオチをつけないでください。")
      (wait)
      (set-reg: 45 1)))
    ((&& (== V 2) (== N 1) (== (: 45) 1))
     (<>
      (text #:color 6 "【よしこ】" 0 "君、真面目に話をしてますか？")
      (wait)
      (text #:color 7 "【" 0 "】先生・・・こんなに真面目な気分になったのは、生まれて初めての事なんだ。")
      (wait)
      (text #:color 6 "【よしこ】ならいいですけど・・・で、コンピューターですよね？")
      (wait)
      (text #:color 7 "【" 0 "】何が？")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君がです。")
      (wait)
      (text #:color 7 "【" 0 "】俺はコンピューターじゃないよ・・・人間だ。")
      (wait)
      (text #:color 6 "【よしこ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・ちょっと真面目じゃなかったかな？")
      (wait)
      (set-reg: 45 2)))
    ((&& (== V 2) (== N 1) (== (: 45) 2))
     (<>
      (text #:color 6 "【よしこ】" 0 "君、自分の将来の事ですよ。")
      (wait)
      (text #:color 7 "【" 0 "】先生はいつ結婚するの？")
      (wait)
      (text #:color 6 "【よしこ】そんな事を話してません。")
      (wait)
      (text #:color 7 "【" 0 "】駄目だなあ・・・自分の将来の事じゃないか。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君には関係ありません。")
      (wait)
      (text #:color 7 "【" 0 "】ねえねえ・・・好きな人はいる？")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君っ！！")
      (wait)
      (text #:color 7 "【" 0 "】いいじゃない、教えてくれたって・・・教えてくれたら俺も真面目に答えるよ。")
      (wait)
      (set-reg: 45 3)))
    ((&& (== V 2) (== N 1) (== (: 10) 5))
     (<>
      (text #:color 6 "【よしこ】わかりました・・・" 0 "君の将来の事は、また後日話をしましょう。")
      (wait)
      (text #:color 7 "【" 0 "】逃げたな。")
      (wait)
      (text #:color 6 "【よしこ】逃げてません・・・今度は" 0 "君に聞きたい事があります。")
      (wait)
      (text #:color 7 "【" 0 "】俺に聞きたい事？・・・言っておくけど童貞じゃないぜ。")
      (wait)
      (text #:color 6 "【よしこ】『黒川　さとみ』さんの事です・・・前も一度聞きましたよね。")
      (wait)
      (text #:color 7 "【" 0 "】さとみの・・・事か。")
      (wait)
      (text #:color 6 "【よしこ】どうして私がこんなに気にしてるかと言うと・・・誰にも言っちゃ駄目ですよ。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君はハチャメチャですけど・・・その反面、男気のある子だと思ってますから。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ、俺は誰にも言わない。")
      (wait)
      (text #:color 6 "【よしこ】彼女が学校の倉庫で泣いてるのを見かけました・・・あなたは彼女と仲がいいと言ってましたよね。")
      (wait)
      (text #:color 6 "【よしこ】私が聞いても何も言いませんし・・・斎藤先生にも何も相談してないようです。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君、彼女が泣く原因を知ってますか？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "知っている") (text "知らない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】知ってるけど・・・。")
         (wait)
         (text #:color 6 "【よしこ】いったい何があったんです？")
         (wait)
         (cond
          ((== (: 419) 0)
           (<>
            (text #:color 7 "【" 0 "】えーと・・・俺は何を知ってるんだっけ？")
            (wait)
            (text #:color 6 "【よしこ】" 0 "君、知らないのに知ってるなんて言わないで・・・。")
            (wait)
            (set-reg: 110 (- (: 110) 1))))
          ((== (: 419) 1)
           (<>
            (text #:color 7 "【" 0 "】知ってるけど話せない事なんだ・・・でも心配はいらないぜ、もう大丈夫さ。")
            (wait)
            (text #:color 6 "【よしこ】言いなさい。")
            (wait)
            (text #:color 7 "【" 0 "】だーめ・・・いくら先生でも、これは学校とは関係ない。")
            (wait)
            (text #:color 6 "【よしこ】・・・。")
            (wait)))
          (else (<>)))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】知らないな・・・何も。")
         (wait)
         (text #:color 6 "【よしこ】そうですか・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 10 6)))
    ((&& (== V 2) (== N 1) (== (: 10) 6))
     (<>
      (text #:color 6 "【よしこ】さとみさんとは、確か中学の時から一緒でしたよね？")
      (wait)
      (text #:color 7 "【" 0 "】ああ、昔から口の悪いやつだったな・・・今ではもっとひどいけど。")
      (wait)
      (text #:color 6 "【よしこ】だから心配なんです・・・他の生徒ならともかく、あの子が泣くなんてただ事じゃありませんから。")
      (wait)
      (text #:color 7 "【" 0 "】中学の時からそうだったぜ。")
      (wait)
      (text #:color 6 "【よしこ】彼女・・・どんな子だったんですか？")
      (wait)
      (text #:color 7 "【" 0 "】どんな子って、今とあまり変わらないよ・・・そうだ、中学の時の卒業アルバムがあるぜ。")
      (wait)
      (text #:color 6 "【よしこ】卒業アルバム？")
      (wait)
      (text #:color 7 "【" 0 "】ごそごそごそ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・ほら、これが中学の時のさとみだ。")
      (wait)
      (text #:color 6 "【よしこ】どれが・・・さとみさん？")
      (wait)
      (text #:color 7 "【" 0 "】ほら、ここに写ってるのが・・・。")
      (wait)
      (slot 1 7)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "c03.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 0)
      (text #:color 6 "【よしこ】本当・・・あまり変わらないわね。")
      (wait)
      (text #:color 7 "【" 0 "】う、うん・・・。")
      (wait)
      (text #:color 6 "【よしこ】もしかして・・・" 0 "君がこれかしら？")
      (wait)
      (text #:color 7 "【" 0 "】そう・・・これが俺。")
      (wait)
      (text #:color 6 "【よしこ】やだ、これは" 0 "君じゃないわよ・・・こっちの男の子。")
      (wait)
      (text #:color 7 "【" 0 "】そう・・・こっちが俺。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君って・・・坊主頭だったのね。")
      (wait)
      (text #:color 7 "【" 0 "】それは・・・いたずらをして、坊主頭にされたんだ。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君も、昔から変わってないのね・・・。")
      (wait)
      (slot 1 7)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "c13.pd8")
      (proc 15)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "c13an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "c13.s4" (~ @ 2))
      (animate 0 0 0)
      (animate 1 0)
      (set-arr~ @ 7 0)
      (text #:color 6 "【よしこ】ありがとう、貴重な物を見せてもらったわ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・まいったな、もう。")
      (wait)
      (set-reg: 10 8)))
    ((&& (== V 2) (== N 1) (== (: 10) 8))
     (<>
      (text #:color 6 "【よしこ】卒業アルバムはいい記念になりますね・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・先生って、学生の時はどんな女の子だったの？")
      (wait)
      (text #:color 6 "【よしこ】私は・・・自分で言うのは変ですけど、勉強ができましたよ。")
      (wait)
      (text #:color 7 "【" 0 "】好きな男の子は・・・いた？")
      (wait)
      (text #:color 6 "【よしこ】・・・。")
      (wait)
      (text #:color 6 "【よしこ】いましたね・・・とても好きな男の子が。")
      (wait)
      (text #:color 7 "【" 0 "】つき合った？")
      (wait)
      (text #:color 6 "【よしこ】いいえ・・・ずっと片思いでした。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 6 "【よしこ】でもね、後から聞いたんですけど・・・その男の子も私の事が好きだったんですって。")
      (wait)
      (text #:color 6 "【よしこ】自分にもう少し勇気があれば、その人とおつき合いできてたかもしれないって・・・。")
      (wait)
      (text #:color 7 "【" 0 "】相手の男だって同じだよ・・・どうして先生の事を好きって言わなかったんだろ？")
      (wait)
      (text #:color 6 "【よしこ】わかりませんけど・・・私と同じで勇気がなかったんじゃありません？")
      (wait)
      (set-reg: 10 9)))
    ((&& (== V 2) (== N 1) (== (: 10) 9))
     (<>
      (text #:color 7 "【" 0 "】お互いに告白してれば、結婚してたりして・・・。")
      (wait)
      (text #:color 6 "【よしこ】ふふふ・・・どうでしょうね。")
      (wait)
      (text #:color 6 "【よしこ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なに？")
      (wait)
      (text #:color 6 "【よしこ】やだわ・・・私、何をしにここに来たのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・なんだっけ？")
      (wait)
      (text #:color 6 "【よしこ】・・・。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君って、変な子だわ・・・私が学生の頃の話をするなんて、いったいどうしちゃったのかしら。")
      (wait)
      (set-reg: 10 10)))
    ((&& (== V 2) (== N 1) (== (: 10) 10))
     (<>
      (text #:color 6 "【よしこ】" 0 "君が、コンピューターを好きな事はわかりました。")
      (wait)
      (text #:color 7 "【" 0 "】うんうん。")
      (wait)
      (text #:color 6 "【よしこ】でも、あくまでも勉強は大事ですからね・・・この事は変わりませんよ。")
      (wait)
      (text #:color 7 "【" 0 "】はあ・・・頑固だな。")
      (wait)
      (text #:color 6 "【よしこ】いいですか、宿題はしっかりやるように・・・それと、用もないのに職員室に来ない・・・いいですね？")
      (wait)
      (text #:color 7 "【" 0 "】へいへい。")
      (wait)
      (text #:color 6 "【よしこ】将来の話はまた後日しましょう・・・これもいいですね？")
      (wait)
      (text #:color 7 "【" 0 "】へいへい。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君、先生は帰ります・・・ドアを開けてください。")
      (wait)
      (text #:color 7 "【" 0 "】開いてるよ。")
      (wait)
      (text #:color 6 "【よしこ】・・・。")
      (wait)
      (text #:color 6 "【よしこ】ちゃんと鍵ぐらい閉めなさい、いくら男の子でも不用心すぎます。")
      (wait)
      (text #:color 7 "【" 0 "】はーい。")
      (wait)
      (text #:color 6 "【よしこ】先生の言った事を忘れないように・・・" 0 "君、先生が帰ったらちゃんと鍵をかけるんですよ。")
      (wait)
      (set-var A 1)
      (proc 13)
      (proc 11)
      (set-reg: 646 1)
      (slot 1 2)
      (mes-jump "myroom.mes")))
    ((&& (== V 1) (== N 2) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】先生・・・どうしてそんなに遠くに座るの？")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君の側は危険だからです。")
      (wait)
      (text #:color 7 "【" 0 "】ひどい・・・。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 2) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（よしこ先生のメガネを取った顔を見てみたい。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 17) 0))
     (<> (text #:color 7 "【" 0 "】（大きいぞ・・・絶対に大きい。）") (wait) (set-reg: 17 1)))
    ((&& (== V 1) (== N 3) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】（あまり見ると・・・気づかれそうだ。）")
      (wait)
      (text #:color 6 "【よしこ】・・・。")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】（足を組むから下着が見えるのか？・・・それとも、スカートが短いのかな？）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 4) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】（チラっと見えてる・・・。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】（背筋がピンとはってて・・・性格がにじみ出てるなあ。）")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 5) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】（この姿勢を猫背と言ったら、本物のネコが怒るだろう。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・奇麗な脚だ。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君、何ですって？")
      (wait)
      (text #:color 7 "【" 0 "】し、しまったあ・・・口に出して言ってしまった！？")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 6) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】（脚が長いな・・・キリンの生まれ変わりか？）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（あ・・・あれは首か。）")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<> (text #:color 7 "【" 0 "】（俺の椅子に座ってる・・・後で匂いをかごう。）") (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】先生・・・暑くない？")
      (wait)
      (text #:color 6 "【よしこ】平気ですよ・・・エアコンがきいてますから。")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<> (text #:color 7 "【" 0 "】（新学期が始まるまで、見たくもないな。）") (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】（今は夏休みだから、まったく使ってないぞ・・・正直に言うと、夏休みじゃなくても使ってない。）")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 7 "【" 0 "】（俺のポコチンは立ってないが、ペンは立ってるな・・・くだらない事を考えてしまった。）")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<> (text #:color 7 "【" 0 "】（しまった・・・エッチな本を置いたままだ。）") (wait)))
    ((&& (== V 1) (== N 13))
     (<> (text #:color 7 "【" 0 "】（机だな・・・鉄製だから重いんだ、これが。）") (wait)))
    ((&& (== V 1) (== N 14))
     (<>
      (text #:color 7 "【" 0 "】（コンピューターだな・・・中のデータを見たら、先生は卒倒するだろうな。）")
      (wait)))
    ((&& (== V 1) (== N 15))
     (<> (text #:color 7 "【" 0 "】（窓だぜ・・・外の景色を見る雰囲気じゃない。）") (wait)))
    ((&& (== V 1) (== N 16))
     (<> (text #:color 7 "【" 0 "】（スピーカーだ・・・音楽は流れてるぞ。）") (wait)))
    ((&& (== V 1) (== N 17))
     (<> (text #:color 7 "【" 0 "】（いやらしい写真なんだぜ・・・ここからでは見えないけど。）") (wait)))
    ((&& (== V 1) (== N 18))
     (<>
      (text #:color 7 "【" 0 "】（俗に言うシステムコンポってやつだな・・・カメラのカメラ屋で買ったんだ。）")
      (wait)))
    ((&& (== V 1) (== N 19))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（いやらしいビデオを見る為だけに存在してるテレビだけど・・・そのいやらしいビデオは、全部一哉が借りてったままだぞ。）")
      (wait)))
    ((&& (== V 1) (== N 20))
     (<> (text #:color 7 "【" 0 "】（コルクボードだ・・・食べられないぜ。）") (wait)))
    ((&& (== V 1) (== N 21))
     (<>
      (text #:color 7 "【" 0 "】（この中には・・・チリ紙が入ってる。）")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、匂いでバレなければいいが・・・。）")
      (wait)))
    ((&& (== V 1) (== N 22))
     (<> (text #:color 7 "【" 0 "】（俺の部屋によしこ先生がいるなんて・・・信じられないぜ。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))