(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\る
  #\は
  #\な
  #\ち
  #\。
  #\て
  #\っ
  #\の
  #\、
  #\う
  #\ん
  #\し
  #\だ
  #\？
  #\た
  #\か
  #\と
  #\ら
  #\に
  #\よ
  #\が
  #\も
  #\そ
  #\で
  #\ゃ
  #\ね
  #\を
  #\く
  #\ど
  #\わ
  #\事
  #\じ
  #\け
  #\！
  #\お
  #\ま
  #\さ
  #\ー
  #\れ
  #\あ
  #\え
  #\や
  #\君
  #\（
  #\）
  #\こ
  #\す
  #\水
  #\商
  #\売
  #\り
  #\言
  #\ょ
  #\私
  #\人
  #\つ
  #\彼
  #\思
  #\め
  #\せ
  #\仕
  #\歳
  #\話
  #\ぐ
  #\見
  #\何
  #\ろ
  #\へ
  #\時
  #\男
  #\女
  #\俺
  #\手
  #\来
  #\違
  #\信
  #\ず
  #\理
  #\上
  #\ぽ
  #\店
  #\１
  #\氏
  #\客
  #\２
  #\年
  #\き
  #\同
  #\嫉
  #\妬
  #\ぜ
  #\方
  #\べ
  #\大
  #\酔
  #\み
  #\一
  #\間
  #\料
  #\ふ
  #\ン
  #\気
  #\ク
  #\目
  #\食
  #\家
  #\酒
  #\チ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "06.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "n13.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 25)
 (set-arr~ @ 6 1)
 (image "n13an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "n13.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 6)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "n13.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 474) 0)
   (<>
    (text #:color 3 "【ちはる】ね？・・・いいお店でしょ？")
    (wait)
    (text #:color 7 "【" 0 "】こういう場所に来た事がないから・・・何て言っていいのやら。")
    (wait)
    (text #:color 3 "【ちはる】そうよね・・・" 0 "君はまだ１８歳ですもの。")
    (wait)
    (text #:color 7 "【" 0 "】ちはるちゃんって、こういう店によく来るの？")
    (wait)
    (text #:color 3 "【ちはる】今はほとんど来ないわね・・・昔は、けっこう来てたけど。")
    (wait)
    (text #:color 7 "【" 0 "】なんだよ・・・また彼氏の話か？")
    (wait)
    (text #:color 3 "【ちはる】違うの・・・お客さんと。")
    (wait)
    (text #:color 7 "【" 0 "】お客さん？")
    (wait)
    (text #:color 3 "【ちはる】あははは・・・私ね、昔は水商売をやってたのよ。")
    (wait)
    (text #:color 7 "【" 0 "】（ちはるちゃんが水商売！？・・・信じられないな。）")
    (wait)
    (set-reg: 474 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（帰るのはまだ早い・・・もう少しちはるちゃんと話をしたいな。）") (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】ちはるちゃん、そろそろ帰らないか？")
         (wait)
         (text #:color 3 "【ちはる】そうね・・・約束、忘れないでね。")
         (wait)
         (text #:color 7 "【" 0 "】へいへい・・・２２日の午後１時だろ？")
         (wait)
         (text #:color 3 "【ちはる】絶対に『おいしいっ！！』って言うんだから・・・ううん、絶対に言わせてみせるわ。")
         (wait)
         (text #:color 7 "【" 0 "】（けっこう・・・ムキになる性格のようだ。）")
         (wait)
         (field 14 1 1)
         (field 13 0 0)
         (field 13 1 1)
         (set-reg: 1001 0)
         (set-var A 1)
         (proc 13)
         (proc 11)
         (set-reg: 475 1)
         (set-var N 24)
         (slot 1 3)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（そうだよ・・・まだ帰りたくない。）") (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<> (text #:color 7 "【" 0 "】（次の約束もしたし・・・まだ帰らないのか？）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】ちはるちゃんが水商売ねえ・・・。")
      (wait)
      (text #:color 3 "【ちはる】軽蔑した？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "した") (text "しない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】したな・・・がっかりだ。")
         (wait)
         (text #:color 3 "【ちはる】そうよね・・・" 0 "君ぐらいの男の子から見たら、水商売をしてる女なんていやでしょうね。")
         (wait)
         (set-reg: 114 (- (: 114) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】しないよ、関係ないもの。")
         (wait)
         (text #:color 3 "【ちはる】へえ・・・" 0 "君ぐらいの年齢だと、軽蔑されるかと思ったけど。")
         (wait)
         (set-reg: 114 (+ (: 114) 1))))
       (else (<>)))
      (text #:color 7 "【" 0 "】どうして水商売をやってたの？")
      (wait)
      (text #:color 3 "【ちはる】まずお金ね・・・一度夜の仕事をやると、昼間の仕事ができなくなっちゃうのよ。")
      (wait)
      (text #:color 7 "【" 0 "】はあ？")
      (wait)
      (text #:color 3 "【ちはる】だからあ、同じ時間働いてお給料が全然違うって事。")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・なるほどね。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text
       #:color
       3
       "【ちはる】前の彼氏もね、もともとは店に来たお客さんだったのよ・・・そしたら知り合うきっかけになった、夜の仕事が原因で別れちゃったの。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 3 "【ちはる】ほら、嫉妬するでしょ？・・・水商売っていう事は、男のお客さんと色々あるわけだから。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 3 "【ちはる】" 0 "君の彼女がさ、仮に水商売をしてて・・・毎晩他の男と話をしてるって考えたら・・・どう思う？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "嫉妬する") (text "嫉妬しない") (text "せいせいする")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】やっぱり・・・嫉妬するかな？")
         (wait)
         (text #:color 3 "【ちはる】そうよね・・・嫉妬して当然よね。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】嫉妬しないぜ・・・仕事だから仕方がないよ。")
         (wait)
         (text #:color 3 "【ちはる】へえ、" 0 "君って割り切って考えられる人なのね。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】せいせいするな。")
         (wait)
         (text #:color 3 "【ちはる】え？")
         (wait)
         (text #:color 7 "【" 0 "】彼女が他の男と話をしてるんだったら、自分だって毎晩他の女の子と遊べるじゃないか。")
         (wait)
         (text #:color 3 "【ちはる】そんな事したら、彼女が黙ってないわよ。")
         (wait)
         (text #:color 7 "【" 0 "】どうして？")
         (wait)
         (text #:color 3 "【ちはる】だって・・・彼女は仕事で、" 0 "君は遊びでしょ？")
         (wait)
         (set-reg: 114 (- (: 114) 1))))
       (else (<>)))
      (text #:color 7 "【" 0 "】と言いつつ、本当はわからないよ・・・実際に同じ立場になってみないと。")
      (wait)
      (text #:color 3 "【ちはる】だから水商売をやってると、カタギの男とつき合えないのよ・・・うまくいく彼氏は、だいたい同業者ね。")
      (wait)
      (text #:color 7 "【" 0 "】同業者？")
      (wait)
      (text
       #:color
       3
       "【ちはる】ほら、男の人で水商売やってる人もいるでしょ？・・・働いてる時間が同じだから、コミュニケーションがとれるじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】で、ちはるちゃんの彼氏は同業者だったの？")
      (wait)
      (text #:color 3 "【ちはる】だから、店に来たお客さんだってば・・・だから普通のサラリーマン。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえ・・・どうして俺なんかに、そんな話をするんだ？")
      (wait)
      (text #:color 3 "【ちはる】不思議なのよねえ・・・こんな話、今まで誰にもした事がないのに。")
      (wait)
      (text #:color 7 "【" 0 "】そうなんだ・・・。")
      (wait)
      (text #:color 3 "【ちはる】初めて話した相手が１８歳の男の子だなんて、笑っちゃうわね・・・あはははは。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【ちはる】ごめん・・・気を悪くした？")
      (wait)
      (text #:color 7 "【" 0 "】ぜーんぜん。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 3 "【ちはる】彼氏がいなくなると・・・夜が寂しいのよね。")
      (wait)
      (text #:color 7 "【" 0 "】セックスしたいとか？")
      (wait)
      (text #:color 3 "【ちはる】違うわよ、そういう直接的な欲求じゃなくて・・・人恋しいって言うか、とにかく寂しいの。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん、俺にはないなあ。")
      (wait)
      (text #:color 3 "【ちはる】大人の恋愛を一度するとね、必ずそうなっちゃうものなのよ。")
      (wait)
      (text #:color 7 "【" 0 "】大人の恋愛って、俺と１歳しか違わないじゃないか。")
      (wait)
      (text #:color 3 "【ちはる】年齢は関係ないの・・・経験が大事だと思うわ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 3 "【ちはる】" 0 "君、経験してる？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "たくさん") (text "ぼちぼち") (text "してない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】自分ではたくさんしてるつもりだけど・・・。")
         (wait)
         (text
          #:color
          3
          "【ちはる】偉いわあ、たくさんした方がいいのよ・・・歳とってから始めちゃうと、ロクな事にならないんだから。")
         (wait)
         (set-reg: 114 (+ (: 114) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】まあ・・・ぼちぼちかな。")
         (wait)
         (text
          #:color
          3
          "【ちはる】"
          0
          "君、たくさんしといた方がいいのよ・・・歳とってから始めちゃうと、ロクな事にならないんだから。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】俺は・・・してないなあ。")
         (wait)
         (text
          #:color
          3
          "【ちはる】駄目よ"
          0
          "君、たくさんしといた方がいいのよ・・・歳とってから始めちゃうと、ロクな事にならないんだから。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】そういう客がいたとか？")
      (wait)
      (text #:color 3 "【ちはる】いたいた、中年のオヤジで・・・もうしつこいったらないんだから。")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・そういう中年になりたくない。")
      (wait)
      (text #:color 3 "【ちはる】その為には、もっともっと経験しとかないとね。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、勉強になるなあ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 3 "【ちはる】彼氏と別れて・・・その直後にお店を辞めちゃった。")
      (wait)
      (text #:color 7 "【" 0 "】どうして？")
      (wait)
      (text #:color 3 "【ちはる】全てがいやになっちゃて・・・それがね、不思議なのよ。")
      (wait)
      (text #:color 3 "【ちはる】一度辞めるとね、どうして今まで水商売を続けられたのかって、不思議に思えてくるの。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 3 "【ちはる】もう二度といやだわ、水商売なんて。")
      (wait)
      (text #:color 7 "【" 0 "】で、今はプー子さんなんだ。")
      (wait)
      (text #:color 3 "【ちはる】そろそろ仕事を捜さないとね・・・自宅だから食べるには困らないんだけど、家にいてもつまらないし。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】ちはるちゃんってさあ・・・何の仕事がしたいの？")
      (wait)
      (text #:color 3 "【ちはる】逆に聞きたいぐらいよ、私って何の仕事が似合うと思う？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "水商売") (text "ＯＬ") (text "おすもうさん") (text "職人")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】やっぱり水商売。")
         (wait)
         (text #:color 3 "【ちはる】私って・・・染まってる？")
         (wait)
         (text #:color 7 "【" 0 "】くんか、くんか・・・ああ、水商売独特の匂いがするぜ。")
         (wait)
         (text #:color 3 "【ちはる】ひ、ひどい。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、冗談だって。")
         (wait)
         (set-reg: 114 (- (: 114) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】無難なところで、ＯＬなんてどう？")
         (wait)
         (text
          #:color
          3
          "【ちはる】だめだめ、私って事務の仕事とか苦手なの・・・机にずっと向かってると、気持ちが悪くなってくるのよ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・おすもうさんなんてどう？")
         (wait)
         (text #:color 3 "【ちはる】" 0 "君・・・私って、そんなに太ってるかしら？")
         (wait)
         (text #:color 7 "【" 0 "】太ってないけど、太りやすい体質でしょ？")
         (wait)
         (text #:color 3 "【ちはる】やだ・・・なんでわかるの？")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・職人って感じだな。")
         (wait)
         (text #:color 3 "【ちはる】職人？・・・大工にでもなるわけ！？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】違うってば、ちはるちゃんはＯＬって感じじゃないから・・・ヘアメイクとか、デザイナーとか技術職向きなんじゃない？")
         (wait)
         (text #:color 3 "【ちはる】へえ・・・" 0 "君ってすごい。")
         (wait)
         (text #:color 7 "【" 0 "】へ？")
         (wait)
         (set-reg: 114 (+ (: 114) 1))))
       (else (<>)))
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 3 "【ちはる】私ね・・・誰にも言った事がないんだけど、調理師の免許を取りたいの。")
      (wait)
      (text #:color 7 "【" 0 "】調理師って言うと・・・調理師？")
      (wait)
      (text #:color 3 "【ちはる】うん・・・喫茶店でも話したと思うけど、私って料理が上手なのよ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【ちはる】料理している時って、とっても楽しいし・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【ちはる】時間があっという間に過ぎちゃうし・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ぐうぐう・・・。")
      (wait)
      (text #:color 3 "【ちはる】寝るなっ！！")
      (wait)
      (text #:color 7 "【" 0 "】え！？・・・何か言った！？")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 2) (== N 1) (== (: 18) 0))
     (<>
      (text #:color 3 "【ちはる】" 0 "君、信じてないでしょ・・・私の話。")
      (wait)
      (text #:color 7 "【" 0 "】そんな事はないよ。")
      (wait)
      (text #:color 3 "【ちはる】って言いつつ、どうして目をそらすの？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・そらした？")
      (wait)
      (text #:color 3 "【ちはる】本当に上手なんだからね。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "信じた") (text "信じない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】信じたよ・・・ちはるちゃんは料理が上手。")
         (wait)
         (text #:color 3 "【ちはる】信じてなーいっ！！")
         (wait)
         (text #:color 7 "【" 0 "】げげっ！！も、もしかして酔ってる！？")
         (wait)
         (text #:color 3 "【ちはる】お酒を飲んでないもの・・・酔ってないわよ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】正直に言うと・・・信じられない。")
         (wait)
         (text #:color 3 "【ちはる】上手なのっ！！")
         (wait)
         (text #:color 7 "【" 0 "】げげっ！！も、もしかして酔ってる！？")
         (wait)
         (text #:color 3 "【ちはる】お酒を飲んでないもの・・・酔ってないわよ。")
         (wait)))
       (else (<>)))
      (text #:color 3 "【ちはる】こうなったら証明しないと気が済まないわ・・・" 0 "君も先負町に住んでるんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】うん。")
      (wait)
      (text #:color 3 "【ちはる】先負町の・・・どのへん？")
      (wait)
      (text #:color 7 "【" 0 "】公園の裏のマンション。")
      (wait)
      (text #:color 3 "【ちはる】なんだ近いじゃない・・・ちょうどいいわ。")
      (wait)
      (text #:color 7 "【" 0 "】何が？")
      (wait)
      (text #:color 3 "【ちはる】" 0 "君、私の料理を食べてみてよ・・・どうせ暇なんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】なんだい、その言い方は。")
      (wait)
      (text #:color 3 "【ちはる】パパとママがいない時がいいから・・・そうね、２２日の午後１時に私の家に来て。")
      (wait)
      (text #:color 7 "【" 0 "】強引だな・・・。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 2) (== N 1) (== (: 19) 0))
     (<>
      (text #:color 3 "【ちはる】私の家は、えーと・・・" 0 "君が住んでる場所より、もっと駅に近いわよ。")
      (wait)
      (text #:color 7 "【" 0 "】それだけじゃわからないよ。")
      (wait)
      (text #:color 3 "【ちはる】先負駅から北に行くの・・・そして３つ目の交差点を右に曲って、左から２軒目。")
      (wait)
      (text #:color 7 "【" 0 "】左から２軒目・・・ね。")
      (wait)
      (text #:color 3 "【ちはる】家の前が未舗装なのよ、すぐにわかると思うわ。")
      (wait)
      (text #:color 7 "【" 0 "】本当に・・・家に行っていいの？")
      (wait)
      (text
       #:color
       3
       "【ちはる】いいって言ったじゃない・・・"
       0
       "君の顔を見てたら、絶対に『おいしい』って言わせたくなったの！！")
      (wait)
      (text #:color 7 "【" 0 "】ねえ・・・酔ってない？")
      (wait)
      (text #:color 3 "【ちはる】酔ってないっ！！")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 3 "【ちはる】なんだか・・・眠くなってきちゃた。")
      (wait)
      (text #:color 7 "【" 0 "】ホテルに行こうか？")
      (wait)
      (text #:color 3 "【ちはる】ちょっとお、水商売を思い出させるような事を言わないで。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 2) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（横から見ると、さらに長く感じるな・・・急に伸びたとか？）")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 2) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】（長いぞ・・・髪が長いと、女性上位の時に顔が痛いんだ。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 21) 0))
     (<> (text #:color 7 "【" 0 "】（俺の顔をチラチラ見てる・・・。）") (wait) (set-reg: 21 1)))
    ((&& (== V 1) (== N 3) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】（ちはるちゃんだ・・・俺より一つだけ歳上だけど、やってる事はすごそうだぞ。）")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん、水商売をやってたなんて聞いたせいか・・・手の組み方まで大人っぽく見える。）")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 4) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】（この手で・・・何人の男のポコチンを触ったんだろう？）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】（ピチピチの足だな・・・こういう部分に、中年のおじさんはだまされる訳だな。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（俺も中年になったら、気をつけよう。）")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 5) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】（ふとももが色っぽい・・・スカートの横のスリットがたまらんぜ。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】（ちはるちゃんだ・・・妙に大人っぽく見える。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（彼女は１９歳だろ・・・俺より一つ歳上なだけだぜ。）")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 6) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】（色っぽいなあ・・・ごっくん。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】ちはるちゃん・・・これは何？")
      (wait)
      (text #:color 3 "【ちはる】豆よ・・・食べてみたら？")
      (wait)
      (text #:color 7 "【" 0 "】ぽりぽりぽり・・・まずい。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 7) (== (: 25) 1))
     (<>
      (text #:color 7 "【" 0 "】なんてまずい豆だ・・・。")
      (wait)
      (text #:color 3 "【ちはる】そう？・・・私はおいしいけど。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】ちはるちゃん・・・これは何？")
      (wait)
      (text #:color 3 "【ちはる】やだ、ソーセージも見た事がないの？")
      (wait)
      (text #:color 7 "【" 0 "】ソーセージか・・・どれどれ、もぐもぐもぐ。")
      (wait)
      (text #:color 7 "【" 0 "】ま・・・まずい。")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 8) (== (: 26) 1))
     (<>
      (text #:color 7 "【" 0 "】なんてまずいソーセージなんだ・・・。")
      (wait)
      (text #:color 3 "【ちはる】そうかしら？・・・私はけっこう気に入ってるのよ。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】それって・・・お酒？")
      (wait)
      (text #:color 3 "【ちはる】違うわよ・・・お酒に見えるようで、見えない飲物。")
      (wait)
      (text #:color 7 "【" 0 "】？？？")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 9) (== (: 27) 1))
     (<>
      (text #:color 3 "【ちはる】内緒だけど・・・ちょっとだけお酒。")
      (wait)
      (text #:color 7 "【" 0 "】でしょう？")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】それも食べ物なの？")
      (wait)
      (text #:color 3 "【ちはる】違うわよ、これは氷・・・食べる？")
      (wait)
      (text #:color 7 "【" 0 "】・・・いらない。")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 10) (== (: 28) 1))
     (<> (text #:color 3 "【ちはる】" 0 "君、これは氷よ・・・。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))