(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\な
  #\【
  #\】
  #\、
  #\い
  #\の
  #\。
  #\あ
  #\女
  #\っ
  #\？
  #\だ
  #\性
  #\て
  #\奇
  #\麗
  #\か
  #\！
  #\き
  #\た
  #\し
  #\る
  #\く
  #\ん
  #\に
  #\と
  #\は
  #\を
  #\う
  #\よ
  #\お
  #\で
  #\ふ
  #\が
  #\こ
  #\ら
  #\り
  #\人
  #\大
  #\れ
  #\も
  #\ね
  #\ち
  #\ゃ
  #\そ
  #\聞
  #\ょ
  #\ー
  #\す
  #\事
  #\え
  #\ン
  #\ま
  #\ぜ
  #\私
  #\ガ
  #\じ
  #\ス
  #\ぞ
  #\さ
  #\ラ
  #\ク
  #\わ
  #\好)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "02.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "e.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "ean.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "e.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 22)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "e.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 217) 0)
   (<>
    (text #:color 7 "【" 0 "】ぎょっ！！")
    (wait)
    (text #:color 6 "【奇麗な女性】きゃっ！！・・・びっくりした！？")
    (wait)
    (text #:color 7 "【" 0 "】き、き、き、き、き、き・・・。")
    (wait)
    (text #:color 6 "【奇麗な女性】？？？")
    (wait)
    (text #:color 7 "【" 0 "】奇麗な人だなあ。")
    (wait)
    (text #:color 6 "【奇麗な女性】ありがとう・・・あなたもいい男ね。")
    (wait)
    (text #:color 7 "【" 0 "】うーん、大人の女性だ・・・それもとびきり奇麗な大人の女性だ。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 217) 0))
        (<> (text #:color 7 "【" 0 "】冗談じゃない・・・こんなチャンスはめったにないぞ。") (wait)))
       ((== N 2) (<> (text #:color 7 "【" 0 "】この店に入るのなら、俺を殺してから入れ。") (wait)))
       ((== N 3) (<> (text #:color 7 "【" 0 "】そうだよ・・・まだここにいようぜ。") (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 2) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】大人だあ・・・大人の髪の毛だあ。")
      (wait)
      (text #:color 6 "【奇麗な女性】？？？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 1) (== N 2) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】あの髪の毛に優しくポコチンをくるまれて・・・ぐっすりと眠ってみたい。")
      (wait)
      (text #:color 6 "【奇麗な女性】ポコ・・・なに？")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】奇麗な人だなあ・・・惚れぼれしちゃうぜ。")
      (wait)
      (text #:color 6 "【奇麗な女性】あなた・・・学生さん？")
      (wait)
      (text #:color 7 "【" 0 "】奇麗だなあ・・・見ているだけで、イッてしまいそうだ。")
      (wait)
      (text #:color 6 "【奇麗な女性】私の言う事、全然聞いてないようね。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 3) (== (: 11) 1))
     (<>
      (text #:color 7 "【" 0 "】アイライン、真っ赤なルージュ、ちょっと濃い目のファンデーション・・・。")
      (wait)
      (text #:color 7 "【" 0 "】小便臭いガキなど、足元にも及ばないぜ。")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】男の全てを知っていると、訴えているような細い首・・・キスマークをつけ慣れている大人の女性の首。")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・ぞくぞくしちゃうぜ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 4) (== (: 12) 1))
     (<>
      (text #:color 7 "【" 0 "】色っぽい・・・色っぽすぎる。")
      (wait)
      (text #:color 7 "【" 0 "】あの首筋は、健全な青少年の心をかき乱すにふさわしい首筋だ。")
      (wait)
      (text #:color 6 "【奇麗な女性】ねえ・・・なにか難しい事を言ってるの？")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】おお！！完全にふくらみきった、大人の胸！！")
      (wait)
      (text #:color 7 "【" 0 "】堅くもなく、柔らかくもなく・・・ほどよい弾力を兼ね備えた、かんぺきなお胸様だ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 5) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】ああ・・・あの胸に顔を埋めて、グリグリして、びよよよーんして、ちゅぱちゅぱしたい。")
      (wait)
      (text #:color 6 "【奇麗な女性】？？？")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】おおおっ！！『豹ガラ』のシャツ！！・・・これぞ、大人しか着る事ができない禁断の模様だっ！！")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】ガキパンク女郎や、ガキメタル女郎が着ている『豹ガラ』とは訳が違うぜ・・・天女とアブラムシほどの差があるぞ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 6) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】ああ・・・なんて似合ってるんだ。")
      (wait)
      (text #:color 7 "【" 0 "】豹ガラを着る為に、生まれてきた女性だな・・・思わず拝みそうになってしまう。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】くんかくんか・・・ああ、大人の香りがする。")
      (wait)
      (text #:color 7 "【" 0 "】だぶん俺の鼻の穴は、いつもより５ミリは大きくなっているだろう・・・望むところだぜ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 7) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】ああ・・・こんな女性と出会えただけで、俺はついてるな。") (wait)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】あの・・・あなたはだあれ？")
      (wait)
      (text #:color 6 "【奇麗な女性】私？・・・私は・・・ふふふ、内緒。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】いやあ、奇麗ですね・・・最初見た時、天女が降りて来たのかと思いました。")
      (wait)
      (text #:color 6 "【奇麗な女性】ありがとう・・・でもあなた、学生さんでしょ？")
      (wait)
      (text #:color 6 "【奇麗な女性】こんな場所で何をしていたのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】あなたに会えるのを、ここでずっと待っていたんです。")
      (wait)
      (text #:color 6 "【奇麗な女性】会えるのをって・・・私達、初対面で、それも偶然会っただけじゃない。")
      (wait)
      (text #:color 6 "【奇麗な女性】ふふふ・・・そんな言葉は、同級生の女の子に言いなさい、きっと喜ぶわよ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 2) (== N 1) (== (: 217) 0))
     (<>
      (text #:color 6 "【奇麗な女性】さてと・・・私、急ぐから。")
      (wait)
      (text #:color 7 "【" 0 "】ち、ちょっと待って！！・・・聞きたい事があるんだ。")
      (wait)
      (cond
       ((== (: 18) 0) (<> (text #:color 6 "【奇麗な女性】聞きたい事？・・・何？") (wait)))
       ((== (: 18) 1) (<> (text #:color 6 "【奇麗な女性】だからあ・・・何が聞きたいの？") (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "お名前は？") (text "お歳は？") (text "セックス好き？")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】あの・・・お名前は？")
         (wait)
         (text #:color 6 "【奇麗な女性】ふふっ・・・かわいい事を聞くじゃない。")
         (wait)
         (text #:color 6 "【かおり】私の名前は『成瀬　かおり』・・・じゃあね！！")
         (wait)
         (text #:color 7 "【" 0 "】あ！！・・・ちょっとおっ！！")
         (wait)
         (set-reg: 217 1)
         (set-reg: 175 1)
         (slot 1 3)
         (mes-jump "cats.mes")))
       ((&& (== N 2) (== (: 19) 0))
        (<>
         (text #:color 7 "【" 0 "】あの・・・お歳は？")
         (wait)
         (text #:color 6 "【奇麗な女性】ふふふ・・・レディに歳を聞くもんじゃないわよ。")
         (wait)
         (set-reg: 19 1)
         (set-reg: 18 1)))
       ((&& (== N 2) (== (: 19) 1))
        (<>
         (text #:color 7 "【" 0 "】だから・・・いくつかなーって。")
         (wait)
         (text #:color 6 "【奇麗な女性】だから、女性に歳を聞くのは・・・そう、肉体関係を結んだ後よ。")
         (wait)))
       ((&& (== N 3) (== (: 20) 0))
        (<>
         (text #:color 7 "【" 0 "】セックスは好きでしょ？・・・好きですよね？・・・大好きだよね？")
         (wait)
         (text #:color 6 "【奇麗な女性】やだ・・・この子、おかしいのかしら？")
         (wait)
         (set-reg: 20 1)
         (set-reg: 18 1)))
       ((&& (== N 3) (== (: 20) 1))
        (<>
         (text #:color 7 "【" 0 "】だから、セックスが好きでしょ？")
         (wait)
         (text #:color 6 "【奇麗な女性】あのね、そんな事を聞くのは・・・変態か子供か、どっちかよ。")
         (wait)))
       (else (<>)))))
    (else (<>)))))
 (set-arr~ @ 7 1))