(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\る
  #\い
  #\な
  #\ち
  #\。
  #\は
  #\て
  #\っ
  #\ん
  #\だ
  #\（
  #\）
  #\！
  #\の
  #\、
  #\た
  #\う
  #\し
  #\ゃ
  #\か
  #\が
  #\を
  #\？
  #\あ
  #\に
  #\で
  #\ン
  #\ー
  #\と
  #\き
  #\ら
  #\も
  #\こ
  #\よ
  #\く
  #\え
  #\お
  #\れ
  #\り
  #\何
  #\そ
  #\ど
  #\ッ
  #\み
  #\見
  #\け
  #\事
  #\や
  #\ス
  #\ト
  #\ふ
  #\ま
  #\俺
  #\チ
  #\じ
  #\さ
  #\め
  #\ょ
  #\欲
  #\プ
  #\す
  #\ね
  #\子
  #\レ
  #\君
  #\入
  #\ぞ
  #\エ
  #\私
  #\わ
  #\気
  #\ロ
  #\間
  #\テ
  #\ば
  #\弟
  #\ぶ
  #\キ
  #\電)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "n14.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 6 1)
 (image "n14an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "n14.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "n14.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 467) 1)
   (<>
    (text #:color 3 "【ちはる】ふんふん・・・ふんふん・・・。")
    (wait)
    (text #:color 7 "【" 0 "】（ちはるちゃんが鼻歌を歌いながら洗い物をしてる。）")
    (wait)
    (text #:color 3 "【ちはる】あ、ごめん・・・お茶入れるの忘れちゃった。")
    (wait)
    (text #:color 7 "【" 0 "】いいよ、もうお腹が一杯でお茶も入らないくらいだ。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "帰る") (if (== (: 50) 1) (text "抱きしめる"))))
      (cond
       ((&& (== N 1) (== (: 10) 0) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】（もうちょっと休んでいこうぜ・・・お腹が一杯で動きたくない。）")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（まだ帰りたくないなあ・・・。）") (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text
          #:color
          7
          "【"
          0
          "】（ズボンの中身が破裂しそうだっ！！・・・こんな状態で外に出たら、変な歩き方になってしまう。）")
         (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】（妙に・・・ムラムラしてきちゃったぞ。）")
         (wait)
         (text #:color 7 "【" 0 "】（食欲の次は性欲か？・・・俺って、動物的だなあ。）")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】（ああ・・・我慢できない、ちはるちゃんのエプロン姿がいけないんだあっ！！）")
         (wait)
         (text #:color 7 "【" 0 "】ちはるちゃーんっ！！")
         (wait)
         (text #:color 3 "【ちはる】なに？・・・もうちょっとで終るから。")
         (wait)
         (text #:color 7 "【" 0 "】だーーーーーーーっ！！")
         (wait)
         (text #:color 3 "【ちはる】きゃっ！？・・・な、何をするの！？")
         (wait)
         (slot 1 5)
         (mes-jump "n18.mes")))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえ、いつも料理とか作ってるの？")
      (wait)
      (text #:color 3 "【ちはる】そうね・・・水商売をしてる時は、ほとんど家の仕事なんてしなかったけど。")
      (wait)
      (text #:color 7 "【" 0 "】ちはるちゃんはプー子だって言ったけど・・・昼間って何をしてるの？")
      (wait)
      (text #:color 3 "【ちはる】ふふふっ・・・何をしてると思う？")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "おなにい") (text "寝ている") (text "読書") (text "テレビ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】おなにい・・・とか？")
         (wait)
         (text #:color 3 "【ちはる】" 0 "君のエッチ・・・そんな事をしてる訳がないでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ、何をしてるんだよ・・・。")
         (wait)
         (set-reg: 114 (- (: 114) 1))))
       ((== N 2) (<> (text #:color 7 "【" 0 "】寝てるとか？") (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】読書をしてるのかな？")
         (wait)
         (text #:color 3 "【ちはる】たまには本も読むけど・・・毎日読みたい本なんてないし。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ・・・何をしてるんだ？")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】ずっとテレビを見てるとか？")
         (wait)
         (text #:color 3 "【ちはる】昼間やってるテレビなんて、おばさん向きでしょ？・・・私は見ないわね。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ・・・何をしてるんだ？")
         (wait)))
       (else (<>)))
      (text #:color 3 "【ちはる】あはは・・・水商売をしてると、夜と昼の生活が逆になっちゃうでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】うんうん。")
      (wait)
      (text #:color 3 "【ちはる】そのリズムって、なかなか抜けないのよねー。")
      (wait)
      (text #:color 7 "【" 0 "】ようするに、寝てるって事だよな・・・。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 3 "【ちはる】" 0 "君、退屈でしょ？・・・テレビ見ててもいいわよ。")
      (wait)
      (text #:color 7 "【" 0 "】いいや、このままちはるちゃんを見てた方がいい。")
      (wait)
      (text #:color 3 "【ちはる】私を？")
      (wait)
      (text #:color 7 "【" 0 "】だってさ、ちはるちゃんのエプロン姿なんて、めったに見られないもんな。")
      (wait)
      (text #:color 3 "【ちはる】やだ、" 0 "君ったら。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ、こうして二人でいるとさあ・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 14) 0) (text "馬鹿みたい"))
        (if (== (: 13) 0) (text "夫婦みたい"))
        (if (== (: 15) 0) (text "親子みたい"))
        (if (== (: 16) 0) (text "兄弟みたい"))))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】馬鹿みたい。")
         (wait)
         (text #:color 3 "【ちはる】何よ、その馬鹿って・・・。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・間違えた。")
         (wait)
         (set-reg: 14 1)
         (set-reg: 114 (- (: 114) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】夫婦みたいだな。")
         (wait)
         (text #:color 3 "【ちはる】やだ・・・" 0 "君って１８歳でしょ？")
         (wait)
         (text #:color 7 "【" 0 "】そうだけど・・・ちはるちゃんのエプロン姿を見てると、なんとなくそんな気がしちゃってさ。")
         (wait)
         (set-reg: 114 (+ (: 114) 1))
         (set-reg: 13 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】親子みたい。")
         (wait)
         (text #:color 3 "【ちはる】親子って・・・私がお母さんって事？")
         (wait)
         (text #:color 7 "【" 0 "】まあ・・・そういう事になるかな。")
         (wait)
         (text #:color 3 "【ちはる】私ってそんなにフケてる？・・・ショックだわ。")
         (wait)
         (set-reg: 114 (- (: 114) 1))
         (set-reg: 15 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】兄弟みたいだ。")
         (wait)
         (text #:color 3 "【ちはる】私って一人っ子なの・・・だから弟か妹が欲しかったんだ。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ俺を弟にしてくれよ・・・肉体関係のある弟。")
         (wait)
         (text #:color 3 "【ちはる】・・・ばか。")
         (wait)
         (set-reg: 16 1)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (< (: 49) 3))
     (<>
      (text #:color 3 "【ちはる】" 0 "君、まだ苦しい？")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・だいぶ楽になってきたな。")
      (wait)
      (text #:color 3 "【ちはる】さすが" 0 "君、消化するのが早いわねー。")
      (wait)
      (set-reg: 49 (+ (: 49) 1))))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 3 "【ちはる】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【ちはる】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん・・・話す事がなくなってきたな。）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 2) (== N 1) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】ちはるちゃん？")
      (wait)
      (text #:color 3 "【ちはる】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ちはるちゃんってば。")
      (wait)
      (text #:color 3 "【ちはる】え！？・・・な、何！？")
      (wait)
      (text #:color 7 "【" 0 "】もう・・・何を考えてたんだよ。")
      (wait)
      (text #:color 3 "【ちはる】う、ううん・・・何でもないの。")
      (wait)
      (text #:color 7 "【" 0 "】（女性がこういう状態で考える事と言えば・・・？）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 2) (== N 1) (== (: 18) 1))
     (<>
      (text #:color 3 "【ちはる】" 0 "君・・・男の人ってさあ。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 3 "【ちはる】ううん・・・何でもないの。")
      (wait)
      (set-reg: 18 2)))
    ((&& (== V 2) (== N 1) (== (: 18) 2))
     (<>
      (text #:color 3 "【ちはる】私って魅力がないのかなあ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 3 "【ちはる】ううん・・・独り言だから気にしないで。")
      (wait)
      (set-reg: 18 3)))
    ((&& (== V 2) (== N 1) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・ちはるちゃんのエプロン姿は色っぽいなあ。）")
      (wait)
      (text #:color 3 "【ちはる】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（なんだか・・・お腹が一杯になったら、欲情してきちゃったぞ。）")
      (wait)
      (text #:color 3 "【ちはる】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（スカートは短いし・・・エプロンはしてるし・・・ごっくん。）")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 7 "【" 0 "】（こ、困ったぞ・・・『やりたい気持ち』が口から出てきそうだ。）")
      (wait)
      (text #:color 3 "【ちはる】・・・。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】（ちはるちゃんの足を見てるだけで、ポコチンが大きくなってきた・・・が、が、が、我慢できない！！）")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 2) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんのお尻だ・・・。）") (wait)))
    ((&& (== V 1) (== N 2) (== (: 50) 1))
     (<>
      (text #:color 7 "【" 0 "】（ああ・・・このお尻を思いっきりつかみたい！！）")
      (wait)
      (text #:color 7 "【" 0 "】（なめたい！！触りたい！！ぐりぐりしたい！！）")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんの脚だ・・・ストッキングははいてないようだぞ。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 50) 1))
     (<>
      (text #:color 7 "【" 0 "】（短いスカートから出てる白い脚・・・なおかつストッキングをはいてないときた日にゃあ・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（だ、駄目だ・・・欲情が理性を越えてしまう！！）")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんだ・・・キッチンに立っている。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・後ろから抱きしめたいっ！！）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（システムキッチンってやつか？）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（この際、キッチンなんてどうでもいいっ！！）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（俺が御飯を食べた『ちゃぶ台』だ・・・上には何も乗ってない。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（この上に、ちはるちゃんを押し倒したいっ！！）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（スイッチだな・・・たぶんこの部屋の蛍光灯だろう。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・ちはるちゃんのスイッチを押したいっ！！）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（あれれ、８月じゃないぞ・・・めくり忘れてるんだな。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（カレンダーなんて、どうでもいいっ！！）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（横に電話があるって事は・・・これはメモとペンだろう。）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 50) 1))
     (<>
      (text #:color 7 "【" 0 "】（ああっ！！このペンじゃなくて、俺が持ってるふっとーいペンを使いたいっ！！）")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（ずいぶん古いタイプの電話だな・・・逆に格好いいや。）") (wait)))
    ((&& (== V 1) (== N 10) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（黒い電話より、黒いポコチンを使いたいっ！！）") (wait)))
    ((&& (== V 1) (== N 11) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（お酒やグラスが入ってるケースだな・・・。）") (wait)))
    ((&& (== V 1) (== N 11) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（駄目だ・・・こんな物を見てても、欲情を抑える事はできないぞ。）") (wait)))
    ((&& (== V 1) (== N 12) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（食器棚みたいけだけど・・・よくわからないや。）") (wait)))
    ((&& (== V 1) (== N 12) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（今の俺には、ちはるさんの身体しか見えない・・・。）") (wait)))
    ((&& (== V 1) (== N 13) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（換気扇だな・・・今は回ってないようだ。）") (wait)))
    ((&& (== V 1) (== N 13) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（換気扇なんてどうでもいいっ！！）") (wait)))
    ((&& (== V 1) (== N 14) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（換気扇のコンセントだ・・・。）") (wait)))
    ((&& (== V 1) (== N 14) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（コンセントなんて見たくもないっ！！）") (wait)))
    ((&& (== V 1) (== N 15) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（電子レンジって、どうして冷蔵庫の上に置かれがちなんだろう？）") (wait)))
    ((&& (== V 1) (== N 15) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（俺のハートは、電子レンジなんかよりホットだぜっ！！）") (wait)))
    ((&& (== V 1) (== N 16) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（冷蔵庫だ・・・２ドアだな。）") (wait)))
    ((&& (== V 1) (== N 16) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（冷蔵庫の中に入れば、この欲情した状態から醒めるかな？）") (wait)))
    ((&& (== V 1) (== N 17) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（うーん・・・日本の家って感じだな。）") (wait)))
    ((&& (== V 1) (== N 17) (== (: 50) 1))
     (<>
      (text #:color 7 "【" 0 "】（そうだぜ・・・ここはちはるちゃんの家なんだ。）")
      (wait)
      (text #:color 7 "【" 0 "】（で、でも・・・我慢できないっ！！）")
      (wait)))
    ((&& (== V 1) (== N 18) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（湯沸器だな・・・今は夏だから、ほとんど使わないんじゃないか？）") (wait)))
    ((&& (== V 1) (== N 18) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（湯沸器だ・・・俺の股間は、瞬間湯沸器だ。）") (wait)))
    ((&& (== V 1) (== N 19) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（料理をする為の道具がぶら下がってる・・・。）") (wait)))
    ((&& (== V 1) (== N 19) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃーんっ！！料理の道具より、自分の道具を使ってくれっ！！）") (wait)))
    ((&& (== V 1) (== N 20) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんの家だ・・・二人きりなんだぜ。）") (wait)))
    ((&& (== V 1) (== N 20) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（ここが俺の部屋だったら・・・とっくにベットの上だな。）") (wait)))
    ((&& (== V 1) (== N 21) (== (: 50) 0))
     (<> (text #:color 7 "【" 0 "】（いらない物を捨てる箱・・・ようするにゴミ入れだ。）") (wait)))
    ((&& (== V 1) (== N 21) (== (: 50) 1))
     (<> (text #:color 7 "【" 0 "】（ゴミ入れなんかに興味はないっ！！）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))