(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\は
  #\る
  #\い
  #\。
  #\ち
  #\て
  #\な
  #\っ
  #\、
  #\ん
  #\の
  #\し
  #\う
  #\か
  #\だ
  #\た
  #\ゃ
  #\く
  #\よ
  #\？
  #\に
  #\ら
  #\れ
  #\で
  #\と
  #\食
  #\わ
  #\お
  #\も
  #\ー
  #\べ
  #\を
  #\が
  #\あ
  #\！
  #\（
  #\）
  #\す
  #\ね
  #\そ
  #\ば
  #\こ
  #\む
  #\家
  #\き
  #\け
  #\ま
  #\ど
  #\君
  #\え
  #\作
  #\さ
  #\ず
  #\り
  #\じ
  #\理
  #\ょ
  #\俺
  #\ご
  #\言
  #\私
  #\事
  #\ぜ
  #\ろ
  #\や
  #\料
  #\つ
  #\見
  #\中
  #\気
  #\ン
  #\味
  #\ぐ
  #\め
  #\来
  #\パ
  #\欲
  #\何
  #\へ
  #\ぶ
  #\み
  #\変
  #\手
  #\入
  #\一)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "n14.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 6 1)
 (image "n14an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "n14.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "n16.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 467) 0)
   (<>
    (text #:color 7 "【" 0 "】（ふーん・・・ここがちはるちゃんの家の中か。）")
    (wait)
    (text #:color 3 "【ちはる】きゃあ、きゃあ大変！！")
    (wait)
    (text #:color 7 "【" 0 "】ど、どうしたの？")
    (wait)
    (text #:color 3 "【ちはる】ちょっと焦がしちゃったけど・・・このくらいなら大丈夫よね。")
    (wait)
    (text #:color 7 "【" 0 "】（うーん・・・俺はいったい何を食べさせられるんだろ？）")
    (wait)
    (text #:color 3 "【ちはる】" 0 "君、そのテーブルに座って待ってて・・・すぐに用意するから。")
    (wait)
    (text #:color 7 "【" 0 "】へいへい。")
    (wait)
    (text #:color 3 "【ちはる】" 0 "君・・・いい匂いがするでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】（くんか、くんか・・・確かにいい匂いがするな。）")
    (wait)
    (text #:color 3 "【ちはる】" 0 "君、お腹はすいてるんでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】ああ、何も食べてない気がする・・・ずーっと。")
    (wait)
    (text #:color 3 "【ちはる】よかった・・・いっぱい食べてね。")
    (wait)
    (text #:color 7 "【" 0 "】ねえねえ、何を作ってくれたの？")
    (wait)
    (text #:color 3 "【ちはる】特製ハンバーグとお味噌汁と・・・色々。")
    (wait)
    (text #:color 7 "【" 0 "】ふーん・・・ちはるちゃんって家庭的なんだな。")
    (wait)
    (text #:color 3 "【ちはる】" 0 "君、できたわよー・・・運ぶの手伝って。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "n16.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 6 1)
    (image "n16an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "n16.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】へえ・・・すごいや。")
    (wait)
    (text #:color 3 "【ちはる】おいしそうでしょ・・・ねえ早く食べてみて。")
    (wait)
    (text #:color 7 "【" 0 "】あれれ！？・・・ちはるちゃんのぶんは？")
    (wait)
    (text #:color 3 "【ちはる】あははは・・・私はもう、たくさん食べたの。")
    (wait)
    (text #:color 7 "【" 0 "】え？")
    (wait)
    (text #:color 3 "【ちはる】正直言うとね、私のお腹の中には失敗作でいっぱいなのよ。")
    (wait)
    (text #:color 7 "【" 0 "】失敗作？")
    (wait)
    (text #:color 3 "【ちはる】ようするに、作っては失敗して、また作っては失敗して・・・捨てるのもったいないでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】まあ・・・ね。")
    (wait)
    (text #:color 3 "【ちはる】だから私のお腹の中に入ってるわけ。")
    (wait)
    (text #:color 7 "【" 0 "】（うーん・・・ちはるちゃんは、いいお嫁さんになれるかもしれない。）")
    (wait)
    (set-reg: 467 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "吐く") (text "食べる")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】うっ、うっ・・・うおっぷ！！")
         (wait)
         (text #:color 3 "【ちはる】ど、どうしたの・・・まずかった！？")
         (wait)
         (text #:color 7 "【" 0 "】まずかったって・・・まだ何も食べてないけど。")
         (wait)
         (text #:color 3 "【ちはる】もう・・・いや。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 3 "【ちはる】吐きたいほど気分が悪いなら、無理して食べなくていいわよ。")
         (wait)
         (text #:color 7 "【" 0 "】違うって胃液を口の中に戻して、消化をよくしようとしてるんだ。")
         (wait)
         (text #:color 3 "【ちはる】私の方が気分悪くなってくるわ。")
         (wait)))
       ((&& (== N 2) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】うーん・・・なんか食べるのがもったいないなあ。")
         (wait)
         (text #:color 3 "【ちはる】食べてもらう為に作ったんだから・・・早く食べてみて。")
         (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】それでは遠慮なく・・・いただきまーす！！")
         (wait)
         (text #:color 3 "【ちはる】たくさん食べてね。")
         (wait)
         (text #:color 7 "【" 0 "】ばくばくばくばく、むしゃむしゃむしゃ。")
         (wait)
         (text #:color 3 "【ちはる】す、すごい・・・。")
         (wait)
         (text #:color 7 "【" 0 "】ばっくん、ばりばり、ごっくん・・・むしゃむしゃむしゃ。")
         (wait)
         (text #:color 3 "【ちはる】" 0 "君って、気持ちのいい食べ方をするわねー。")
         (wait)
         (text #:color 7 "【" 0 "】そ、そう？・・・むしゃむしゃ、がつがつ、ごろごろ、ばりばりばりっ！！")
         (wait)
         (text #:color 3 "【ちはる】ねえ・・・おいしい？")
         (wait)
         (set-reg: 101 1)
         (set-arr~ @ 7 0)
         (proc 18)
         (menu-show (<.> (text "おいしい") (text "まずい") (text "わからない")))
         (cond
          ((== N 1)
           (<>
            (text #:color 7 "【" 0 "】おいしいっ！！すごくおいしいっ！！")
            (wait)
            (text #:color 3 "【ちはる】よかった・・・うれしい。")
            (wait)
            (set-reg: 114 (+ (: 114) 2))))
          ((== N 2)
           (<>
            (text #:color 7 "【" 0 "】まずいな・・・無理して喰ってるんだよ。")
            (wait)
            (text #:color 3 "【ちはる】・・・。")
            (wait)
            (text #:color 3 "【ちはる】私・・・一生懸命作ったのに。")
            (wait)
            (text
             #:color
             7
             "【"
             0
             "】い、いや、今のところって事だぜ・・・料理の味っていうのは、食べ終った時にわかるもんなんだ。")
            (wait)
            (text #:color 3 "【ちはる】微妙な言い方ね・・・無理して食べなくてもいいわよ。")
            (wait)
            (set-reg: 114 (- (: 114) 2))))
          ((== N 3)
           (<>
            (text #:color 7 "【" 0 "】わからないな。")
            (wait)
            (text #:color 3 "【ちはる】え？")
            (wait)
            (text #:color 7 "【" 0 "】味わって食べてないから、よくわからない。")
            (wait)
            (text #:color 3 "【ちはる】せっかく作ったんだから、味わって食べてよ。")
            (wait)
            (set-reg: 114 (- (: 114) 1))))
          (else (<>)))
         (text #:color 7 "【" 0 "】ちはるちゃん、御飯おかわり！！")
         (wait)
         (text #:color 3 "【ちはる】え！？・・・まだ食べるの？")
         (wait)
         (text #:color 7 "【" 0 "】いやあ、人の家の御飯はおいしいなあ。")
         (wait)
         (text #:color 3 "【ちはる】はい・・・おかわり。")
         (wait)
         (text #:color 7 "【" 0 "】ばくばぐばくばくばくばくばく・・・。")
         (wait)
         (text #:color 7 "【" 0 "】むしゃむしゃむしゃむしゃ・・・。")
         (wait)
         (text #:color 7 "【" 0 "】おかわり！！")
         (wait)
         (text #:color 3 "【ちはる】え！？・・・すごいわね。")
         (wait)
         (text #:color 7 "【" 0 "】はぐはぐはぐ、ずるずるずる・・・ずずずっ！！")
         (wait)
         (text #:color 7 "【" 0 "】むしゃしむゃむしゃむしゃむしゃむしゃ・・・ごっくん！！")
         (wait)
         (text #:color 3 "【ちはる】・・・。")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "kuro.pd8")
         (proc 15)
         (set-arr~ @ 7 0)
         (text #:color 7 "【" 0 "】ごちそうさまー！！")
         (wait)
         (text #:color 3 "【ちはる】" 0 "君・・・お皿まで食べちゃた。")
         (wait)
         (text #:color 7 "【" 0 "】あ、ごめん・・・出そうか？")
         (wait)
         (text #:color 3 "【ちはる】ううん・・・いい。")
         (wait)
         (text #:color 7 "【" 0 "】あー、久しぶりに家庭の料理を食べたって感じだ。")
         (wait)
         (text #:color 3 "【ちはる】で・・・最終的な結論は？")
         (wait)
         (text #:color 7 "【" 0 "】すごくおいしかった・・・ちはるちゃんって、いいお嫁さんになれるよ。")
         (wait)
         (text #:color 3 "【ちはる】・・・うれしい。")
         (wait)
         (text #:color 7 "【" 0 "】今度俺の家に来て、料理を作ってくれよ。")
         (wait)
         (text #:color 3 "【ちはる】なにそれ？・・・" 0 "君の家って、御飯を作ってくれないの？")
         (wait)
         (text #:color 7 "【" 0 "】あれ、言わなかったっけ？・・・俺、一人暮らしなんだぜ。")
         (wait)
         (text #:color 3 "【ちはる】へえ、そうなんだ・・・。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、満腹だぜ・・・しばらく動きたくない気分だな。")
         (wait)
         (text #:color 3 "【ちはる】しばらく休んでなさいよ・・・私は台所をかたづけないと。")
         (wait)
         (set-reg: 114 (+ (: 114) 1))
         (slot 1 5)
         (mes-jump "chi_in1.mes")))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 3 "【ちはる】来てくれてよかった・・・作ってる最中に、もし来てくれなかったらどうしようかと思っちゃった。")
      (wait)
      (text #:color 7 "【" 0 "】俺は約束は破らないぜ。")
      (wait)
      (text #:color 3 "【ちはる】心をこめて作ったのよ・・・さめないうちに食べて。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 3 "【ちはる】私の家、すぐにわかった？")
      (wait)
      (text #:color 7 "【" 0 "】ああ、次からは目をつぶっても来られるぜ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【ちはる】どうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】一つ聞きたいんだけど、どうして俺を家に招待してくれた訳？")
      (wait)
      (text #:color 3 "【ちはる】だって、料理を食べてもらう為には、家に来てもらうしかないじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】俺の家に来たってできるぜ。")
      (wait)
      (text #:color 3 "【ちはる】料理は道具が大事なのよー・・・使い慣れた包丁じゃないと駄目なの。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 3 "【ちはる】先負駅でナンパされて・・・喫茶店で話をして、映画を見に行って、食事をして。")
      (wait)
      (text
       #:color
       3
       "【ちはる】そこまではよくあるパターンだけど・・・考えてみたら、私の家に"
       0
       "君がいるのって不思議な事よね。")
      (wait)
      (text #:color 7 "【" 0 "】事よねーって、ちはるちゃんが招待してくれたんじゃないかよう。")
      (wait)
      (text #:color 3 "【ちはる】だって、" 0 "君が私の事を色々と言うんですもの。")
      (wait)
      (text #:color 7 "【" 0 "】そんなに色々言ったか？")
      (wait)
      (text #:color 3 "【ちはる】言ったわよ。")
      (wait)
      (text #:color 7 "【" 0 "】でもさー、いくら歳下だって俺は男だぜ・・・二人きりでいて恐くない？")
      (wait)
      (text #:color 3 "【ちはる】あははは、" 0 "君が変な事をするはずがないもの。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん・・・完全になめられてるな。）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (< (: 48) 3))
     (<>
      (text #:color 3 "【ちはる】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【ちはる】なんか・・・差し向いって照れるわね。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、変な雰囲気になってきたぞ。）")
      (wait)
      (set-reg: 48 (+ (: 48) 1))))
    ((&& (== V 2) (== N 1) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】この時間に、パパはともかくママもいないの？")
      (wait)
      (text #:color 3 "【ちはる】子供の事からそうなの・・・俗に言う、共働きってやつね。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ・・・寂しいとか？")
      (wait)
      (text #:color 3 "【ちはる】小さい頃はそうだったけど、今はいない方がいいわ・・・いたらいたで、けっこううるさいし。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 2) (== N 1) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】ずいぶんと広そうな家だな・・・ちはるちゃんの部屋もあるんでしょ？")
      (wait)
      (text #:color 3 "【ちはる】二部屋あるわよ・・・一つは寝室だけど。")
      (wait)
      (text #:color 7 "【" 0 "】見せて。")
      (wait)
      (text #:color 3 "【ちはる】駄目・・・かたづけてないもん。")
      (wait)
      (text #:color 7 "【" 0 "】気にしないよ、俺は。")
      (wait)
      (text #:color 3 "【ちはる】いいから・・・" 0 "君は私の部屋を見に来たんじゃないでしょ？")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 3 "【ちはる】" 0 "君、早く食べないとさめちゃうわ。")
      (wait)
      (text #:color 7 "【" 0 "】そうだな・・・話ばかりしてないで、いいかげんに食べよう。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 2) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん、髪型は変わってないけど・・・エプロン姿を見てると若奥様って感じかな？）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 2) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】（食欲と性欲・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（まずは食欲だな・・・うん。）")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（ちはるちゃんだ・・・俺の事をじって見てるぞ。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（見られてると食べにくいな・・・。）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 3) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんは・・・かわいい。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（きれいな手だ・・・この手で料理を作ってくれたのか。）")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、俺様のポコチンも料理して欲しいもんだぜ。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 4) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんの手だ・・・頬にあてている。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（ちはるちゃんと差し向いってやつか・・・照れるぜ。）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 5) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんだ・・・黄色いシャツがかわいい。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】これは・・・ハンバーグだな。")
      (wait)
      (text #:color 3 "【ちはる】たまねぎと、パン粉と、ひき肉と・・・レトルトじゃなくて、れっきとした手作りよ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 6) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・おいしそうだ。")
      (wait)
      (text #:color 3 "【ちはる】どうせだったら、食べてから言って欲しいわ。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】これは？")
      (wait)
      (text #:color 3 "【ちはる】じゃがいもをお醤油で味つけして、砂糖を加えて煮たの・・・おいしいわよー。")
      (wait)
      (text #:color 7 "【" 0 "】へえ・・・家庭的な料理だな、ちょっと感動した。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 7) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】じゃがいもを煮たんだよね？")
      (wait)
      (text #:color 3 "【ちはる】ただ煮たんじゃないわよ・・・簡単そうな料理でも、作るのは大変なんだから。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】味噌汁だな・・・具は何だろう？")
      (wait)
      (text #:color 3 "【ちはる】お豆腐とネギよ・・・嫌い？")
      (wait)
      (text #:color 7 "【" 0 "】いーや、俺は好き嫌いはないんだ。")
      (wait)
      (text #:color 3 "【ちはる】女性の好みと一緒よね・・・" 0 "君って、誰でもよさそうだもの。")
      (wait)
      (text #:color 7 "【" 0 "】おいおい。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 8) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】味噌汁だぜ・・・具は豆腐とネギだ。") (wait)))
    ((&& (== V 1) (== N 9) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】ちはるちゃんって、お漬物まで作るの？")
      (wait)
      (text #:color 3 "【ちはる】あはは・・・これだけは、お店で売ってるやつ。")
      (wait)
      (text #:color 7 "【" 0 "】だよなあ、ヌカミソ臭いちはるちゃんなんて・・・なんだか似合わないや。")
      (wait)
      (text #:color 3 "【ちはる】でも、結婚したらちゃんとヌカミソで漬けるわよ・・・愛する旦那様の為ですもの。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 9) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】お漬物だぜ・・・。")
      (wait)
      (text #:color 3 "【ちはる】まさか、生まれて初めて食べるとか言わないわよね。")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 3 "【ちはる】それはマスタードよ・・・使う？")
      (wait)
      (text #:color 7 "【" 0 "】持って帰る。")
      (wait)
      (text #:color 3 "【ちはる】だめ。")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 3 "【ちはる】お茶は食べた後に入れてあげる。")
      (wait)
      (text #:color 7 "【" 0 "】なんだか夫婦みたいだなあ・・・いいなあ、こういうのって。")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<>
      (text #:color 3 "【ちはる】これはお茶が入ってる筒よ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、だろうと思った。")
      (wait)))
    ((&& (== V 1) (== N 13) (== (: 22) 0))
     (<>
      (text #:color 3 "【ちはる】おしょうゆって、漢字で書ける？")
      (wait)
      (text #:color 7 "【" 0 "】書けるよ・・・お醤油だろ？")
      (wait)
      (text #:color 3 "【ちはる】すっごい・・・" 0 "君って噂と違って勉強ができるのね。")
      (wait)
      (text #:color 7 "【" 0 "】と言う事は、噂では馬鹿って事か？")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 13) (== (: 22) 1))
     (<>
      (text #:color 3 "【ちはる】これはお醤油よ・・・傾けると、先から出てくるわよ。")
      (wait)
      (text #:color 7 "【" 0 "】あのねえ、俺は猿じゃないぞ。")
      (wait)))
    ((&& (== V 1) (== N 14))
     (<> (text #:color 3 "【ちはる】駄目よ、テレビを見ながら食べるなんて・・・。") (wait)))
    ((&& (== V 1) (== N 15) (== (: 23) 0))
     (<>
      (text #:color 3 "【ちはる】" 0 "君、家にはいやらしいビデオはないわよ・・・それに食欲と性欲って相反するものなんだから。")
      (wait)
      (text #:color 7 "【" 0 "】確かにそうだよな・・・食べながらセックスをする気にはなれないぞ。")
      (wait)
      (text #:color 3 "【ちはる】そういう意味じゃないの。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 15) (== (: 23) 1))
     (<> (text #:color 3 "【ちはる】ビデオが見たいのなら、食べてからにしてよ。") (wait)))
    ((&& (== V 1) (== N 16))
     (<> (text #:color 7 "【" 0 "】（うーん・・・テーブルと言うより、『ちゃぶ台』って感じだな。）") (wait)))
    ((&& (== V 1) (== N 17))
     (<> (text #:color 7 "【" 0 "】（カレンダーだな・・・今は８月だ。）") (wait)))
    ((&& (== V 1) (== N 18))
     (<> (text #:color 7 "【" 0 "】（この向こう側が台所だ・・・こういう造りの家って、最近見ないよな。）") (wait)))
    ((&& (== V 1) (== N 19)) (<> (text #:color 7 "【" 0 "】（人形・・・かな？）") (wait)))
    ((&& (== V 1) (== N 20) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】へえ、ちはるちゃんって家でもお酒を飲むんだ。")
      (wait)
      (text #:color 3 "【ちはる】違うわよ、これは全部パパのお酒・・・私は家で飲まないし、しいて言えば料理で使う時ぐらいね。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 20) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】（お酒がずらっと並んでる・・・。）") (wait)))
    ((&& (== V 1) (== N 21))
     (<> (text #:color 7 "【" 0 "】（この中には食器とかが入ってるのかな？）") (wait)))
    ((&& (== V 1) (== N 22) (== (: 25) 0))
     (<>
      (text #:color 3 "【ちはる】" 0 "君、湯のみの中には何も入ってないわよ。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 22) (== (: 25) 1))
     (<>
      (text #:color 3 "【ちはる】" 0 "君って、御飯を食べる前にお茶を飲むの？")
      (wait)
      (text #:color 7 "【" 0 "】どっちでもいい。")
      (wait)))
    ((&& (== V 1) (== N 23) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】（ちはるちゃんの家の中だ・・・きょろきょろきょろ。）")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 23) (== (: 26) 1))
     (<> (text #:color 7 "【" 0 "】（うーん・・・木造の家の香りがする、くんか、くんか。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))