(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\。
  #\は
  #\か
  #\ん
  #\っ
  #\、
  #\し
  #\の
  #\て
  #\麗
  #\子
  #\う
  #\た
  #\？
  #\と
  #\す
  #\で
  #\だ
  #\ま
  #\が
  #\ど
  #\ら
  #\る
  #\（
  #\）
  #\さ
  #\に
  #\あ
  #\け
  #\く
  #\を
  #\も
  #\れ
  #\そ
  #\や
  #\り
  #\人
  #\よ
  #\ー
  #\！
  #\ね
  #\せ
  #\わ
  #\お
  #\え
  #\事
  #\２
  #\言
  #\何
  #\つ
  #\じ
  #\話
  #\ち
  #\ょ
  #\ぞ
  #\ゃ
  #\こ
  #\方
  #\俺
  #\ほ
  #\５
  #\ぜ
  #\家
  #\ン
  #\電
  #\風
  #\き
  #\多
  #\物
  #\学
  #\着
  #\涼
  #\一
  #\気
  #\主
  #\ろ
  #\．
  #\ご
  #\茶
  #\ず
  #\笑
  #\色
  #\ド
  #\ア
  #\思
  #\ふ
  #\違)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "d01.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "d01an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "d01.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 38)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "d01.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 555) 1)
   (<>
    (text #:color 2 "【麗子】本当にありがとうございました・・・やはり男の人の力にはかないませんね。")
    (wait)
    (text #:color 7 "【" 0 "】はっはっはっ・・・ちょっと重かったけど。")
    (wait)
    (text #:color 2 "【麗子】暑かったでしょう？・・・少し、涼んでいってくださいね。")
    (wait)
    (text #:color 7 "【" 0 "】（うーん、扇風機に風鈴か・・・なんて風流なんだ。）")
    (wait)
    (text #:color 2 "【麗子】" 0 "さん、冷たいお茶を入れましたから・・・どうぞ召し上ってください。")
    (wait)
    (text #:color 7 "【" 0 "】は、はあ、いただきます・・・ずずずず。")
    (wait)
    (text #:color 2 "【麗子】いかがですか？")
    (wait)
    (text #:color 7 "【" 0 "】いやあ、冷たいお茶っておいしいんだな・・・知らなかった。")
    (wait)
    (text #:color 2 "【麗子】なんだかうれしいですね・・・たとえお茶でもおいしいって言っていただけると。")
    (wait)
    (animate 0 8 1)
    (animate 4 8)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "笑う")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】はっはっはっはっ！！")
         (wait)
         (text #:color 2 "【麗子】？？？")
         (wait)
         (text #:color 7 "【" 0 "】・・・はあ。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】わっはっはっはっ！！")
         (wait)
         (text #:color 2 "【麗子】あら、何かおかしい事でも？")
         (wait)
         (text #:color 7 "【" 0 "】（お前の顔だよ、なんて事は死んでも言えない。）")
         (wait)
         (set-reg: 10 2)))
       ((&& (== N 1) (== (: 10) 2))
        (<>
         (text #:color 7 "【" 0 "】はっはっはっはっ！！")
         (wait)
         (text #:color 2 "【麗子】笑うと、健康にいいんですって・・・" 0 "さんはきっと健康ですね。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【麗子】男手がないと、何かと不自由ですね・・・愚痴を言っても仕方ありませんけど。")
      (wait)
      (text #:color 7 "【" 0 "】正面のマンションに住んでるから、何かあったら呼んでよ・・・いつでも手伝うぜ。")
      (wait)
      (text #:color 2 "【麗子】ありがとう・・・心強いですわ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【麗子】女の一人暮しをしてますと、色々といやな事が多くて・・・男の方が色々としてきますのよ。")
      (wait)
      (text #:color 7 "【" 0 "】し、してくるって・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "夜這い") (text "いやがらせ") (text "新聞の勧誘") (text "宗教の誘い")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】まさか・・・夜這いとか！？")
         (wait)
         (text #:color 2 "【麗子】あらやだ、そんな言葉を知ってますの？・・・夜這する方はいませんけど、痴漢は多いですね。")
         (wait)
         (text #:color 7 "【" 0 "】ち、痴漢！？・・・俺じゃないぞう。")
         (wait)
         (text #:color 2 "【麗子】" 0 "さんなんて言ってません・・・お風呂に入ってる時に、外で物音がする事がよくあります。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・完全な覗きだな、一哉じゃないか？")
         (wait)
         (text #:color 2 "【麗子】それよりいやなのは・・・無言電話とか、いやらしい電話とか。")
         (wait)
         (text #:color 2 "【麗子】はしたない話ですけど、ドアの所に避妊具を置いていかれた方もいました。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、ひどい事をするやつがいるな・・・俺じゃないぞ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いやがらせ・・・とか？")
         (wait)
         (text #:color 2 "【麗子】そうですね・・・無言電話とか、いやらしい電話とか。")
         (wait)
         (text #:color 2 "【麗子】はしたない話ですけど、ドアの所に避妊具を置いていかれた方もいました。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、ひどい事をするやつがいるな・・・俺じゃないぞ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】新聞の勧誘とか？")
         (wait)
         (text #:color 2 "【麗子】それは・・・女の一人暮しとは関係ないと思います。")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・そりゃそうだ。")
         (wait)
         (text #:color 2 "【麗子】いやがらせが多いんです・・・無言電話とか、いやらしい電話とか。")
         (wait)
         (text #:color 2 "【麗子】はしたない話ですけど、ドアの所に避妊具を置いていかれた方もいました。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、ひどい事をするやつがいるな・・・俺じゃないぞ。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】わかった、宗教の勧誘とか？")
         (wait)
         (text #:color 2 "【麗子】いいえ、それはありませんけど、いやがらせが多いんです・・・無言電話とか、いやらしい電話とか。")
         (wait)
         (text #:color 2 "【麗子】はしたない話ですけど、ドアの所に避妊具を置いていかれた方もいました。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、ひどい事をするやつがいるな・・・俺じゃないぞ。")
         (wait)))
       (else (<>)))
      (text #:color 2 "【麗子】それでも・・・何もない一日よりは、いいかと思う時もあります。")
      (wait)
      (text #:color 7 "【" 0 "】（たとえいやがらせでも、何もないよりはいいって事か！？・・・うーん、寂しい、寂しすぎるっ！！）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 2 "【麗子】" 0 "さんは、勉強は何が得意ですか？")
      (wait)
      (text #:color 7 "【" 0 "】（げっ！！・・・一番苦手な質問だぜ。）")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (text "体育")
        (text "国語")
        (text "数学")
        (text "科学")
        (text "物理")
        (text "美術")
        (text "古文")
        (text "英語")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】ははは・・・体育かな？") (wait)))
       ((== N 2) (<> (text #:color 7 "【" 0 "】ははは・・国語かな？") (wait)))
       ((== N 3) (<> (text #:color 7 "【" 0 "】ははは・・・数学かな？") (wait)))
       ((== N 4) (<> (text #:color 7 "【" 0 "】ははは・・・科学かな？") (wait)))
       ((== N 5) (<> (text #:color 7 "【" 0 "】ははは・・・物理かな？") (wait)))
       ((== N 6) (<> (text #:color 7 "【" 0 "】ははは・・・美術かな？") (wait)))
       ((== N 7) (<> (text #:color 7 "【" 0 "】ははは・・・古文かな？") (wait)))
       ((== N 8) (<> (text #:color 7 "【" 0 "】ははは・・・英語かな？") (wait)))
       (else (<>)))
      (text #:color 2 "【麗子】まあ、私も学生の頃は得意でしたのよ・・・" 0 "さんもそうなんですか。")
      (wait)
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 2 "【麗子】" 0 "さんって・・・まさか、先負学園の" 0 "さん？")
      (wait)
      (text #:color 7 "【" 0 "】え！？")
      (wait)
      (text #:color 2 "【麗子】そうなんですか？")
      (wait)
      (text #:color 7 "【" 0 "】確かに俺は、先負学園だけど・・・どうして知ってのる？")
      (wait)
      (text #:color 2 "【麗子】ほほほほっ！！・・・あなたが、あの" 0 "さんでしたの。")
      (wait)
      (text #:color 7 "【" 0 "】な、なんだ！？")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 2 "【麗子】ごめんなさい、笑ってたりして・・・気を悪くしました？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "悪くした") (text "気にしてない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】うん・・・ちょっと。")
         (wait)
         (text #:color 2 "【麗子】ごめんなさいね、荷物を運んでくれた上に、気分まで悪くさせてしまって・・・。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】全然気にしてないけど・・・どうして笑ったの？")
         (wait)
         (text #:color 2 "【麗子】あの・・ほら・・・。")
         (wait)
         (text #:color 7 "【" 0 "】え？")
         (wait)
         (text #:color 2 "【麗子】色々と噂がありますでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・まあいいや、何となくわかったような気がする。")
         (wait)
         (set-reg: 115 (+ (: 115) 1))))
       (else (<>)))
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ、和服って暑くないの？")
      (wait)
      (text #:color 2 "【麗子】洋服よりは暑いかもしれませんけど・・・着なれてますから。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 2 "【麗子】それに、洋服よりも２枚は身につけなくて・・・あら、はしたない。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 2 "【麗子】" 0 "さん、涼しくなりましたか？")
      (wait)
      (text #:color 7 "【" 0 "】そうだな・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "涼しくなった") (text "涼しくない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】涼しくなったような・・・気がする。")
         (wait)
         (text #:color 2 "【麗子】そうですか・・・" 0 "さん、本当にありがとうございました。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】うーん、まだ涼しくないな。")
         (wait)
         (text #:color 2 "【麗子】ごめんなさいね、この家に冷房はありませんから・・・主人が嫌いなんです。")
         (wait)))
       (else (<>)))
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 2 "【麗子】そうだわ・・・" 0 "さんにお礼をしないと。")
      (wait)
      (text #:color 7 "【" 0 "】お礼？・・別にいいよ。")
      (wait)
      (text #:color 2 "【麗子】そうはいきません・・・主人に怒られてしまいます。")
      (wait)
      (text #:color 7 "【" 0 "】主人って・・・。")
      (wait)
      (text #:color 2 "【麗子】今はいませんけど、帰った時に怒られます。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、何をしてる人なんだろ？）")
      (wait)
      (text #:color 7 "【" 0 "】あの、麗子さんの『主人』ってさ・・・何をしてる人なの？")
      (wait)
      (text #:color 2 "【麗子】ふふふ・・・何だと思います？")
      (wait)
      (text #:color 7 "【" 0 "】えーと、家を空ける事が多いって事は・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "商社マン") (text "旅人") (text "愛人") (text "パイロット") (text "航海士")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】わかった、商社マンでしょ？・・・海外出張が多いとか？")
         (wait)
         (text #:color 2 "【麗子】残念ですね・・・違います。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】わかった旅人でしょ？")
         (wait)
         (text #:color 2 "【麗子】旅人って・・・何ですか？")
         (wait)
         (text #:color 7 "【" 0 "】だって、家を空ける事が多いって言うから・・・。")
         (wait)
         (text #:color 2 "【麗子】・・・。")
         (wait)
         (text #:color 2 "【麗子】ほほほほほっ！！・・・" 0 "さんって面白い方ですね。")
         (wait)
         (set-reg: 115 (+ (: 115) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】わかった、愛人でしょ？・・・だからいつもこの家にいないんだ。")
         (wait)
         (text #:color 2 "【麗子】違います・・・ちゃんと結婚しています。")
         (wait)
         (text #:color 7 "【" 0 "】（あらら・・・ちょっと怒らせちゃったかな？）")
         (wait)
         (text #:color 2 "【麗子】・・・。")
         (wait)
         (set-reg: 115 (- (: 115) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】わかったぞ、飛行機のパイロットとか？")
         (wait)
         (text #:color 2 "【麗子】残念ですね・・・違います。")
         (wait)))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】わかったぞ・・・船の航海士とか？")
         (wait)
         (text #:color 2 "【麗子】残念ですね・・・違います。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】うーん・・・わからないよ。")
      (wait)
      (text #:color 2 "【麗子】私の主人は、華道の家元なんです・・・今は西の都で稽古をつけてますの。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん、単身赴任ってやつだな。")
      (wait)
      (text #:color 2 "【麗子】最初はこちらの方で、稽古をつける予定でしたの・・・でも、京都の方に戻らないといけなくなって。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 2 "【麗子】" 0 "さんにお礼って・・・どうしたらいいのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】だからいいって・・・冷たいお茶で十分さ。")
      (wait)
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 2 "【麗子】" 0 "さんって、脚のサイズはおいくつかしら？")
      (wait)
      (text #:color 7 "【" 0 "】俺は・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (text "２４．５")
        (text "２５")
        (text "２５．５")
        (text "２６")
        (text "２６．５")
        (text "２７")
        (text "３０")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】２４．５だけど・・・それがどうかしたの？") (wait)))
       ((== N 2) (<> (text #:color 7 "【" 0 "】２５だけど・・・それがどうかしたの？") (wait)))
       ((== N 3) (<> (text #:color 7 "【" 0 "】２５．５だけど・・・それがどうかしたの？") (wait)))
       ((== N 4) (<> (text #:color 7 "【" 0 "】２６だけど・・・それがどうかしたの？") (wait)))
       ((== N 5) (<> (text #:color 7 "【" 0 "】２６．５だけど・・・それがどうかしたの？") (wait)))
       ((== N 6) (<> (text #:color 7 "【" 0 "】２７だけど・・・それがどうかしたの？") (wait)))
       ((== N 7) (<> (text #:color 7 "【" 0 "】３０だけど・・・それがどうかしたの？") (wait)))
       (else (<>)))
      (text #:color 2 "【麗子】まあ、ちょうどよかったわ・・・主人と同じサイズですね。")
      (wait)
      (text #:color 7 "【" 0 "】はあ？")
      (wait)
      (text #:color 2 "【麗子】ちょっと待ってくださいね・・・台の上に乗らないと届かないので。")
      (wait)
      (set-var A 1)
      (proc 13)
      (proc 11)
      (slot 1 7)
      (mes-jump "d09.mes")))
    ((&& (== V 1) (== N 2) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・よく見ると、かわいい顔をしてるな。）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 2) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】（この寂しそうな笑顔が、何とも言えない・・・。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】（ちょっと茶色いけど・・・昔、ヤンキーだったとか？）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（ははは、まさかね。）")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 3) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】（麗子さんの髪は・・・ホワホワしてて柔らかそうだ。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（細いなあ・・・同じ人間で、こうも違うものか？）")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 4) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】（なんだか、俺の腕の太さと同じくらいだぜ・・・。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】（この手は・・・ポコチンにずっと触れてない。）")
      (wait)
      (text #:color 7 "【" 0 "】（なんて事を考えてるとは、麗子さんも思ってないだろう・・・はっはっはっ。）")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 5) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】（麗子さんの指は・・・細いな。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】（着物を着てると、胸が苦しくないのかな・・・つぶれてるように見えるぜ。）")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 6) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】（麗子さんの胸は・・・大きいのか、小さいのか、さっぱりわからない。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（下着をはいてないのかな？）")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 7) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】（うーん・・・人妻って事は処女じゃないぞ。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 24) 0))
     (<> (text #:color 7 "【" 0 "】（うーん・・・奇麗な着物だ。）") (wait) (set-reg: 24 1)))
    ((&& (== V 1) (== N 8) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】（高価な着物なんだろうな・・よくわからないけど。）") (wait)))
    ((&& (== V 1) (== N 15) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・和服とリボン、どうもギャップを感じてしまうぞ。）")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 15) (== (: 25) 1))
     (<> (text #:color 7 "【" 0 "】（このリボンをとくと・・・どんな髪型になるんだろ？）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 26) 0))
     (<> (text #:color 7 "【" 0 "】（扇風機だ・・・情緒があるぜ。）") (wait) (set-reg: 26 1)))
    ((&& (== V 1) (== N 9) (== (: 26) 1))
     (<>
      (text #:color 7 "【" 0 "】（最近は扇風機がはやってるんだ・・・もっとも、この家の場合は、はやりは関係ないと思うが。）")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<> (text #:color 7 "【" 0 "】（風鈴の音色が耳に心地よい・・・うーん。）") (wait)))
    ((&& (== V 1) (== N 11) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】（くんか、くんか・・・たたみの匂いがする。）")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 11) (== (: 27) 1))
     (<>
      (text #:color 7 "【" 0 "】（たたみの上に座ってると、なんだか落ち着くな・・・俺ってやっぱり日本人なんだろうな。）")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】（これはドアとは言わないぜ・・・『戸』かな？）")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 12) (== (: 28) 1))
     (<> (text #:color 7 "【" 0 "】（『戸』だな・・・うんうん。）") (wait)))
    ((&& (== V 1) (== N 13))
     (<> (text #:color 7 "【" 0 "】（廊下だぜ・・・こんな広い家に一人じゃ、心細いだろうなあ。）") (wait)))
    ((&& (== V 1) (== N 14) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】（庭が見える・・・俺の部屋の窓からも見えるぞ。）")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 14) (== (: 29) 1))
     (<> (text #:color 7 "【" 0 "】（外がまぶしいぜ・・・。）") (wait)))
    ((&& (== V 1) (== N 16))
     (<>
      (text #:color 7 "【" 0 "】（麗子さんの家だ・・・この広い家に二人きりだぜ。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（おいおい、変な事を考えるなよ・・・。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))