(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\。
  #\ん
  #\な
  #\っ
  #\の
  #\麗
  #\子
  #\て
  #\、
  #\あ
  #\は
  #\さ
  #\し
  #\か
  #\た
  #\が
  #\に
  #\だ
  #\ら
  #\う
  #\す
  #\ま
  #\を
  #\で
  #\る
  #\と
  #\く
  #\そ
  #\も
  #\？
  #\き
  #\俺
  #\！
  #\わ
  #\（
  #\）
  #\れ
  #\こ
  #\え
  #\け
  #\ど
  #\女
  #\よ
  #\人
  #\り
  #\ち
  #\つ
  #\彼
  #\上
  #\思
  #\箱
  #\せ
  #\動
  #\分
  #\手
  #\落
  #\色
  #\事
  #\ン
  #\私
  #\指
  #\ろ
  #\じ
  #\め
  #\ば
  #\お
  #\身
  #\体
  #\腰
  #\げ
  #\ゃ
  #\気
  #\台
  #\乗
  #\見
  #\男
  #\部
  #\主
  #\一
  #\ね
  #\ス
  #\物
  #\軽
  #\蔑)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "d09.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "d03.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 555) 1)
   (<>
    (text #:color 2 "【麗子】主人が一度も履いてない靴がありますの・・・よろしかったら、差し上げますわ。")
    (wait)
    (text #:color 7 "【" 0 "】靴？")
    (wait)
    (text #:color 2 "【麗子】ええ、主人はもう履かないと思いますし・・・" 0 "さんに使ってもらった方が靴も喜びます。")
    (wait)
    (text #:color 7 "【" 0 "】（まさか・・・ゲタじゃないだろうな？）")
    (wait)
    (text #:color 2 "【麗子】よいしょ・・・。")
    (wait)
    (text #:color 2 "【麗子】・・・。")
    (wait)
    (text #:color 2 "【麗子】" 0 "さん、ごめんなさい・・・ちょっと手伝ってもらえます？")
    (wait)
    (text #:color 7 "【" 0 "】え？")
    (wait)
    (text #:color 2 "【麗子】取ろうとした箱は平気なんですけど・・・他の箱が落ちてしまいそう。")
    (wait)
    (text #:color 7 "【" 0 "】あ・・・本当だ。")
    (wait)
    (text #:color 2 "【麗子】" 0 "さん、一緒に台に乗ってかまいませんから・・・押さえていただけません？")
    (wait)
    (text #:color 7 "【" 0 "】いいよ、箱を押さえればいいんだろ？")
    (wait)
    (text #:color 2 "【麗子】お願いします。")
    (wait)
    (text #:color 7 "【" 0 "】麗子さん、ちょとだけ横に・・・そうしないと、俺が台の上に乗れないぜ。")
    (wait)
    (text #:color 2 "【麗子】これでいいかしら？")
    (wait)
    (text #:color 7 "【" 0 "】よし、台の上に乗って・・・と。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "d03.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "d03an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "d03.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】（どきっ！！近くで見ると・・・ますますかわいい顔に見えるぞ。）")
    (wait)
    (text #:color 2 "【麗子】ありがとう、" 0 "さん・・・そちらの紫色の箱を押さえてもらえますか？")
    (wait)
    (text #:color 7 "【" 0 "】あ！？・・・あ、ああ・・・この箱ね。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "どきどきする")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】どきどきどきどきどきどき・・・はっはっはっはっ。")
         (wait)
         (text #:color 2 "【麗子】そんなに重いかしら・・・その箱。")
         (wait)
         (text #:color 7 "【" 0 "】はははははっ・・・ちょっと心臓が悪いもんで。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<> (text #:color 7 "【" 0 "】（どきどき・・・人妻には見えないよなあ。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【麗子】" 0 "さん、ちゃんと押さえててくださいね。")
      (wait)
      (text #:color 7 "【" 0 "】何を？")
      (wait)
      (text #:color 2 "【麗子】その紫色の箱です。")
      (wait)
      (text #:color 7 "【" 0 "】誰が？")
      (wait)
      (text #:color 2 "【麗子】ですから・・・" 0 "さんがです。")
      (wait)
      (text #:color 7 "【" 0 "】あ！？・・・ああ、そうだった。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 2 "【麗子】落ちそうですよ。")
      (wait)
      (text #:color 7 "【" 0 "】何が？")
      (wait)
      (text #:color 2 "【麗子】ですから・・・" 0 "さんが持っている箱の事です。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・危ないなあ、もう。")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 2) (== N 1) (== (: 11) 2))
     (<>
      (text #:color 7 "【" 0 "】麗子さんって・・・。")
      (wait)
      (text #:color 2 "【麗子】え？")
      (wait)
      (text #:color 7 "【" 0 "】麗子さんって・・・かわいい。")
      (wait)
      (text #:color 2 "【麗子】い、いやですわ・・・変な事を言わないでください。")
      (wait)
      (text #:color 7 "【" 0 "】根が正直なもので・・・。")
      (wait)
      (set-reg: 11 3)))
    ((&& (== V 2) (== N 1) (== (: 11) 3))
     (<>
      (text #:color 2 "【麗子】確か色は茶色で・・・" 0 "さんに、きっと似合うと思いますから。")
      (wait)
      (text #:color 7 "【" 0 "】（麗子さんって・・・いくつなんだろう？）")
      (wait)
      (text #:color 2 "【麗子】確か、紐靴だったと思いますけど・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（こんなかわいい人をほっておくなんて・・・主人って野郎も罪な男だぜ。）")
      (wait)
      (text #:color 2 "【麗子】" 0 "さん・・・聞いてます？")
      (wait)
      (text #:color 7 "【" 0 "】え！？・・・も、もちろん！！")
      (wait)
      (set-reg: 11 4)))
    ((&& (== V 2) (== N 1) (== (: 11) 4))
     (<>
      (text #:color 2 "【麗子】" 0 "さん・・・？")
      (wait)
      (text #:color 7 "【" 0 "】（すべすべした肌、薄くピンク色をした唇・・・。）")
      (wait)
      (text #:color 2 "【麗子】" 0 "さんったら。")
      (wait)
      (text #:color 7 "【" 0 "】（くんか、くんか・・・いい香りがする。）")
      (wait)
      (text #:color 2 "【麗子】紫色の箱が・・・落ちそうですよ。")
      (wait)
      (text #:color 7 "【" 0 "】（長いまつ毛、寂しそうな瞳の色、柔らかそうな髪・・・ああ、たまらんぜ。）")
      (wait)
      (set-reg: 11 5)))
    ((&& (== V 2) (== N 1) (== (: 11) 5))
     (<>
      (text #:color 2 "【麗子】" 0 "さん・・・どうかしました？")
      (wait)
      (text #:color 7 "【" 0 "】麗子さんって・・・素敵な人だなって思って。")
      (wait)
      (text #:color 2 "【麗子】からかわないでください。")
      (wait)
      (text #:color 7 "【" 0 "】からかってないさ・・・本気でそう思ったんだ。")
      (wait)
      (text #:color 2 "【麗子】そんな事より、ほら・・・箱が落ちそうですよ。")
      (wait)
      (text #:color 7 "【" 0 "】（ああ・・・頭に血がのぼってきた。）")
      (wait)
      (set-arr~ @ 7 0)
      (load "d03a.a6" 47104)))
    ((&& (== V 7) (== N 1))
     (<>
      (text #:color 7 "【" 0 "】（ああ、そんな事をしてはいけない・・・いけないと思いつつ、勝手に身体が動く。）")
      (wait)
      (text #:color 6 "ちゅう！！")
      (wait)
      (text #:color 2 "【麗子】きゃあっ！！")
      (wait)
      (text #:color 7 "【" 0 "】おわわわわっ！！・・・あ、危ないっ！！")
      (wait)
      (text #:color 6 "ドッスンバリバリ！！")
      (sound 1)
      (set-var I 37)
      (proc 26)
      (sound 1)
      (set-var I 37)
      (proc 26)
      (sound 1)
      (set-var I 37)
      (proc 26)
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "kuro.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (sound 1)
      (text #:color 7 "・・・。")
      (wait)
      (text "・・・。")
      (wait)
      (text "・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】いててて・・・ん、なんか重いな。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "d04.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "d04an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "d04.s4" (~ @ 2))
      (animate 0 0 0)
      (animate 1 0)
      (set-arr~ @ 7 0)
      (sound 1)
      (set-var I 44)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 7 "【" 0 "】あれれ・・・どうして麗子さんが俺の上に？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】あ、そうか・・・俺が麗子さんにキスをして、二人で台から転げ落ちたんだ。")
      (wait)
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】まさか・・・麗子さんは意識を失ってるのか？")
      (wait)
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】しばらく、このままでいようかな・・・。")
      (wait)
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】あらら・・・ポコチンがはれてきてしまった。")
      (wait)
      (text #:color 2 "【麗子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】いてててっ・・・麗子さんが乗ってるから、ポコチンが圧迫されてるぞ。")
      (wait)
      (text #:color 2 "【麗子】" 0 "さん・・・動かないでください。")
      (wait)
      (text #:color 7 "【" 0 "】ぎくうっ！！・・・れ、麗子さん、いつ気がついた！？")
      (wait)
      (text #:color 2 "【麗子】最初から気がついてました・・・しばらく、このままでいてください。")
      (wait)
      (text #:color 7 "【" 0 "】（麗子さん・・・俺がいきなりキスしたから、きっと怒ってるだろうな。）")
      (wait)
      (text #:color 2 "【麗子】ああ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 2 "【麗子】男の人の匂い・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・一応、俺も男だから。")
      (wait)
      (text #:color 2 "【麗子】そうですね・・・私の腰のあたりに、固い物が当たってます。")
      (wait)
      (text #:color 7 "【" 0 "】生理現象です。")
      (wait)
      (text #:color 2 "【麗子】" 0 "さんは、りっぱな男なんですね・・・あ、なんか動いてます。")
      (wait)
      (text #:color 7 "【" 0 "】生理現象です。")
      (wait)
      (text #:color 2 "【麗子】もうしばらく・・・このままでいてください。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【麗子】ああ・・・あ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（なんだ！？）")
      (wait)
      (text #:color 2 "【麗子】あ・・・あ・・・" 0 "さん、はしたない女だと思わないでください。")
      (wait)
      (text #:color 7 "そう言うと、彼女はいきなり腰を動かしはじめた。自分の股間を、俺の固くなった物の上にこすりつけるように・・・。")
      (wait)
      (text #:color 2 "【麗子】あ・・・あ・・・。")
      (wait)
      (text #:color 7 "彼女の腰は円を描くように動き続ける・・・これはいったい、どうしたというんだ！？")
      (wait)
      (text #:color 2 "【麗子】ん・・・ん・・・はあ。")
      (wait)
      (text #:color 7 "麗子さんはマンションの正面に住んでる人妻で・・・俺はただ、荷物を運ぶのを手伝っただけだ。")
      (wait)
      (text #:color 2 "【麗子】あは・・・くっ・・・んっ・・・んっ・・・あ・・・。")
      (wait)
      (text #:color 7 "その女性が、俺の上に乗り腰を動かしている・・・そうか、これはきっと夢なんだ。")
      (wait)
      (text #:color 2 "【麗子】あんっ・・・んっ・・・。")
      (wait)
      (text #:color 7 "俺は台から転げ落ちて、気を失ってるんだ・・・これは気を失っている俺が見ている夢に違いない。")
      (wait)
      (text #:color 2 "【麗子】んっ・・・んっ・・・あ、あなたあ。")
      (wait)
      (text #:color 7 "あなたって誰だ？")
      (wait)
      (text #:color 2 "【麗子】ど、どうして・・・私を独りにして・・・あんっ・・・。")
      (wait)
      (text #:color 7 "夢にしたら、ずいぶんとリアルだな・・・ん？")
      (wait)
      (text #:color 7 "このなま暖かい物は・・・涙？")
      (wait)
      (text #:color 2 "【麗子】私・・・あっ・・・寂しい・・・あっ・・・いつも独りぽっちで・・・あんっ・・・あっ・・・。")
      (wait)
      (text #:color 7 "これは・・・夢じゃない。")
      (wait)
      (text #:color 2 "【麗子】あっ・・・あんんっ。")
      (wait)
      (text #:color 7 "彼女の腰の動きはだんだんと激しくなってくる。着物のすそは乱れ、白いふとももがあらわになっている。")
      (wait)
      (text #:color 2 "【麗子】" 0 "さん・・・あんっ・・・ごめんなさい・・・私の事、軽蔑しないでください・・・お願い。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "軽蔑した") (text "軽蔑してない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】・・・軽蔑した。")
         (wait)
         (text #:color 2 "【麗子】当り前よね・・・こんな事をするなんて・・・自分でも信じられません。")
         (wait)
         (text #:color 7 "【" 0 "】でも・・・俺がキスしたのがいけなかったんだ。")
         (wait)
         (text
          #:color
          2
          "【麗子】"
          0
          "さんの身体の上に落ちて・・・男の人の匂いがしたら・・・頭の中が・・・あんっ・・・真っ白になって・・・。")
         (wait)
         (text #:color 2 "【麗子】あっ・・・" 0 "さん・・・このまま・・・私の身体を・・・んんっ・・・。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】軽蔑なんかしてないさ・・・もともと俺がキスしたのがいけないんだ。")
         (wait)
         (text
          #:color
          2
          "【麗子】"
          0
          "さんの身体の上に落ちて・・・男の人の匂いがしたら・・・頭の中が・・・あんっ・・・真っ白になって・・・。")
         (wait)
         (text #:color 2 "【麗子】あっ・・・" 0 "さん・・・このまま・・・私の身体を・・・んんっ・・・。")
         (wait)))
       (else (<>)))
      (text #:color 7 "彼女は喋りながらも、腰の動きを止めようとしない。俺は手を伸ばし、ふとももに手を這わせる。")
      (wait)
      (text #:color 2 "【麗子】ああっ・・・触られるなんて・・・あんっ・・・いけません。")
      (wait)
      (text
       #:color
       7
       "いけないわ、と言いつつ彼女が抵抗してるとは思えない・・・俺は自分の好奇心を満たす為に、ふとももに置かれた手をお尻の方に動かす。")
      (wait)
      (text #:color 2 "【麗子】だ、だめ・・・私には・・・主人がいます・・・。")
      (wait)
      (text #:color 7 "その主人が、麗子さんに寂しい思いをさせてるんじゃないか・・・そう思いつつ、俺は彼女のお尻に手を這わせた。")
      (wait)
      (text #:color 2 "【麗子】ああっ・・・。")
      (wait)
      (text #:color 7 "下着は・・・はいてない。")
      (wait)
      (text #:color 2 "【麗子】だめ・・・そんな事・・・いけません。")
      (wait)
      (text #:color 7 "腰の動きは止まらない・・・いくら間接的とはいえ、こうも刺激されると俺のボルデージも上がるばかりだ。")
      (wait)
      (text #:color 7 "俺はお尻に置いた手を、そのまま割れ目に這わせていく・・・下へ、さらに下へ・・・。")
      (wait)
      (text #:color 2 "【麗子】うっ・・・。")
      (wait)
      (text #:color 7 "彼女の身体がびくっと震えた・・・そう、俺の指は彼女の濡れた部分に到達している。")
      (wait)
      (text #:color 2 "【麗子】あは・・・あ。")
      (wait)
      (text #:color 7 "彼女は大きく息をはいた・・・俺の指は、彼女の合わさる部分を指で広げようとしている。")
      (wait)
      (text #:color 2 "【麗子】いけないわ・・・あ・・・そんな事・・・。")
      (wait)
      (text #:color 7 "俺の指に、彼女の蜜がからみつく・・・その部分の柔らかい肉は、俺の指を中に吸い込もうとする。")
      (wait)
      (text #:color 2 "【麗子】あっ・・・いや・・・指は・・・いやです。")
      (wait)
      (text #:color 7 "俺は両手を使い、彼女のその部分を広げる・・・そして指先は、彼女の一番敏感な部分を愛撫している。")
      (wait)
      (text #:color 2 "【麗子】あっ・・・感じる・・・あっ・・・あなたあ！！")
      (wait)
      (text #:color 7 "俺は『あなた』じゃない。")
      (wait)
      (text #:color 2 "【麗子】あんっ・・・あんっ・・・いい・・・すごくいいんです。")
      (wait)
      (text #:color 7 "その小さな突起が、大きく固くなってきた・・・俺はその部分を指でこするように愛撫し続ける。")
      (wait)
      (text #:color 2 "【麗子】ひ、ひい・・・。")
      (wait)
      (text #:color 7 "彼女は身体をびくびく震わせ、悲鳴に似た声を上げる。")
      (wait)
      (text #:color 2 "【麗子】" 0 "さん・・・私の胸を・・・触って・・・噛んでください。")
      (wait)
      (text #:color 7 "そう言うと彼女は自分で帯を緩め・・・白い胸をはだけた。")
      (wait)
      (slot 1 7)
      (mes-jump "d05.mes")))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 7 "【" 0 "】（なんて・・・寂しそうな瞳をしてるんだ。）") (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 7 "【" 0 "】（ああ・・・かわいらしい耳だ。）") (wait)))
    ((&& (== V 1) (== N 4))
     (<> (text #:color 7 "【" 0 "】（かわいらしい、小さな顔だ・・・。）") (wait)))
    ((&& (== V 1) (== N 5))
     (<> (text #:color 7 "【" 0 "】（麗子さんの髪からは・・・シャボンの香りがする。）") (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 7 "【" 0 "】（奇麗な肌だ・・・こんなかわいい人が、一人で暮らしているなんて・・・。）")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】（薄い紫色の和服に・・・真っ赤にバラか、ぼたんか、つばきの花の模様だな。）")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<> (text #:color 7 "【" 0 "】（台の上に乗ってるからな・・・たたみがやけに遠くに見えるぜ。）") (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】（このリボンを見てると・・・麗子さんって、少女のような可憐な人なのかな？）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))