(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\か
  #\り
  #\【
  #\】
  #\お
  #\の
  #\。
  #\な
  #\っ
  #\、
  #\し
  #\て
  #\う
  #\る
  #\ら
  #\に
  #\を
  #\ん
  #\た
  #\は
  #\ま
  #\と
  #\で
  #\あ
  #\よ
  #\が
  #\く
  #\だ
  #\俺
  #\そ
  #\？
  #\も
  #\ゃ
  #\君
  #\す
  #\れ
  #\わ
  #\め
  #\き
  #\ょ
  #\入
  #\ち
  #\見
  #\ぐ
  #\び
  #\私
  #\こ
  #\じ
  #\ー
  #\け
  #\み
  #\さ
  #\え
  #\せ
  #\ご
  #\中
  #\事
  #\シ
  #\ャ
  #\ワ
  #\つ
  #\ス
  #\顔
  #\感
  #\取
  #\タ
  #\今
  #\物)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "e05.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "e05an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "e05.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 44)
 (proc 26)
 (set-reg: 835 0)
 (animate 0 8 1)
 (animate 4 8)
 (set-arr~ @ 7 0)
 (load "e05.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 578) 1)
   (<>
    (text #:color 6 "【かおり】もう・・・いるなら、すぐに返事をしてよ。")
    (wait)
    (text #:color 7 "【" 0 "】あくびをすると、耳が遠くなるんだよ・・・。")
    (wait)
    (text #:color 6 "【かおり】そんな退屈してるんだったら、どうして一緒に入らないの？")
    (wait)
    (text #:color 7 "【" 0 "】へ？")
    (wait)
    (text #:color 6 "【かおり】へ、じゃなくて・・・シャワーによ。")
    (wait)
    (text #:color 7 "【" 0 "】はあ？")
    (wait)
    (text #:color 6 "【かおり】私がシャワーに入ったら・・・" 0 "君、後から入ってくると思った。")
    (wait)
    (text #:color 7 "【" 0 "】し、しまったあ・・・そこまで気が回らなかった。")
    (wait)
    (text #:color 6 "【かおり】もう・・・早く入ってらっしゃい。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "帰る")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】さてと・・・帰ろう。")
         (wait)
         (text #:color 6 "【かおり】シャワーぐらい浴びてきなさいよ。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】帰ろうっと。")
         (wait)
         (text #:color 6 "【かおり】そのままの姿で？")
         (wait)
         (text #:color 7 "【" 0 "】あれれ・・・俺はいつ服を脱いだんだ？")
         (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 1) (== (: 11) 0))
     (<> (text #:color 6 "【かおり】あはは・・・" 0 "君、ふざけないでよ。") (wait) (set-reg: 11 1)))
    ((&& (== V 7) (== N 1) (== (: 11) 1))
     (<> (text #:color 6 "【かおり】" 0 "君・・・キスじゃなくて、シャワーを浴びるのよ。") (wait)))
    ((&& (== V 1) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 6 "【かおり】" 0 "君・・・私の顔、化粧が落ちてる？")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 6 "【かおり】だって、まじまじと見るんですもの。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 1))
     (<> (text #:color 6 "【かおり】" 0 "君、私の顔を見てないで・・・早く一緒に入りましょ？") (wait)))
    ((&& (== V 8) (== N 3) (== (: 13) 0))
     (<>
      (text #:color 6 "【かおり】あははっ・・・もう、子供みたいな事をしないでよ。")
      (wait)
      (text #:color 7 "【" 0 "】髪を触るのが、どうして子供なんだよう。")
      (wait)
      (text #:color 6 "【かおり】" 0 "君の顔を見てると、何をされても子供っぽく感じちゃうわね。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 8) (== N 3) (== (: 13) 1))
     (<> (text #:color 6 "【かおり】髪の毛はいいから・・・早くいらっしゃい。") (wait)))
    ((&& (== V 6) (== N 4) (== (: 14) 0))
     (<>
      (text #:color 6 "【かおり】ふふっ・・・残念でした、そう簡単には取れません。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 6) (== N 4) (== (: 14) 1))
     (<>
      (text #:color 6 "【かおり】いいわよ・・・取れるものなら、取ってごらんなさい。")
      (wait)
      (set-reg: 14 2)))
    ((&& (== V 6) (== N 4) (== (: 14) 2))
     (<>
      (text #:color 6 "【かおり】いいわよ・・・取れるものなら、取ってごらんなさい。")
      (wait)
      (set-reg: 14 3)))
    ((&& (== V 6) (== N 4) (== (: 14) 3))
     (<>
      (text #:color 7 "【" 0 "】思いっきり・・・ぐいっ、と。")
      (wait)
      (text #:color 6 "【かおり】きゃっ！！")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "e03.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 0)
      (text #:color 6 "【かおり】もう、乱暴なんだから・・・一緒に入ってくれないと、裸を見せてあげないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】（見せてあげないわよって・・・大事な部分が見えてるぜ。）")
      (wait)
      (text #:color 6 "【かおり】バスタブにお湯を入れてあるの・・・" 0 "君、一緒に入りましょ？")
      (wait)
      (text #:color 7 "【" 0 "】（できれば・・・このまましばらく見ていたいな。）")
      (wait)
      (text #:color 6 "【かおり】" 0 "君・・・すごいわね。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 6 "【かおり】そんなになっちゃて・・・たくましいわあ。")
      (wait)
      (text #:color 7 "【" 0 "】ありゃりゃ・・・いつのまに。")
      (wait)
      (text #:color 6 "【かおり】ああんっ・・・私の方が興奮してきちゃう。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、今日はいつもよりリッパに見えるな。")
      (wait)
      (text #:color 6 "【かおり】" 0 "君の・・・りっぱよお！！")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "e04.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "e04an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "e04.s4" (~ @ 2))
      (animate 0 0 0)
      (animate 1 0)
      (set-arr~ @ 7 0)
      (text #:color 6 "【かおり】んぐうっ・・・太いわあ。")
      (wait)
      (text #:color 7 "かおりはいきなり俺のイチモツをつかむと、口の中に頬ばる・・・舌の感触が生暖かい。")
      (wait)
      (text #:color 6 "【かおり】んぐっ・・・んぐっ・・・。")
      (wait)
      (text #:color 7 "俺は立ったまま、彼女の頭を押さえる・・・彼女の頭が前後に動いている。")
      (wait)
      (text #:color 6 "【かおり】すごい・・・こんなの・・・私の中に入れて欲しい。")
      (wait)
      (text #:color 7 "かおりは舌で、俺の敏感な部分を丹念に責めている・・・そして柔らかい唇が、再び俺の物を包み込む。")
      (wait)
      (text #:color 6 "【かおり】固い・・・すごく固い。")
      (wait)
      (text
       #:color
       7
       "かおりは俺の目を上目使いで見ながら、口を大きく開ける・・・そして信じられない事に根元まですっぽりと飲み込んでしまった。")
      (wait)
      (text #:color 6 "【かおり】どう？・・・いいでしょ？")
      (wait)
      (text
       #:color
       7
       "いたずらっぽく笑うと、また根元まで飲み込む・・・何回か繰り返したあと、今度は俺のタマタマの方に舌を這わせはじめた。")
      (wait)
      (text #:color 7 "ううっ、この感覚はたまらない・・・こんな事を続けられたら、俺はあっという間に昇天してしまいそうだ。")
      (wait)
      (text #:color 6 "【かおり】だめ・・・まだこうしてたいの。")
      (wait)
      (text #:color 7 "かおりの瞳はうるんでいる・・・そして、俺のサオとタマをいとおしそうになめまわす。")
      (wait)
      (text #:color 6 "【かおり】あんっ・・・なめてるだけで、私の方がいっちゃいそう。")
      (wait)
      (text #:color 7 "かおりは再び口の中に俺の物を頬ばると、今度は手と唇でリズミカルにしごき始めた。")
      (wait)
      (text #:color 6 "【かおり】んぐっ・・・んぐっ・・・んぐっ・・・。")
      (wait)
      (text
       #:color
       7
       "かおりの唇と、俺の物が摩擦するいやらしい音が聞こえる・・・だんだんと熱い感覚が、俺の腰のあたりを包みはじめた。")
      (wait)
      (text #:color 6 "【かおり】" 0 "君・・・まだ出しちゃだめよ。")
      (wait)
      (text
       #:color
       7
       "そう言うと、かおりは唇を俺のイチモツからはなした。ちくしょう、もうちょっとで彼女の口の中に放出できたのに・・・。")
      (wait)
      (text #:color 6 "【かおり】" 0 "君・・・今度は私の番なの。")
      (wait)
      (text
       #:color
       7
       "かおりは俺の物を握ったまま背中を向けた・・・そして顔だけを振り向かせ、微笑みながらゆっくりとバスタブの中に身を沈めた。")
      (wait)
      (text
       #:color
       7
       "そして俺の物から手を離すと、今度は俺の顔面に豊満なお尻を突き出した・・・かおりの肉づきのよいヒップが俺の目の前にある。")
      (wait)
      (slot 1 5)
      (mes-jump "e02.mes")))
    ((&& (== V 10) (== N 5) (== (: 15) 0))
     (<>
      (text #:color 6 "【かおり】あんっ・・・いや。")
      (wait)
      (text #:color 6 "【かおり】あらせないで・・・お楽しみはシャワーに入った後よ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 10) (== N 5) (== (: 15) 1))
     (<> (text #:color 6 "【かおり】も、もう・・・なめちゃ駄目よ。") (wait)))
    ((&& (== V 1) (== N 6))
     (<> (text #:color 6 "【かおり】" 0 "君、鏡を見ても私の裸はうつってないわよ。") (wait)))
    ((&& (== V 1) (== N 7))
     (<> (text #:color 6 "【かおり】もう・・・洗面台がそんなにめずらしい？") (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 6 "【かおり】ユニットバスだから、カーテンがないとびしょびしょになっちゃうの。")
      (wait)
      (text #:color 6 "【かおり】" 0 "君は・・・私のここをびしょびしょにしたいんでしょ？")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<> (text #:color 6 "【かおり】バスルームでするなんて・・・興奮するでしょ？") (wait)))
    ((&& (== V 1) (== N 10))
     (<> (text #:color 6 "【かおり】ドアは開けたままでいいわよ・・・閉めると暑いから。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))