(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\か
  #\。
  #\い
  #\お
  #\り
  #\な
  #\っ
  #\て
  #\、
  #\だ
  #\ん
  #\う
  #\よ
  #\は
  #\る
  #\の
  #\た
  #\あ
  #\？
  #\し
  #\に
  #\が
  #\で
  #\ら
  #\れ
  #\わ
  #\こ
  #\も
  #\そ
  #\と
  #\ゃ
  #\ま
  #\く
  #\ー
  #\ね
  #\君
  #\さ
  #\ち
  #\を
  #\ン
  #\じ
  #\え
  #\帰
  #\ッ
  #\！
  #\私
  #\事
  #\ス
  #\つ
  #\見
  #\め
  #\ポ
  #\何
  #\８
  #\け
  #\俺
  #\き
  #\部
  #\ぜ
  #\ぱ
  #\ょ
  #\屋
  #\気
  #\す
  #\げ
  #\ど
  #\言
  #\デ
  #\ビ
  #\ロ
  #\チ
  #\ず
  #\ラ
  #\オ
  #\や
  #\着
  #\（
  #\）
  #\酔
  #\号
  #\ク
  #\エ
  #\ジ
  #\せ
  #\バ
  #\奇
  #\麗
  #\本
  #\手)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "23.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "e06.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 578) 0)
   (<>
    (text #:color 7 "【" 0 "】なんだか・・・ずいぶんと走った気がするぞ。")
    (wait)
    (text #:color 6 "【かおり】おかげで酔いが少しさめたわ・・・ふう。")
    (wait)
    (text #:color 7 "【" 0 "】じゃあ、俺はここで。")
    (wait)
    (text #:color 6 "【かおり】ちょっと、お茶ぐらい飲んできなさいよ・・・それが礼儀ってものでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】おいおいおいっ！！")
    (wait)
    (text #:color 6 "【かおり】ねえ・・・そんなに帰りたい？")
    (wait)
    (set-reg: 101 0)
    (set-arr~ @ 7 0)
    (proc 18)
    (menu-show (<.> (text "帰る") (text "帰らない")))
    (if (== N 1)
      (<>
       (text #:color 7 "【" 0 "】帰るよ、俺は・・・。")
       (wait)
       (text #:color 6 "【かおり】あ・・・。")
       (wait)
       (text #:color 7 "【" 0 "】な、なんだよ。")
       (wait)
       (text #:color 6 "【かおり】まだ脚がフラフラする・・・一人じゃ部屋に戻れない。")
       (wait)
       (text #:color 7 "【" 0 "】あのなあ・・・。")
       (wait)
       (text #:color 6 "【かおり】早く・・・私を部屋まで連れてって。")
       (wait)
       (set-reg: 107 (- (: 107) 1))))
    (if (== N 2)
      (<>
       (text #:color 7 "【" 0 "】わかったよ・・・帰らない。")
       (wait)
       (text #:color 6 "【かおり】まだ脚がフラフラするの・・・早く部屋まで連れてって。")
       (wait)))
    (text #:color 7 "【" 0 "】部屋までって・・・何号室なのか知らないぜ。")
    (wait)
    (text #:color 6 "【かおり】８０８号室・・・鍵はこれ。")
    (wait)
    (text #:color 7 "【" 0 "】まったく、世話が焼けるよな・・・。")
    (wait)
    (text #:color 6 "【かおり】ごめんね・・・" 0 "君。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "kuro.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】オートロックだぜ・・・暗証番号を押さないと開かないよ。")
    (wait)
    (text #:color 6 "【かおり】ピッ、ポッ、パッ・・・はい、これで開くわよ。")
    (wait)
    (text #:color 7 "【" 0 "】８０８って事は、８階だよな・・・エレベーターに乗らないと。")
    (wait)
    (text #:color 6 "【かおり】階段で行く？")
    (wait)
    (text #:color 7 "【" 0 "】やだよ。")
    (wait)
    (text #:color 6 "【かおり】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ほれ、エレベーターが来たぜ・・・。")
    (wait)
    (text #:color 6 "【かおり】うん・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 6 "【かおり】" 0 "君・・・。")
    (wait)
    (text #:color 7 "【" 0 "】え？")
    (wait)
    (text #:color 6 "ちゅうっ！！")
    (wait)
    (text #:color 7 "【" 0 "】ああ・・・初キッスを奪われてしまった。")
    (wait)
    (text #:color 6 "【かおり】嘘つきなさいよ・・・。")
    (wait)
    (text #:color 7 "【" 0 "】８階だぜ・・・えーと、８号室は？")
    (wait)
    (text #:color 6 "【かおり】あっちよ・・・ほら、ここが８号室。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "03.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 22)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 6 "【かおり】ジャーン！！・・・ここが私のお城でーす！！")
    (wait)
    (text #:color 7 "【" 0 "】何がジャーンだよ・・・まったく。")
    (wait)
    (text #:color 6 "【かおり】" 0 "君・・・私、ちょっと着替えてくるわね。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "e06.pd8")
    (proc 16)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "e06an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "e06.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 6 "【かおり】お待たせ、" 0 "君・・・ねえ、顔は平気？")
    (wait)
    (text #:color 7 "【" 0 "】顔って・・・ああ、ケンカの事か。")
    (wait)
    (text #:color 7 "【" 0 "】見ての通り、まったく平気さ・・・あのオヤジ、殴り方がへなへなしてるんだもんな。")
    (wait)
    (text #:color 6 "【かおり】" 0 "君って、ケンカ強いのね。")
    (wait)
    (text #:color 7 "【" 0 "】はっはっはっ、俺様は無敵だ。")
    (wait)
    (text #:color 6 "【かおり】でもね・・・うれしかったわ。")
    (wait)
    (text #:color 7 "【" 0 "】何が？")
    (wait)
    (text #:color 6 "【かおり】鈍感ね・・・わからないの？")
    (wait)
    (set-reg: 578 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "帰る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】さてと・・・。")
         (wait)
         (text #:color 6 "【かおり】まだ来たばかりじゃない・・・帰っちゃだめよ。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 6 "【かおり】" 0 "君、まだ帰っちゃだめよ。")
         (wait)
         (text #:color 7 "【" 0 "】（あれれ・・・どうしてわかったんだ？）")
         (wait)))
       ((&& (== N 2) (== (: 11) 0))
        (<>
         (text #:color 6 "【かおり】そうよ、ずっとここにいて。")
         (wait)
         (text #:color 7 "【" 0 "】ずっとと言われても・・・それは困る。")
         (wait)
         (text #:color 6 "【かおり】やだ、別にここに住んでって言ってるわけじゃないわよ。")
         (wait)
         (set-reg: 11 1)))
       ((&& (== N 2) (== (: 11) 1))
        (<> (text #:color 7 "【" 0 "】（うーん、俺はいつまでここにいるつもりだ？）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 6 "【かおり】大丈夫よ、まだ化粧は落としてないから。")
      (wait)
      (text #:color 7 "【" 0 "】誰もそんな事は言ってないだろ。")
      (wait)
      (text #:color 6 "【かおり】あはは・・・そうよね。")
      (wait)
      (text #:color 7 "【" 0 "】（酔いは・・・だいぶさめたようだな。）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 1))
     (<>
      (text #:color 6 "【かおり】なんだか恥ずかしいわね・・・こんな姿を見せるなんて。")
      (wait)
      (text #:color 7 "【" 0 "】そう？")
      (wait)
      (text #:color 6 "【かおり】だって・・・私、いつもハデハデじゃない。")
      (wait)
      (set-reg: 12 2)))
    ((&& (== V 2) (== N 1) (== (: 12) 2))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ、そのバスローブの下って・・・何も着てないの？")
      (wait)
      (text #:color 6 "【かおり】ええ、スッポンポンよ。")
      (wait)
      (text #:color 7 "【" 0 "】あれま。")
      (wait)
      (set-reg: 12 3)))
    ((&& (== V 2) (== N 1) (== (: 12) 3))
     (<>
      (text #:color 6 "【かおり】私、お酒が弱くなってるのかしら・・・あれくらいで酔うなんて。")
      (wait)
      (text #:color 7 "【" 0 "】あれだけ飲めれば、じゅうぶん強い。")
      (wait)
      (text #:color 6 "【かおり】そんなに私、飲んでたかしら？・・・あまりよく覚えてないの。")
      (wait)
      (text #:color 7 "【" 0 "】そんな事ばかりしてると・・・朝起きた時に、隣に知らない男が寝てる事になるぜ。")
      (wait)
      (text #:color 6 "【かおり】あはは・・・あるわよ、何度か。")
      (wait)
      (text #:color 7 "【" 0 "】あ・・そう。")
      (wait)
      (set-reg: 12 4)))
    ((&& (== V 2) (== N 1) (== (: 12) 4))
     (<>
      (text #:color 6 "【かおり】しっかしあのジジイ、スケベだったわよねえ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】変なおぢさんだった・・・酔ってたんじゃないか？")
      (wait)
      (text #:color 6 "【かおり】" 0 "君・・・。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 6 "【かおり】ありがとう・・・私みたいな女を助けてくれて。")
      (wait)
      (text #:color 7 "【" 0 "】その『私みたい』って言うのはよせよ・・・かおりさんは、奇麗だと思うぜ。")
      (wait)
      (text #:color 6 "【かおり】でも・・・私、水商売だし。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "関係ない") (text "そうだな")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】関係ないだろ、そんな事・・・水商売だってりっぱな仕事だぜ。")
         (wait)
         (text #:color 6 "【かおり】うん・・・ありがとう。")
         (wait)
         (set-reg: 107 (+ (: 107) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・かおりさんは、ずっぽりと水商売だ。")
         (wait)
         (text #:color 6 "【かおり】やっぱり・・・そう見えるわよね。")
         (wait)
         (set-reg: 107 (- (: 107) 1))))
       (else (<>)))
      (set-reg: 12 6)))
    ((&& (== V 2) (== N 1) (== (: 12) 6))
     (<>
      (text #:color 6 "【かおり】うれしかったわ・・・本当に。")
      (wait)
      (text #:color 7 "【" 0 "】別に大した事はしてないよ。")
      (wait)
      (text #:color 6 "【かおり】ううん、" 0 "君の気持ちがうれしいの・・・私を守ってくれたんですもの。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (set-reg: 12 7)))
    ((&& (== V 2) (== N 1) (== (: 12) 7))
     (<>
      (text #:color 6 "【かおり】" 0 "君・・・ぱっくんしてあげようか？")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 6 "【かおり】だからあ・・・ぱっくんしてあげる。")
      (wait)
      (text #:color 7 "【" 0 "】ぱっくんって・・・ぱっくん？")
      (wait)
      (text #:color 6 "【かおり】大丈夫、お金は取らないから。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "してもらう") (text "断る")))
      (set-arr~ @ 7 1)
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】してもらっやおう・・・かな？")
         (wait)
         (text #:color 6 "【かおり】あははっ、冗談よ。")
         (wait)
         (text #:color 7 "【" 0 "】（なんだよ・・・本気にしたじゃないかよう。）")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いいよ・・・なんか、それが目的で送ったみたいだし。")
         (wait)
         (text #:color 6 "【かおり】へえ・・・" 0 "君って、いいじゃない。")
         (wait)
         (text #:color 7 "【" 0 "】何が？")
         (wait)
         (text #:color 6 "【かおり】だから・・・いい感じって事。")
         (wait)
         (set-reg: 107 (+ (: 107) 1))))
       (else (<>)))
      (set-reg: 12 8)))
    ((&& (== V 2) (== N 1) (== (: 12) 8))
     (<>
      (text #:color 6 "【かおり】私・・・" 0 "君に惚れちゃいそう。")
      (wait)
      (text #:color 7 "【" 0 "】またまた、そんな冗談を言っちゃって・・・俺に貢がそうたって、そうはいかないぜ。")
      (wait)
      (text #:color 6 "【かおり】あははっ・・・" 0 "君に貢いでもらおうなんて思わないわよ。")
      (wait)
      (text #:color 6 "【かおり】・・・。")
      (wait)
      (text #:color 6 "【かおり】ねえ、私が本気で好きになったら・・・どうする？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "うれしい") (text "逃げる")))
      (set-arr~ @ 7 1)
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そりゃうれしいよ・・・毎日ぱふぱふしてもらえそうだ。")
         (wait)
         (text #:color 6 "【かおり】あはは・・・" 0 "君、学校に行かなくなったりして。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】逃げるよ・・・かおりさんとつき合ったら、パサパサにされそうだ。")
         (wait)
         (text
          #:color
          6
          "【かおり】あはは・・・私ってセックスが好きだから、"
          0
          "君を学校に行かせないで、ずーっとベットの中に閉じ込めちゃいそう。")
         (wait)))
       (else (<>)))
      (set-reg: 12 9)))
    ((&& (== V 2) (== N 1) (== (: 12) 9))
     (<>
      (text #:color 6 "【かおり】" 0 "君って・・・絶対にいい。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 6 "【かおり】う、ううん・・・何でもないわ。")
      (wait)
      (text #:color 6 "【かおり】さーて、酔いを完全にさまさないと・・・明日は仕事を捜しに行かないとね。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "03.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (text #:color 6 "【かおり】" 0 "君・・・まだ帰っちゃだめよ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】シャワーの音が・・・聞こえるな。")
      (wait)
      (text #:color 7 "【" 0 "】ふああっ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】俺・・・ここでじっとしてるのか？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】帰っちゃおう・・・かな？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "帰る") (text "まだいる")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】そうだな・・・帰っちゃおう。") (wait)))
       ((== N 2) (<> (text #:color 7 "【" 0 "】なんだ・・・まだここにいるのか？") (wait)))
       (else (<>)))
      (text #:color 6 "【かおり】" 0 "君！！")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【かおり】まさか・・・帰っちゃったんじゃないでしょうね！？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "返事をする") (text "黙ったまま")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】はーい！！") (wait)))
       ((== N 2) (<> (text #:color 7 "【" 0 "】・・・。") (wait)))
       (else (<>)))
      (slot 1 5)
      (mes-jump "e05.mes")))
    ((&& (== V 1) (== N 2) (== (: 13) 0))
     (<>
      (text #:color 6 "【かおり】やだわ・・・そんなに見ないでよ。")
      (wait)
      (text #:color 7 "【" 0 "】いいじゃないかよう・・・何も初めて見るわけじゃないし。")
      (wait)
      (text #:color 6 "【かおり】女はね、男が変われば精神的処女に戻れる生き物なのよ・・・言ってる意味がわかる？")
      (wait)
      (text #:color 7 "【" 0 "】わかんなーい、子供だから。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 2) (== (: 13) 1))
     (<>
      (text #:color 6 "【かおり】" 0 "君の前では、絶対に化粧を落とさないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】（かおりさんって、化粧を落としても奇麗だと思うけど・・・。）")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 14) 0))
     (<>
      (text #:color 6 "【かおり】この紫色は、生まれつきなの。")
      (wait)
      (text #:color 7 "【" 0 "】嘘つき。")
      (wait)
      (text #:color 6 "【かおり】あはは・・・バレた？")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 3) (== (: 14) 1))
     (<> (text #:color 6 "【かおり】カツラじゃないわよ。") (wait)))
    ((&& (== V 1) (== N 4) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】あ・・・キスマークがついてる。")
      (wait)
      (text #:color 6 "【かおり】そう？")
      (wait)
      (text #:color 7 "【" 0 "】あれれ、全然動じないな。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 4) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】あ・・・歯形がついてる。")
      (wait)
      (text #:color 6 "【かおり】そう？")
      (wait)
      (text #:color 7 "【" 0 "】ちぇっ、つまらないの。")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】かおりさんの手って・・・奇麗だね。")
      (wait)
      (text #:color 6 "【かおり】あはは・・・この手で、何人ものポコチンを握った事があるのよ。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 5) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん、奇麗な手だ。")
      (wait)
      (text #:color 6 "【かおり】手・・・だけ？")
      (wait)
      (text #:color 7 "【" 0 "】手も奇麗だ・・・これでいい？")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】じいいい・・・色っぽい。")
      (wait)
      (text #:color 6 "【かおり】昔は小さかったのよ・・・でも、いっぱいもんでもらって、どんどん大きくなっちゃった。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 6) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】（うーん、美しい肌だ・・・ごっくん。）")
      (wait)
      (text #:color 6 "【かおり】この胸に顔を埋めて、グリグリしたいでしょ？")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】８４センチ・・・当たった？")
      (wait)
      (text #:color 6 "【かおり】８３センチよ・・・" 0 "君がもんでくれたら、８４センチになるかもね。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 7) (== (: 18) 1))
     (<>
      (text #:color 6 "【かおり】" 0 "君、見せてあげようか？")
      (wait)
      (text #:color 7 "【" 0 "】え・・・本当！？")
      (wait)
      (text #:color 6 "【かおり】嘘。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】バスローブの下は・・・スッポンポンポンポンポンポンポン、あらら、止まらなくなっちゃった。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 8) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】バスローブを着ると、こすれて乳首が立たない？")
      (wait)
      (text #:color 6 "【かおり】あ・・・はん。")
      (wait)
      (text #:color 6 "【かおり】立つわよ・・・ビンビンに。")
      (wait)
      (set-reg: 19 2)))
    ((&& (== V 1) (== N 8) (== (: 19) 2))
     (<>
      (text #:color 6 "【かおり】バスローブを着るとリラックスしちゃうわ・・・自分の部屋って一番いいわよね。")
      (wait)
      (text #:color 7 "【" 0 "】俺も・・・帰ろうかなあ。")
      (wait)
      (text #:color 6 "【かおり】まだ駄目、帰らないで。")
      (wait)
      (set-reg: 19 3)))
    ((&& (== V 1) (== N 8) (== (: 19) 3))
     (<>
      (text #:color 7 "【" 0 "】かおりさん、胸が見えそうだぜ・・・ポロッと。")
      (wait)
      (text #:color 6 "【かおり】サービスしてるのよ・・・しっかり見てね。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】テレビだよね？")
      (wait)
      (text #:color 6 "【かおり】ほとんど使ってないけど・・・この部屋には寝に帰るだけだから。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 9) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】使ってないなら、俺にちょうだい。")
      (wait)
      (text #:color 6 "【かおり】だめ・・・エッチなビデオが見れなくなっちゃう。")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 21) 0))
     (<>
      (text #:color 6 "【かおり】自慢じゃないけどね、このビデオデッキでエッチなビデオ以外は見た事がないわ。")
      (wait)
      (text #:color 7 "【" 0 "】本当に自慢じゃないよ・・・おい。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 10) (== (: 21) 1))
     (<>
      (text #:color 6 "【かおり】" 0 "君もエッチなビデオを見るでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】ははは、俺は実戦派なんだ。")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 22) 0))
     (<>
      (text #:color 6 "【かおり】自分で買った物なんか一つもないわよ・・・ぜーんぶお客さんが買ってくれたの。")
      (wait)
      (text #:color 7 "【" 0 "】いいなあ・・・女は得だ。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 11) (== (: 22) 1))
     (<>
      (text #:color 6 "【かおり】" 0 "君、あげないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】誰も欲しいなんて言ってない・・・。")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 23) 0))
     (<>
      (text #:color 6 "【かおり】この部屋のクローゼットって狭いのよ・・・衣装が入り切らないわ。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 12) (== (: 23) 1))
     (<> (text #:color 6 "【かおり】ハデな服がいっぱいあるわよ・・・着てみる？") (wait)))
    ((&& (== V 1) (== N 13) (== (: 24) 0))
     (<>
      (text #:color 6 "【かおり】何を見てるの？")
      (wait)
      (text #:color 7 "【" 0 "】・・・あれ。")
      (wait)
      (text #:color 6 "【かおり】このマンションって、空調システムがついてるの・・・いいでしょ？")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 13) (== (: 24) 1))
     (<> (text #:color 6 "【かおり】" 0 "君・・・見てておもしろい？") (wait)))
    ((&& (== V 1) (== N 14) (== (: 25) 0))
     (<>
      (text #:color 6 "【かおり】お客さんからもらった絵よ・・・けっこう気に入ってるわ。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 14) (== (: 25) 1))
     (<> (text #:color 6 "【かおり】" 0 "君、絵に興味があるの？・・・学校で美術部に入ってるとか？") (wait)))
    ((&& (== V 1) (== N 15) (== (: 26) 0))
     (<>
      (text #:color 6 "【かおり】気に入らない客の顔をここに貼ってね、ダーツを投げるのよ・・・あはは。")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 15) (== (: 26) 1))
     (<>
      (text #:color 6 "【かおり】" 0 "君の写真も貼っちゃおう・・・かな？")
      (wait)
      (text #:color 7 "【" 0 "】俺が何をしたって言うんだよう・・・。")
      (wait)))
    ((&& (== V 1) (== N 16) (== (: 27) 0))
     (<>
      (text #:color 6 "【かおり】いい部屋でしょ・・・ここにいる時が一番落ち着くわね。")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 16) (== (: 27) 1))
     (<> (text #:color 6 "【かおり】この部屋に住んでから・・・１年くらいかな？") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))