(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\か
  #\い
  #\お
  #\り
  #\ん
  #\の
  #\っ
  #\な
  #\（
  #\）
  #\て
  #\う
  #\、
  #\さ
  #\る
  #\だ
  #\ー
  #\あ
  #\で
  #\こ
  #\タ
  #\？
  #\手
  #\れ
  #\運
  #\転
  #\ク
  #\シ
  #\が
  #\ら
  #\は
  #\た
  #\く
  #\に
  #\と
  #\ま
  #\よ
  #\す
  #\し
  #\ど
  #\そ
  #\客
  #\け
  #\揺
  #\ン
  #\も
  #\ゃ
  #\き
  #\を
  #\ち
  #\ス
  #\身
  #\体
  #\ジ
  #\曲
  #\じ
  #\車
  #\え
  #\ろ
  #\！
  #\右)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "e09.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "e09an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "e09.s4" (~ @ 2))
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 62)
 (proc 26)
 (set-reg: 835 0)
 (animate 0 8 0)
 (animate 4 8)
 (set-arr~ @ 7 0)
 (load "e08.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 575) 1)
   (<>
    (text #:color 5 "【タクシーの運転手】お客さん、どちらまで？")
    (wait)
    (text #:color 6 "【かおり】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 5 "【タクシーの運転手】お客さん、しっかりしてくださいよ。")
    (wait)
    (text #:color 7 "【" 0 "】かおりさんってば・・・どこまで行くんだ？")
    (wait)
    (text #:color 6 "【かおり】身体が揺れる・・・。")
    (wait)
    (text #:color 7 "【" 0 "】『身体が揺れる』までお願いします。")
    (wait)
    (text #:color 5 "【タクシーの運転手】お客さん、そんな場所はありませんよ。")
    (wait)
    (text #:color 6 "【かおり】あの・・・『矢吹レジデンス』まで。")
    (wait)
    (text #:color 5 "【タクシーの運転手】矢吹レジデンスって言うと・・・どこでしたっけ？")
    (wait)
    (text #:color 6 "【かおり】私が・・・曲る時に言いますから。")
    (wait)
    (text #:color 7 "【" 0 "】（大丈夫かなあ・・・。）")
    (wait)
    (text #:color 5 "【タクシーの運転手】お客さん・・・どうでもいいですけど、ゲロだけはしないでくださいよ。")
    (wait)
    (text #:color 6 "【かおり】" 0 "君・・・身体が揺れるの。")
    (wait)
    (text #:color 7 "【" 0 "】身体が揺れてる訳じゃなくて、車が揺れてるんだって。")
    (wait)
    (text #:color 6 "【かおり】だめえ・・・揺れると気分が悪くなりそう。")
    (wait)
    (text #:color 5 "【タクシーの運転手】お客さん、ゲロされたら・・・こっちは商売できなくなりますよお。")
    (wait)
    (text #:color 6 "【かおり】" 0 "君・・・私の身体をしっかり押さえて。")
    (wait)
    (text #:color 7 "【" 0 "】・・・こう？")
    (wait)
    (text #:color 6 "【かおり】だめ・・・私の前に来て、両手でしっかり。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "e08.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 2)
    (image "e07.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 27)
    (proc 24)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】・・・これでいい？")
    (wait)
    (text #:color 6 "【かおり】うん・・・それでいい。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 6 "【かおり】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】（ふあああ、退屈だなあ・・・俺はいったい何やってんだろ？）")
    (wait)
    (text #:color 6 "【かおり】うーん・・・。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "e08.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "e08an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "e08.s4" (~ @ 2))
    (text #:color 7 "【" 0 "】（ぎょっ！？）")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "飛び降りる")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】（おいおい・・・まだ着いてないぜ。）")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<> (text #:color 7 "【" 0 "】（あのねえ・・・走ってる車から、どうやって飛び降りるんだ！？）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 6 "【かおり】うーん・・・運転手さん、そこを右に曲って。")
      (wait)
      (text #:color 5 "【タクシーの運転手】ここを・・・右ですね。")
      (wait)
      (set-var A 10)
      (proc 12)
      (proc 11)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 6 "【かおり】運転手さん・・・そこをＵターンして。")
      (wait)
      (text #:color 5 "【タクシーの運転手】Ｕターンですか？・・・はあ。")
      (wait)
      (set-var A 10)
      (proc 12)
      (proc 11)
      (set-reg: 11 2)))
    ((&& (== V 2) (== N 1) (== (: 11) 2))
     (<>
      (text #:color 6 "【かおり】・・・。")
      (wait)
      (text #:color 5 "【タクシーの運転手】お客さん・・・次の信号は、どちらに曲ればいいんですかね？")
      (wait)
      (text #:color 6 "【かおり】あ・・・真っ直ぐでいいの。")
      (wait)
      (text #:color 5 "【タクシーの運転手】はい、真っ直ぐですね・・・。")
      (wait)
      (set-var A 10)
      (proc 12)
      (proc 11)
      (set-reg: 11 3)))
    ((&& (== V 2) (== N 1) (== (: 11) 3))
     (<>
      (text #:color 6 "【かおり】あ・・・そこを左に曲って、次の交差点を右に曲って。")
      (wait)
      (text #:color 5 "【タクシーの運転手】えーと、左の・・・右と。")
      (wait)
      (set-var A 10)
      (proc 12)
      (proc 11)
      (set-reg: 11 4)))
    ((&& (== V 2) (== N 1) (== (: 11) 4))
     (<>
      (text #:color 5 "【タクシーの運転手】お客さん・・・ここの交差点は？")
      (wait)
      (text #:color 6 "【かおり】あの・・・右だと思います。")
      (wait)
      (text #:color 7 "【" 0 "】（だと思います！？）")
      (wait)
      (set-var A 10)
      (proc 12)
      (proc 11)
      (set-reg: 11 5)))
    ((&& (== V 2) (== N 1) (== (: 11) 5))
     (<>
      (text #:color 5 "【タクシーの運転手】あれれ！？")
      (wait)
      (text #:color 6 "【かおり】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ありゃりゃ！？")
      (wait)
      (text #:color 5 "【タクシーの運転手】お客さん・・・ここはお客さんが乗った場所じゃないですか。")
      (wait)
      (text #:color 6 "【かおり】・・・。")
      (wait)
      (text #:color 5 "【タクシーの運転手】どうします？")
      (wait)
      (text #:color 7 "【" 0 "】かおりさん、その『矢吹レジデンス』ってどの辺にあるの？")
      (wait)
      (text #:color 6 "【かおり】矢吹公園の・・・近く。")
      (wait)
      (text #:color 7 "【" 0 "】ここから歩いて行ける距離だな・・・かおりさん、歩ける？")
      (wait)
      (text #:color 6 "【かおり】う・・・ん。")
      (wait)
      (text #:color 7 "【" 0 "】（歩けば酔いもさめるかもな・・・こうなったら、とことんつき合うか。）")
      (wait)
      (text #:color 5 "【タクシーの運転手】お客さん・・・どうするんですか？")
      (wait)
      (text #:color 7 "【" 0 "】かおりさん、歩こう。")
      (wait)
      (text #:color 6 "【かおり】・・・。")
      (wait)
      (field 14 1 1)
      (field 13 0 0)
      (field 13 1 1)
      (set-reg: 1001 0)
      (set-var N 19)
      (set-reg: 577 1)
      (slot 1 3)
      (mes-jump "town1.mes")))
    ((&& (== V 1) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】（酔ってる割には、顔が赤くないな・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（吐きそうとか言わないだろうな・・・頼むぜ、おい。）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 1))
     (<>
      (text #:color 7 "【" 0 "】（顔は赤くないのは、彼女が酒に強いからだ・・・そういう事にしておこう。）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 2))
     (<>
      (text #:color 7 "【" 0 "】（寝てるの・・・かな？）")
      (wait)
      (text #:color 6 "【かおり】運転手さん・・・そこを左に。")
      (wait)
      (text #:color 7 "【" 0 "】（起きてるようだけど・・・半分寝てるようだ。）")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】（車が揺れるたびに、髪のゆらゆら揺れてる・・・。）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】（ふあああ・・・かおりさんの髪は紫色だ。）")
      (wait)
      (set-reg: 13 2)))
    ((&& (== V 1) (== N 3) (== (: 13) 2))
     (<> (text #:color 7 "【" 0 "】（彼女の髪の毛は・・・いい匂いがしたな。）") (wait)))
    ((&& (== V 9) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（触ったとたん、げーって・・・なるんじゃないか？）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 9) (== N 5) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】（よそうぜ・・・俺はモンジャ焼きは見たくもない。）")
      (wait)
      (set-reg: 14 2)))
    ((&& (== V 9) (== N 5) (== (: 14) 2))
     (<>
      (text #:color 7 "【" 0 "】（ちょっとだけ・・・触っちゃおうかな？）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・柔らかい。）")
      (wait)
      (text #:color 6 "【かおり】う・・・ううんっ。")
      (wait)
      (set-reg: 14 3)))
    ((&& (== V 9) (== N 5) (== (: 14) 3))
     (<>
      (text #:color 7 "【" 0 "】（もうちょっとだけ・・・触っちゃおう。）")
      (wait)
      (text #:color 6 "【かおり】あ・・・ん。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 15) 0))
     (<> (text #:color 7 "【" 0 "】（あらら・・・ぱっくりだよ。）") (wait) (set-reg: 15 1)))
    ((&& (== V 1) (== N 6) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・ストッキングが白いから、下着の色がよくわからないや。）")
      (wait)
      (set-reg: 15 2)))
    ((&& (== V 1) (== N 6) (== (: 15) 2))
     (<> (text #:color 7 "【" 0 "】（かおりさーん・・・パンツが見えてるよっ。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（白いストッキングだぜ・・・看護婦さんみたいだ。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 7) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】（車が揺れると、かおりさんの脚も閉じたり開いたり・・・できれば開いたままでいて欲しい。）")
      (wait)
      (set-reg: 16 2)))
    ((&& (== V 1) (== N 7) (== (: 16) 2))
     (<> (text #:color 7 "【" 0 "】（かおりさんって、スタイルがいいよな・・・。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（無防備だなあ・・・あのオヤジに連れてかれたら、何をされたかわかったもんじゃないぞ。）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 8) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】（頼むから、ゲロゲロしないでくれよ・・・。）")
      (wait)
      (set-reg: 17 2)))
    ((&& (== V 1) (== N 8) (== (: 17) 2))
     (<> (text #:color 7 "【" 0 "】（ハデだけど・・・かわいいところもあるよな、うんうん。）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】（タクシーに後ろ向きに乗ると・・・俺の気分が悪くなってくるよ。）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 9) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・早く着かないかな。）") (wait) (set-reg: 18 2)))
    ((&& (== V 1) (== N 9) (== (: 18) 2))
     (<> (text #:color 7 "【" 0 "】（タクシーの車内だ・・・俺は後ろ向きに乗ってるぞ。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))