(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\。
  #\い
  #\一
  #\哉
  #\っ
  #\、
  #\ん
  #\だ
  #\子
  #\て
  #\夏
  #\か
  #\の
  #\う
  #\？
  #\よ
  #\た
  #\は
  #\る
  #\に
  #\あ
  #\ら
  #\し
  #\さ
  #\を
  #\君
  #\こ
  #\つ
  #\が
  #\と
  #\で
  #\や
  #\ー
  #\！
  #\言
  #\わ
  #\ち
  #\く
  #\ゃ
  #\れ
  #\俺
  #\ね
  #\け
  #\ど
  #\気
  #\も
  #\め
  #\お
  #\（
  #\）
  #\達
  #\す
  #\ま
  #\人
  #\行
  #\ぜ
  #\じ
  #\ょ
  #\友
  #\り
  #\何
  #\来
  #\そ
  #\え)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "n21.pd8")
 (proc 24)
 (set-arr~ @ 6 1)
 (image "j11.pd8")
 (proc 16)
 (set-arr~ @ 6 1)
 (image "j12.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "j11an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "j11.s4" (~ @ 2))
 (animate 0 0 2)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 30)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "j11j12.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 486) 0)
   (<>
    (text #:color 2 "【夏子】" 0 "君・・・こんにちは。")
    (wait)
    (if (== (: 235) 0)
      (<>
       (text #:color 7 "【" 0 "】あれれ・・・どうして俺の名前を？")
       (wait)
       (text #:color 2 "【夏子】彼から・・・一哉君から聞いたの。")
       (wait)
       (text #:color 7 "【" 0 "】あ、なるほどね。")
       (wait)))
    (text #:color 5 "【一哉】" 0 "・・・また俺達の邪魔をする気か？")
    (wait)
    (text #:color 7 "【" 0 "】『また』とは何だよ・・・いつ俺が邪魔したんだ？")
    (wait)
    (text #:color 2 "【夏子】一哉君、大人げないわよ。")
    (wait)
    (text #:color 5 "【一哉】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】やーい、怒られてやんのっ！！")
    (wait)
    (text #:color 5 "【一哉】うるさいなあ・・・" 0 "も映画を観に来たのか？")
    (wait)
    (text #:color 7 "【" 0 "】いーや、俺はただの通行人だ。")
    (wait)
    (text #:color 5 "【一哉】通行人って言うのは立ち止まらないんだぜ・・・早くどこかに行けよ。")
    (wait)
    (if (== (: 235) 0)
      (<>
       (text
        #:color
        2
        "【夏子】一哉君ったらね、"
        0
        "君は危険人物だから、気をつけた方がいいって言うのよ・・・あなたって本当に危険な人なの？")
       (wait)))
    (if (== (: 235) 1)
      (<>
       (text
        #:color
        2
        "【夏子】こんな事言ってるけど、一哉君ってね・・・私と一緒にいる時でも"
        0
        "君の話をするのよ、男の中で一番好きなのは"
        0
        "君なんですって。")
       (wait)
       (text #:color 5 "【一哉】や、やめてくれよう・・・夏子さん。")
       (wait)
       (text #:color 7 "【" 0 "】気持ち悪いな・・・ホモか、一哉は。")
       (wait)))
    (text #:color 5 "【一哉】夏子さん、ここで" 0 "の話はやめようよ・・・ね？")
    (wait)
    (set-reg: 486 1)
    (if (== (: 235) 0)
      (<>
       (text #:color 7 "【" 0 "】はっはっはっ、俺が危険人物だって？・・・本当かどうか、ここで証明しちゃおうかな。")
       (wait)
       (text #:color 5 "【一哉】あっちへ行けっ！！")
       (wait)
       (text #:color 7 "【" 0 "】わかった、わかった・・・じゃあ夏子さん、ばいばい。")
       (wait)
       (text #:color 2 "【夏子】さようなら、" 0 "君。")
       (wait)
       (set-var N 22)
       (slot 1 3)
       (mes-jump "town1.mes")))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（せっかくだから・・・もうちょっとここにいてやるか。）") (wait)))
       ((== N 1)
        (<>
         (text #:color 5 "【一哉】" 0 "、俺達のあとをついて来るなよ。")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっ・・・ついて行っちゃおうかな？")
         (wait)
         (text #:color 5 "【一哉】だめ・・・絶対にだめ。")
         (wait)
         (text #:color 7 "【" 0 "】わかってるって・・・友情にヒビを入れるつもりはない。")
         (wait)
         (text #:color 2 "【夏子】さようなら、" 0 "君。")
         (wait)
         (set-var N 22)
         (slot 1 3)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 5 "【一哉】なんだ・・・" 0 "も映画を観に来たんじゃないか。")
         (wait)
         (text #:color 7 "【" 0 "】誰が？")
         (wait)
         (text #:color 5 "【一哉】だって今、中に入ろうとしただろ？")
         (wait)
         (text #:color 7 "【" 0 "】気のせいじゃないか？")
         (wait)))
       ((== N 3) (<> (text #:color 5 "【一哉】なんだよ・・・まだ俺達に用があるのか？") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、今度は偶然会ったなんて言わせないぜ。")
      (wait)
      (text #:color 2 "【夏子】言わないわよ・・・一哉君と約束をして、映画を観に来ただけですもの。")
      (wait)
      (text #:color 5 "【一哉】" 0 "・・・俺と夏子さんは友達なんだそうだ。")
      (wait)
      (text #:color 7 "【" 0 "】友達？")
      (wait)
      (text #:color 5 "【一哉】夏子さんにそう言われたんだよ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】あらら・・・。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【夏子】そうだ、" 0 "君も一緒にどう？")
      (wait)
      (text #:color 5 "【一哉】だめっ！！")
      (wait)
      (text #:color 7 "【" 0 "】って、一哉が言ってるから・・・遠慮しとくよ。")
      (wait)
      (text #:color 2 "【夏子】そう、残念ね。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君って、先負学園で有名なのよね・・・一哉君から話を聞いたけど、びっくりしちゃったわ。")
      (wait)
      (text #:color 5 "【一哉】ようするに、" 0 "は馬鹿って事を言いたかったんだけど・・・妙に受けちゃってさ。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】あのねえ、一哉君ってね・・・けっこう子供っぽいのよ。")
      (wait)
      (text #:color 5 "【一哉】夏子さん・・・頼むから余計な事を言わないでくれよ。")
      (wait)
      (text #:color 2 "【夏子】いいじゃない、" 0 "君は一哉君の友達なんでしょ？")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 1))
     (<>
      (text #:color 2 "【夏子】あのね・・・。")
      (wait)
      (text #:color 5 "【一哉】しーっ！！しーっ！！")
      (wait)
      (text #:color 7 "【" 0 "】これって・・・いちゃついてるのか？")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 8) (== (: 10) 0))
     (<>
      (text #:color 5 "【一哉】ふう・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ・・・夏子さんとデートなのに、元気がないじゃないか。")
      (wait)))
    ((&& (== V 2) (== N 8) (== (: 13) 0))
     (<>
      (text #:color 5 "【一哉】" 0 "・・・ごしょごしょごしょ。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 5 "【一哉】だから・・・。")
      (wait)
      (text #:color 7 "【" 0 "】聞こえないよ。")
      (wait)
      (text #:color 5 "【一哉】だからさ・・・友達って言われたら、もうおしまいか？")
      (wait)
      (text #:color 7 "【" 0 "】おしまいだな。")
      (wait)
      (text #:color 5 "【一哉】お前・・・友達がいがないなあ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 8) (== (: 14) 0))
     (<>
      (text #:color 5 "【一哉】ちくしょ・・・俺はあきらめないぞ。")
      (wait)
      (text #:color 2 "【夏子】何を？")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんの身体を。")
      (wait)
      (text #:color 5 "【一哉】わーーーーーっ！！")
      (wait)
      (text #:color 2 "【夏子】び、びっくりした・・・" 0 "君、なんて言ったの？")
      (wait)
      (text #:color 5 "【一哉】な、何も言ってないよな、な、な？")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 8) (== (: 14) 1))
     (<>
      (text #:color 5 "【一哉】あーあ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】おいおい、元気出せよ・・・。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 7 "【" 0 "】（夏子さんと麦わら帽子か・・・絵になるな。）") (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、奇麗な髪だね。")
      (wait)
      (text #:color 2 "【夏子】ありがとう、" 0 "君。")
      (wait)
      (text #:color 5 "【一哉】こらこら、見つめ合うなっ！！")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 2 "【夏子】" 0 "君、私の顔に何をついてる？")
      (wait)
      (text #:color 7 "【" 0 "】ついてますよ・・・世界一美しい微笑みが。")
      (wait)
      (text #:color 5 "【一哉】お前・・・照れないで、よくそんな言葉をスラスラ言えるな。")
      (wait)
      (text #:color 7 "【" 0 "】一哉とは踏んでる場数が違うぜ。")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】（胸の谷間だぜ・・・一哉がここに顔を埋める日は、永遠に来ないような気がする。）")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 5) (== (: 23) 1))
     (<> (text #:color 5 "【一哉】" 0 "・・・夏子さんをいやらしい目で見るな。") (wait)))
    ((&& (== V 1) (== N 6) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・。）")
      (wait)
      (text #:color 2 "【夏子】？？？")
      (wait)
      (text #:color 5 "【一哉】夏子さん・・・こいつは目で犯すやつだから、気をつけた方がいいよ。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 6) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・俺の手で、思いっきりグニョグニョしたい。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんだぜ・・・一哉がかなう相手じゃないな。）")
      (wait)
      (text #:color 5 "【一哉】" 0 "・・・何を考えてんだ？")
      (wait)
      (text #:color 7 "【" 0 "】いやあ、夏子さんと一哉ってピッタリのカップルだなって。")
      (wait)
      (text #:color 5 "【一哉】お前・・・いいやつだなあ。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 7) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】（夏子さん・・・奇麗な人だ。）") (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】一哉・・・茶色の毛糸のかつらか？")
      (wait)
      (text #:color 5 "【一哉】ノー・コメントだ。")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】（一哉のやつ・・・困った顔をしてるぜ。）")
      (wait)
      (text #:color 5 "【一哉】あーあ・・・夏子さんと一緒だと、どうして" 0 "に会うんだ？")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 7 "【" 0 "】なあ・・・。")
      (wait)
      (text #:color 5 "【一哉】癖なんだ・・・悪いか？")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】一哉、八百屋でバイトか？")
      (wait)
      (text #:color 2 "【夏子】あはははは。")
      (wait)
      (text #:color 5 "【一哉】うるさいなあ・・・いいんだよ、気に入って買ったんだから。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 12) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】（一哉のやつ、困ったような緊張してるような・・・限りなくスクランブルな表情だな。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))