(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\は
  #\る
  #\。
  #\ち
  #\っ
  #\な
  #\、
  #\て
  #\う
  #\ん
  #\か
  #\に
  #\の
  #\た
  #\ゃ
  #\を
  #\（
  #\ー
  #\）
  #\だ
  #\し
  #\が
  #\と
  #\わ
  #\？
  #\ま
  #\よ
  #\あ
  #\り
  #\じ
  #\見
  #\え
  #\れ
  #\ら
  #\入
  #\こ
  #\く
  #\も
  #\ね
  #\中
  #\け
  #\日
  #\君
  #\お
  #\ょ
  #\で
  #\そ
  #\ス)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "n21.pd8")
 (proc 24)
 (set-arr~ @ 6 1)
 (image "n10.pd8")
 (proc 16)
 (set-arr~ @ 6 1)
 (image "n10an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "n10.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 6)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "n10.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 465) 0)
   (<>
    (text #:color 3 "【ちはる】" 0 "君！！")
    (wait)
    (text #:color 7 "【" 0 "】（おお・・・この間とイメージがまったく違うぞ。）")
    (wait)
    (if (== T 1500)
      (<>
       (text #:color 3 "【ちはる】すごいわ・・・時間にぴったりじゃない。")
       (wait)
       (text #:color 7 "【" 0 "】ははは、こう見えても俺は約束を守る男なんだ。")
       (wait)
       (set-reg: 114 (+ (: 114) 1))))
    (if (> T 1500)
      (<>
       (text #:color 3 "【ちはる】遅刻よ、" 0 "君。")
       (wait)
       (text #:color 7 "【" 0 "】ははは、悪い悪い・・・電車が込んじゃって。")
       (wait)
       (text #:color 3 "【ちはる】関係ないじゃない・・・待ってる間、３人の男の人にナンパされちゃったわ。")
       (wait)
       (text #:color 7 "【" 0 "】いやあ、ちはるちゃんはかわいいから。")
       (wait)
       (text #:color 3 "【ちはる】まったく反省してないわね・・・もう。")
       (wait)))
    (text #:color 3 "【ちはる】早く映画館の中に入りましょ・・・込んでなければいいけど。")
    (wait)
    (text #:color 7 "【" 0 "】平日だから大丈夫だよ。")
    (wait)
    (text #:color 3 "【ちはる】そうか、前に彼氏といつも日曜日にデートしてたから・・・今日は水曜日だったわね。")
    (wait)
    (text #:color 7 "【" 0 "】あのね、前の彼氏じゃないからね・・・俺は。")
    (wait)
    (set-reg: 465 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "切符を買う") (text "中に入る") (text "やめる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 3 "【ちはる】" 0 "君、今日は私がおごってあげる。")
         (wait)
         (text #:color 7 "【" 0 "】え？")
         (wait)
         (text #:color 3 "【ちはる】お茶おごってもらったし、私が見たい映画を見る訳だから。")
         (wait)
         (text #:color 7 "【" 0 "】へえ・・・けっこう義理がたいんだな。")
         (wait)
         (set-reg: 470 1)
         (set-var N 22)
         (slot 1 3)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【ちはる】" 0 "君、中に入るって・・・チケットを持ってるの？")
         (wait)
         (text #:color 7 "【" 0 "】いいや。")
         (wait)
         (text #:color 3 "【ちはる】じゃあ、入れないじゃない。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 3 "【ちはる】映画・・・見たくないの？")
         (wait)
         (text #:color 7 "【" 0 "】そんな事はないさ。")
         (wait)
         (text #:color 3 "【ちはる】じゃあ、チケットを買って中に入りましょうよ。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】へえ・・・ちはるちゃんって、スーツを着ると大人っぽいな。")
      (wait)
      (text #:color 3 "【ちはる】スーツを着るなんてひさしぶりだわ・・・なんだか緊張しちゃう。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 3 "【ちはる】ねえ、中に入らないの？")
      (wait)
      (text #:color 7 "【" 0 "】そうだよな・・・ついつい見とれちゃって。")
      (wait)
      (text #:color 3 "【ちはる】上手ねえ、口だけは。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1))
     (<> (text #:color 3 "【ちはる】きっと面白いわよ・・・早く中に入りましょう。") (wait)))
    ((&& (== V 1) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん、服装が違うと髪型まで大人っぽく見えるぜ。）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】（かすかに風になびいてる・・・。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 13) 0))
     (<> (text #:color 7 "【" 0 "】（ちょっと微笑んでるような・・・？）") (wait) (set-reg: 13 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】（かわいいなあ・・・ちょっと寂しそうな笑顔がまたいいなあ。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん、スーツを着ててこの盛り上り方をするって事は・・・けっこう大きいかもしれない。）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 4) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】（うーん・・・触ってみたい。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】あれれ・・・どうして本を持ってるの？")
      (wait)
      (text #:color 3 "【ちはる】矢吹町に来たついでに、欲しい本を買っただけよ。")
      (wait)
      (text #:color 7 "【" 0 "】『仮面夫婦』とか？")
      (wait)
      (text #:color 3 "【ちはる】読まないわよ、そんな本。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 5) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（本だな・・・どうでもいいや。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（手を前に組む女性は、警戒心が強い・・・うーん。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 6) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（ちはるちゃんって、警戒心が強いのかな？）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（スカートが短いぜ・・ひっひっひっ。）")
      (wait)
      (text #:color 3 "【ちはる】" 0 "君、どこを見てるの？")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 7) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（うーん、ちはるちゃんのスーツ姿は・・・なかなか色っぽいぞ。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))