(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\。
  #\ん
  #\っ
  #\て
  #\の
  #\だ
  #\、
  #\美
  #\穂
  #\ゃ
  #\る
  #\か
  #\に
  #\う
  #\た
  #\ら
  #\？
  #\が
  #\ち
  #\く
  #\し
  #\も
  #\（
  #\！
  #\）
  #\あ
  #\は
  #\を
  #\き
  #\で
  #\れ
  #\と
  #\ろ
  #\ま
  #\君
  #\や
  #\じ
  #\よ
  #\り
  #\ぜ
  #\女
  #\好
  #\事
  #\ど
  #\子
  #\言
  #\そ
  #\つ
  #\け
  #\ね
  #\え
  #\お
  #\す
  #\わ
  #\こ
  #\ー
  #\映
  #\画
  #\俺
  #\さ
  #\ぺ
  #\一
  #\男
  #\ン
  #\せ
  #\人
  #\め
  #\話
  #\合
  #\気
  #\『
  #\』
  #\ス
  #\ょ
  #\み
  #\何
  #\彼
  #\ば
  #\思
  #\時
  #\隣
  #\観
  #\ず
  #\前
  #\見
  #\早
  #\館
  #\緒
  #\私
  #\ぞ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "10.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 6 1)
 (image "m10.pd8")
 (proc 25)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "m10an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "m10.s4" (~ @ 2))
 (animate 0 0 1)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 27)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "m10.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 324) 1)
   (<>
    (text #:color 7 "【" 0 "】この席がいいな・・・スクリーンのまん中だし、近くもなく遠くもなく、ちょうどいいぜ。")
    (wait)
    (text #:color 6 "【美穂】なんだかワクワクしちゃう・・・早く始まらないかなあ。")
    (wait)
    (text #:color 7 "【" 0 "】美穂ちゃんって、子供みたいだなあ。")
    (wait)
    (text #:color 6 "【美穂】だって、いつもビデオばかり観てたから・・・映画館に来るのって久しぶりなんですもの。")
    (wait)
    (text #:color 7 "【" 0 "】美穂ちゃんが喜んでくれると、俺も何だか興奮してきちゃうなあ。")
    (wait)
    (text #:color 6 "【美穂】" 0 "君も興奮してるの？")
    (wait)
    (text #:color 7 "【" 0 "】（けっけっけっ！！美穂ちゃんと暗闇で一緒なんだぜ・・・興奮せずにいられるかいっ！！）")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "寝る") (text "一人で帰る")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】（冗談じゃないっ！！美穂ちゃんと暗闇で一緒なんだぜ！！）")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<> (text #:color 7 "【" 0 "】（寝ないぜ・・・だいたい興奮してて、眠れるものか。）") (wait)))
       ((&& (== N 2) (== (: 11) 0))
        (<>
         (text #:color 7 "【" 0 "】（おいおいっ！！）")
         (wait)
         (text #:color 6 "【美穂】何か言った？")
         (wait)
         (text #:color 7 "【" 0 "】い、いや・・・何も言ってない。")
         (wait)
         (set-reg: 11 1)))
       ((&& (== N 2) (== (: 11) 1))
        (<>
         (text
          #:color
          7
          "【"
          0
          "】（こんなチャンスを目の前にして、一人で帰るなんて・・・ポコチンを切っちまったほうがいいぜ！！）")
         (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 5) (== (: 32) 1))
     (<>
      (text #:color 6 "【美穂】あ・・・。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "m08.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 9)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "m08an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "m08.s4" (~ @ 2))
      (set-arr~ @ 7 0)
      (sound 1)
      (set-var I 44)
      (proc 26)
      (set-reg: 835 0)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【美穂】いや・・・。")
      (wait)
      (text #:color 7 "【" 0 "】喋らないで・・・。")
      (wait)
      (text #:color 6 "【美穂】ん・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・映画が・・・。")
      (wait)
      (text #:color 7 "【" 0 "】好きだ・・・美穂ちゃん・・・。")
      (wait)
      (text #:color 6 "【美穂】あ・・・" 0 "君、何をするの？")
      (wait)
      (text #:color 7 "【" 0 "】いいじゃないか・・・。")
      (wait)
      (text #:color 6 "【美穂】だめ・・・あ・・・。")
      (wait)
      (slot 1 4)
      (mes-jump "m09.mes")))
    ((&& (== V 2) (== N 5) (== (: 25) 0))
     (<>
      (text #:color 6 "【美穂】" 0 "君、思ったよりもすいてるね・・・人気ないのかしら、『思い出どろどろ』って。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・偶然なんじゃないかな。")
      (wait)
      (text #:color 6 "【美穂】でも、すいてる方がいいよね・・・ゆっくり観られる感じがするし。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 2) (== N 5) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】美穂ちゃん、お腹はすいてない？・・・ポップコーンとか買ってこようか？")
      (wait)
      (text
       #:color
       6
       "【美穂】ありがとう・・・でも"
       0
       "君、私に気を使わなくていいから・・・私、"
       0
       "君と一緒に映画を観られるだけでいいの。")
      (wait)
      (text #:color 7 "【" 0 "】（けっこう・・・ドキッとする事を言うなあ。）")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 2) (== N 5) (== (: 27) 0))
     (<>
      (text #:color 6 "【美穂】" 0 "君・・・映画が始まる前に、一つだけ質問していい？")
      (wait)
      (text #:color 7 "【" 0 "】なに？")
      (wait)
      (text #:color 6 "【美穂】私が学校の校門で・・・" 0 "君を待ってた時の事を覚えてる？")
      (wait)
      (text #:color 7 "【" 0 "】ああ、美穂ちゃんは何か言いかけて・・・そのまま走って行った時だろ？")
      (wait)
      (text #:color 6 "【美穂】うん・・・あの時ね、" 0 "君に聞きたい事があったの。")
      (wait)
      (text #:color 7 "【" 0 "】何を？")
      (wait)
      (text #:color 6 "【美穂】" 0 "君って、学校で人気者でしょ？・・・女の子からも注目を浴びてるし。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、良い意味でも・・・悪い意味でもね。")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 2) (== N 5) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】で、聞きたい事ってなんだい？")
      (wait)
      (text #:color 6 "【美穂】あのね、" 0 "君って・・・先負学園の女子生徒から『好き』って言われた事ある？")
      (wait)
      (text #:color 7 "【" 0 "】それは・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ある") (text "ない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】あるよ。")
         (wait)
         (text #:color 6 "【美穂】やっぱり・・・" 0 "君って、隠れファンが多いのよね。")
         (wait)
         (text #:color 7 "【" 0 "】（本当か？・・・そりゃあ、おいしい話だぜ！！）")
         (wait)
         (set-reg: 29 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ないな・・・一度も。")
         (wait)
         (text #:color 6 "【美穂】あのね・・・" 0 "君の事、好きって女の子・・・いっぱいいるのよ。")
         (wait)
         (text #:color 7 "【" 0 "】（本当かよ！？・・・そりゃあおいしい話だぜ！！）")
         (wait)
         (set-reg: 102 (+ (: 102) 1))))
       (else (<>)))
      (set-reg: 28 1)))
    ((&& (== V 2) (== N 5) (== (: 29) 1) (== (: 30) 0))
     (<>
      (text #:color 6 "【美穂】" 0 "君、その女の子から『好き』って言われて・・・なんて答えたのかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃ、決まってるさ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "つき合おう") (text "やだね")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】つき合おうって言ったのさ・・・俺は来るものは拒まない主義なんだ。")
         (wait)
         (text #:color 6 "【美穂】じゃあ・・・" 0 "君って彼女がいるんじゃない。")
         (wait)
         (text #:color 7 "【" 0 "】い、いや・・・今はいないんだ、つまり別れたって事だな。")
         (wait)
         (text #:color 6 "【美穂】なんだ・・・別れちゃったんだ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】やだねっ・・・て、断ったよ。")
         (wait)
         (text #:color 6 "【美穂】女の子・・・泣かなかった？")
         (wait)
         (text #:color 7 "【" 0 "】わからないな・・・走って行っちゃったし。")
         (wait)
         (text #:color 6 "【美穂】女の子から『好き』って言うの・・・すごく勇気がいるのよ。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】好きでもない女の子と、つき合えないだろ？・・・確かに俺はスケベだけど、自分の好みの女の子だけにスケベなんだぜ。")
         (wait)
         (text #:color 6 "【美穂】うん・・・。")
         (wait)
         (set-reg: 102 (- (: 102) 1))))
       (else (<>)))
      (set-reg: 30 1)))
    ((&& (== V 2) (== N 5) (== (: 29) 0) (== (: 30) 0))
     (<>
      (text #:color 6 "【美穂】あのね・・・もし、" 0 "君の事を好きな女の子がいて。")
      (wait)
      (text #:color 7 "【" 0 "】うんうん。")
      (wait)
      (text #:color 6 "【美穂】『好き』って告白されたら・・・どうする？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "つき合う") (text "断る") (text "わからない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】つき合うさ・・・たぶんね。")
         (wait)
         (text #:color 6 "【美穂】相手がどんな子でも？")
         (wait)
         (text #:color 7 "【" 0 "】ああ、女の子から『好き』って言うなんてよっぽどだぜ。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君の好みじゃなくても？")
         (wait)
         (text #:color 7 "【" 0 "】つき合う。")
         (wait)
         (text #:color 6 "【美穂】変な顔をしてても？")
         (wait)
         (text #:color 7 "【" 0 "】つき合う。")
         (wait)
         (text #:color 6 "【美穂】じゃあ・・・早い者勝ちなんだ。")
         (wait)
         (text #:color 7 "【" 0 "】え？")
         (wait)
         (text #:color 6 "【美穂】ううん・・・何でもない。")
         (wait)
         (set-reg: 102 (+ (: 102) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】断るだろうな。")
         (wait)
         (text #:color 6 "【美穂】・・・どうして？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】俺は、特定の彼女をつくる気がないからさ・・・彼女がいたら、他の女の子にちょっかいを出せないじゃないか。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君って、一人の女の子じゃだめなの？")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・実際に彼女をつくってみないとわからないな。")
         (wait)
         (text #:color 6 "【美穂】・・・そう。")
         (wait)
         (set-reg: 102 (- (: 102) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】わからないよ・・・相手によるんじゃないか？")
         (wait)
         (text #:color 6 "【美穂】そうよね・・・告白してくれた女の子が、" 0 "君の好みじゃなかったら、やっぱりいやだもんね。")
         (wait)
         (text #:color 7 "【" 0 "】ねえねえ、俺の事を好きな女の子って誰？")
         (wait)
         (text #:color 6 "【美穂】言えない・・・そんな事。")
         (wait)
         (text #:color 7 "【" 0 "】（ちぇっ・・・教えてくれれば映画を観たあと、その子の家に飛んで行くのにな。）")
         (wait)))
       (else (<>)))
      (set-reg: 30 1)))
    ((&& (== V 2) (== N 5) (== (: 31) 0))
     (<>
      (text #:color 7 "【" 0 "】美穂ちゃんって・・・彼氏がいるの？")
      (wait)
      (text #:color 6 "【美穂】前に言わなかった？・・・いたら、" 0 "君と一緒に映画館にいないと思うけど。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、そりゃそうだ・・・でも、美穂ちゃんくらいかわいかったら、すぐに彼氏ができると思うぜ。")
      (wait)
      (text #:color 6 "【美穂】私だって・・・好きな人ぐらいいるよ。")
      (wait)
      (text #:color 7 "【" 0 "】へえ、なんてぜいたくな男だ・・・どんなやつ？")
      (wait)
      (text #:color 6 "【美穂】元気な人。")
      (wait)
      (text #:color 7 "【" 0 "】元気なやつって、けっこうバカなんだぜ・・・やめた方がいいよ、うん、絶対にやめた方がいい。")
      (wait)
      (text #:color 6 "【美穂】あのね・・・美沙ちゃんからもそう言われたの。")
      (wait)
      (text #:color 7 "【" 0 "】美沙も知ってる男なんだ・・・いったい誰だろ？")
      (wait)
      (text #:color 6 "【美穂】そんな事・・・言えないもん。")
      (wait)
      (set-reg: 31 1)))
    ((&& (== V 2) (== N 5) (== (: 32) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（ちくしょう・・・全然色っぽい話にならないし、『キスしていい？』って聞くほど俺はマヌケじゃないし。）")
      (wait)
      (text #:color 7 "【" 0 "】（こうなったら、口先だけで勝負してやる・・・くどいて、くどいて、くどきまくってやるぜ。）")
      (wait)
      (text #:color 6 "【美穂】どうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】美穂ちゃん・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "好きだ") (text "大嫌いだ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】好きだ・・・。")
         (wait)
         (text #:color 6 "【美穂】え？")
         (wait)
         (text #:color 7 "【" 0 "】ずっと美穂ちゃんの事が好きだったんだ・・・。")
         (wait)
         (text #:color 6 "【美穂】！？")
         (wait)
         (text #:color 7 "【" 0 "】美穂ちゃん事を考えると、胸が苦しくなる・・・こんな気持ち、生まれて初めてなんだ。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君・・・。")
         (wait)
         (set-reg: 102 (+ (: 102) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】大嫌いだ。")
         (wait)
         (text #:color 6 "【美穂】え？")
         (wait)
         (text #:color 7 "【" 0 "】こんなに苦しい思いをさせる美穂ちゃんなんて・・・大嫌いだ。")
         (wait)
         (text #:color 6 "【美穂】！？")
         (wait)
         (text #:color 7 "【" 0 "】美穂ちゃんの事を考えると、胸が苦しくなるんだ・・・嫌いになれたらどんなに楽だろう。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君・・・。")
         (wait)
         (set-reg: 102 (+ (: 102) 2))))
       (else (<>)))
      (text
       #:color
       7
       "【"
       0
       "】朝起きると、必ず美穂ちゃんの笑顔が頭に浮かび・・・夜寝る前には、いつも美穂ちゃんの事を考えてしまう。")
      (wait)
      (text #:color 6 "【美穂】そんな事言われても・・・今まで、一度も言わなかったじゃない。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】恥ずかしくて喋れなかったんだ・・・他の女の子は何ともないのに、美穂ちゃんだと口がうまく動かなくなる。")
      (wait)
      (text #:color 7 "【" 0 "】さっき映画に誘った時、美穂ちゃんに断られてたら・・・俺は死のうと（おいおい！？）思ってたんだ。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・本当に私の事が好きなの？")
      (wait)
      (text #:color 7 "【" 0 "】もちろんさ・・・もう５年も前から、美穂ちゃんだけを見続けていた。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君と初めて会ったのは・・・３年前だったと思う。")
      (wait)
      (text #:color 7 "【" 0 "】お、俺にしてみれば５年に感じられるんだ・・・それだけ内容が濃いって事さ。")
      (wait)
      (text #:color 6 "【美穂】そんな事言われても・・・。")
      (wait)
      (set-reg: 32 1)))
    ((&& (== V 2) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】美穂ちゃん・・・好きだ。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・映画が始まるよ。")
      (wait)
      (text #:color 7 "【" 0 "】好きだ・・・。")
      (wait)
      (text #:color 6 "【美穂】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【美穂】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（この沈黙が欲しかったんだっ！！・・・今がチャンスだぜっ！！）")
      (wait)
      (set-arr~ @ 7 0)
      (load "m10a.a6" 47104)))
    ((&& (== V 2) (== (: 32) 1) (== (: 33) 0))
     (<> (text #:color 7 "【" 0 "】（話をしてる場合か！？）") (wait) (set-reg: 33 1)))
    ((&& (== V 2) (== (: 32) 1) (== (: 33) 1))
     (<> (text #:color 7 "【" 0 "】（必要なのは会話じゃないっ！！）") (wait)))
    ((&& (== V 1) (== (: 32) 1) (== (: 34) 0))
     (<>
      (text #:color 7 "【" 0 "】（きょろきょろしてる時じゃないぞ・・・タイミングが肝心なんだ。）")
      (wait)
      (set-reg: 34 1)))
    ((&& (== V 1) (== (: 32) 1) (== (: 34) 1))
     (<> (text #:color 7 "【" 0 "】（今は見てる時じゃない・・・わかるだろ？）") (wait)))
    ((&& (== V 3) (== (: 32) 1) (== (: 35) 0))
     (<> (text #:color 7 "【" 0 "】（遊んでる場合か！？）") (wait) (set-reg: 35 1)))
    ((&& (== V 3) (== (: 32) 1) (== (: 35) 1))
     (<> (text #:color 7 "【" 0 "】（猫人間なんて、ほっておけっ！！）") (wait)))
    ((&& (== V 10) (== (: 32) 1) (== (: 36) 0))
     (<>
      (text #:color 7 "【" 0 "】（なめるんじゃないっ！！まずは唇を奪うんだっ！！）")
      (wait)
      (set-reg: 36 1)))
    ((&& (== V 10) (== (: 32) 1) (== (: 36) 1))
     (<> (text #:color 7 "【" 0 "】（ぺろぺろは、キスをした後だ・・・。）") (wait)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 7 "【" 0 "】あの・・・。")
      (wait)
      (text #:color 5 "【隣の男】にゃあ？")
      (wait)
      (text #:color 7 "【" 0 "】変わった顔をしてますね。")
      (wait)
      (text #:color 5 "【隣の男】にゃ、にゃ、にゃ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 1))
     (<>
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 7 "【" 0 "】あの・・・。")
      (wait)
      (text #:color 5 "【隣の男】にゃあ？")
      (wait)
      (text #:color 7 "【" 0 "】ヒゲが伸びてますよ。")
      (wait)
      (text #:color 5 "【隣の男】にゃ・・・にゃにゃにゃ、にゃおーん。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】（リボンを見てる場合じゃないだろ・・・会話をいやらしい方向に持ってくんだ、" 0 "。）")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 6) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】（リボンの話題から、ＳＭの話に・・・ちょっと無理があるな。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（美穂ちゃんの髪だ・・・くりくり、ぐるぐる、げろげろパーマだぜ。）")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 7) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】（髪の毛の話題から下の毛の話題に・・・ちょっと極端すぎるぞ。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】（美穂ちゃんだ・・・澄んだ瞳で俺を見ている。）")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】（彼女って、本当に純情な子なんだろうな・・・俺みたいな悪名高い男でも、こうして一緒に映画を観てくれるんだから。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（い、いかん・・・仏心は禁物だぜ。）")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 8) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】（美穂ちゃんだ・・・微笑みながら俺を見てるぜ。）")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、できれば微笑んだ表情のまま、いやらしい事をさせてくれればいいんだが・・・。）")
      (wait)))
    ((&& (== V 10) (== N 9) (== (: 22) 0))
     (<> (text #:color 7 "【" 0 "】（待て・・・まだ早いぜ。）") (wait) (set-reg: 22 1)))
    ((&& (== V 10) (== N 9) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】（だからまだ早いってば・・・あせりは禁物だ。）") (wait)))
    ((&& (== V 10) (== N 10) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】（いきなり首をなめたら・・・彼女は驚いて帰っちゃうぞ。）")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 10) (== N 10) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】（だめだよ・・・まずはキスをしないと。）") (wait)))
    ((&& (== V 1) (== N 11) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】（美穂ちゃんの身体は、俺の物だあっ！！・・・と、言える時がくればいいんだが・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、美穂ちゃんは緊張してるのかな・・・身体が固くなってるようにも見えるぞ。）")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 11) (== (: 24) 1))
     (<>
      (text #:color 7 "【" 0 "】（ああ・・・美穂ちゃんの身体から、お花の匂いがいる。）")
      (wait)
      (text #:color 7 "【" 0 "】くんか、くんか、くんか。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・風邪？")
      (wait)
      (text #:color 7 "【" 0 "】い、いいや。")
      (wait)
      (set-reg: 24 2)))
    ((&& (== V 1) (== N 11) (== (: 24) 2))
     (<> (text #:color 7 "【" 0 "】（美穂ちゃん・・・美穂ちゃん・・・やらせてくれっ！！）") (wait)))
    ((&& (== V 3) (== N 2) (== (: 13) 0))
     (<> (text #:color 7 "【" 0 "】よ、よせよ・・・危ないヤツだぜ、絶対。") (wait) (set-reg: 13 1)))
    ((&& (== V 3) (== N 2) (== (: 13) 1))
     (<>
      (sound 1)
      (set-var I 37)
      (proc 26)
      (set-reg: 835 0)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 5 "【隣の男】にゃあ？")
      (wait)
      (sound 1)
      (set-var I 27)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 7 "【" 0 "】ははは・・・すいません。")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】すいません、『早く人間になりたい』って言ってください。")
      (wait)
      (text #:color 5 "【隣の男】にゃ・・・『にゃにゃにゃ、にゃんにゃんにゃ、にゃにゃにゃに。』")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・５０点てところだな。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 3) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】世の中には、色々なやつがいるもんだ・・・俺もまだ勉強が足りないな。") (wait)))
    ((&& (== V 1) (== N 4) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（ネクタイをしめてるから・・・サラリーマン猫かな？）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 4) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】（うーん、人間だったらいい男っぽいけど・・・残念ながらヤツは猫だぜ。）")
      (wait)
      (text #:color 5 "【隣の男】にゃ？")
      (wait)
      (text #:color 7 "【" 0 "】にゃんでもありません。")
      (wait)))
    ((&& (== V 10) (== N 12) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】ぺろぺろぺろ。")
      (wait)
      (text #:color 4 "【おやじ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】反応のないオヤジだ。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 10) (== N 12) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】ぺろーり、ぺろぺろ。")
      (wait)
      (text #:color 4 "【おやじ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ぺろぺろぺろぺろっ！！")
      (wait)
      (text #:color 4 "【おやじ】もっとやってくれ。")
      (wait)))
    ((&& (== V 1) (== N 13) (== (: 17) 0))
     (<> (text #:color 7 "【" 0 "】知らないやつの頭なんか、どーでもいい。") (wait) (set-reg: 17 1)))
    ((&& (== V 1) (== N 13) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】ただのカボチャ頭だよ・・・映画館の中は、さほど混んでない。") (wait)))
    ((&& (== V 1) (== N 14) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】映画館の中だな・・・真っ暗ではないが、限りなく真っ暗に近いぞ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 14) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】ここは映画館だが・・・最初から映画を観る気なんかないぜ。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))