(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\っ
  #\。
  #\い
  #\ん
  #\、
  #\だ
  #\美
  #\穂
  #\て
  #\な
  #\の
  #\う
  #\に
  #\か
  #\た
  #\ら
  #\を
  #\よ
  #\と
  #\る
  #\は
  #\ち
  #\ゃ
  #\し
  #\！
  #\あ
  #\？
  #\ど
  #\見
  #\が
  #\一
  #\で
  #\さ
  #\く
  #\こ
  #\お
  #\緒
  #\ね
  #\ぜ
  #\ろ
  #\映
  #\も
  #\ー
  #\俺
  #\人
  #\画
  #\そ
  #\け
  #\思
  #\君
  #\れ
  #\り
  #\通
  #\買
  #\え
  #\行
  #\わ
  #\私
  #\き
  #\女
  #\中
  #\や
  #\せ
  #\じ
  #\す
  #\ま
  #\合
  #\言
  #\彼
  #\入
  #\店
  #\め
  #\出
  #\（
  #\）
  #\チ
  #\ン
  #\キ
  #\『
  #\』
  #\当)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "n21.pd8")
 (proc 24)
 (set-arr~ @ 6 1)
 (image "f.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "fan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "f.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 27)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "f.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 323) 0)
   (<>
    (text #:color 6 "【美穂】あ・・・" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】美穂ちゃん・・・一人で映画を見に来たの？")
    (wait)
    (text #:color 6 "【美穂】ううん、そういう訳じゃないけど・・・")
    (if (&& (> T 813) (< T 817))
      (<> (text "お花屋さんのアルバイトも休みだし、暇だから矢吹町に買物に来たの。")))
    (if (< T 814) (<> (text "お花屋さんの店長さんが急用で、お店がお休みになっちゃったから。")))
    (if (> T 816) (<> (text "お花屋さんの店長さんが急用で、お店がお休みになっちゃったから。")))
    (wait)
    (text #:color 7 "【" 0 "】ふーん・・・。")
    (wait)
    (if (&& (== (: 313) 1) (== (: 315) 0))
      (<>
       (text
        #:color
        6
        "【美穂】あの・・・すごく聞きづらいんだけど・・・この間、喫茶店の前で一緒だった人・・・真子先生の妹さんでしょ？")
       (wait)
       (text #:color 7 "【" 0 "】へえ、よく知ってるね・・・彼女とは友達なんだ。")
       (wait)
       (text #:color 6 "【美穂】友達って・・・女の人でもなれるの？")
       (wait)
       (text #:color 7 "【" 0 "】はっはっはっ、俺は特別なのさ。")
       (wait)
       (set-reg: 315 1)))
    (set-reg: 323 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 50) 0) (text "他の場所に行く"))
        (if (== (: 50) 1) (text "切符を買う"))
        (text "中に入る")
        (text "やめる")))
      (cond
       ((== N 1)
        (<> (text #:color 7 "【" 0 "】待てよ・・・せっかく美穂ちゃんと話してるんだぜ。") (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・中に入る為には、まず切符を買わないと。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君、私の切符は自分で買うから・・・。")
         (wait)
         (text #:color 7 "【" 0 "】いいってば・・・俺が誘ったんだから、俺に出さしてくれよ。")
         (wait)
         (text #:color 6 "【美穂】・・・ありがとう。")
         (wait)
         (set-reg: 325 1)
         (set-var N 22)
         (slot 1 3)
         (mes-jump "town1.mes")))
       ((&& (== N 3) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】（中に入るって・・・どうせだったら、美穂ちゃんと一緒に映画を見たいな。）")
         (wait)))
       ((&& (== N 3) (== (: 50) 1))
        (<>
         (text #:color 2 "【おねーさん】チケットをお買い求めください。")
         (wait)
         (text #:color 7 "【" 0 "】ただで入れてくれ。")
         (wait)
         (text #:color 2 "【おねーさん】チケットをお買い求めください。")
         (wait)
         (text #:color 7 "【" 0 "】ちっ。")
         (wait)))
       ((== N 4)
        (<> (text #:color 7 "【" 0 "】（" 0 "、チャンスだぜ・・・ボーッとここに立ってる場合か？）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】美穂ちゃん、買物はすんだの？")
      (wait)
      (text #:color 6 "【美穂】うん、買物って言っても・・・欲しいのがあったら買おうと思ってただけだから。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ、今は暇なんだ。")
      (wait)
      (text #:color 6 "【美穂】今から帰ろうかなって思ってただけ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (cond
       ((== (: 12) 0)
        (<> (text #:color 7 "【" 0 "】美穂ちゃん、よかったら俺と一緒に・・・。") (wait)))
       ((== (: 12) 1) (<> (text #:color 7 "【" 0 "】だ、だからね、俺と一緒に・・・。") (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "キスをしよう") (text "抱き合おう") (text "心中しよう") (text "映画を見よう")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】キスをしようぜ。")
         (wait)
         (text #:color 6 "【美穂】どうして私が、" 0 "君とキスをするの？")
         (wait)
         (text #:color 7 "【" 0 "】そうだよねえ、俺もそう思う。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】抱き合おうぜ・・・ここで。")
         (wait)
         (text #:color 6 "【美穂】どうして私が、" 0 "君と抱き合うの？")
         (wait)
         (text #:color 7 "【" 0 "】そうだよねえ・・・美穂ちゃんの言う通りだ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】心中しよう・・・ああ、俺は何を言ってんだ！？")
         (wait)
         (text #:color 6 "【美穂】" 0 "君、死にたいんだ。")
         (wait)
         (text #:color 7 "【" 0 "】死にたくないっ！！・・・俺は太く長く生きる主義なんだ。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】映画を見ないか？")
         (wait)
         (text #:color 6 "【美穂】映画を・・・" 0 "君と一緒に？")
         (wait)
         (text #:color 7 "【" 0 "】そう。")
         (wait)
         (text #:color 6 "【美穂】だって・・・。")
         (wait)
         (text #:color 7 "【" 0 "】美穂ちゃん暇なんだろ？")
         (wait)
         (text #:color 6 "【美穂】暇だけど・・・。")
         (wait)
         (text #:color 7 "【" 0 "】いいじゃないか、一緒に映画を見よう。")
         (wait)
         (text #:color 6 "【美穂】でも・・・。")
         (wait)
         (set-reg: 11 1)))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】ね、いいだろ？")
      (wait)
      (text #:color 6 "【美穂】えーっ・・・どうしようかなあ。")
      (wait)
      (text #:color 5 "【通行人】いよっ！！こんな時間から、ホテルにでも行くのかい？・・・彼女、困ってるぜ。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "うるさいっ！！") (text "すいません")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】うるせーな、外野は黙ってろっ！！")
         (wait)
         (text #:color 5 "【通行人】なんだとう？・・・こら、誰に口を聞いてるんだよ。")
         (wait)
         (text #:color 7 "【" 0 "】お前だよ。")
         (wait)
         (text #:color 5 "【通行人】けっ、色男ぶりやがって・・・ちょっとこっちに来い。")
         (wait)
         (text #:color 6 "【美穂】あの・・・。")
         (wait)
         (text #:color 5 "【通行人】彼女、かわいいねえ・・・ちょっと彼氏を教育してやるから、そこで待っててくれよ。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君に・・・変な事をしないで、危ないから。")
         (wait)
         (text
          #:color
          5
          "【通行人】くーっ！！いい彼女だねえ・・・こら、ガキっ、こんないい彼女をホテルに連れ込むなんざ、１０年早いんだよっ！！")
         (wait)
         (text #:color 5 "【通行人】よーし、こっちの路地に来いよ・・・たっぷり恥をかかせてやるぜ。")
         (wait)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 37)
         (proc 26)
         (sound 1)
         (set-var I 27)
         (proc 26)
         (set-reg: 835 0)
         (text #:color 7 "【" 0 "】お待たせ、美穂ちゃん・・・ああ、いい運動になった。")
         (wait)
         (text #:color 6 "【美穂】だから言ったのに・・・" 0 "君に変な事をすると危ないって。")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっ！！俺様は、はっきり言って強い。")
         (wait)
         (text #:color 6 "【美穂】あの人、大丈夫？・・・鼻と口から血をたらしてたけど。")
         (wait)
         (text #:color 7 "【" 0 "】平気じゃない？・・・歯が２、３本折れたぐらいだから。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君、ケンカをしちゃだめ。")
         (wait)
         (text #:color 7 "【" 0 "】はーい。")
         (wait)
         (set-reg: 102 (+ (: 102) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】すいません。")
         (wait)
         (text #:color 5 "【通行人】まったく近頃のガキは・・・１０年はえーんだよ、ちっ！！")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 6 "【美穂】変な人だったね。")
         (wait)
         (text #:color 7 "【" 0 "】ほっとけばいいさ。")
         (wait)
         (text #:color 6 "【美穂】" 0 "君、ケンカ強いんだから・・・もっと強く言えばいいのに。")
         (wait)
         (set-reg: 102 (- (: 102) 1))))
       (else (<>)))
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (cond
       ((== (: 15) 0)
        (<>
         (text #:color 7 "【" 0 "】とんだ邪魔が入ったけど・・・ねえ、一緒に映画を見ようよ。")
         (wait)
         (text #:color 6 "【美穂】映画って・・・何を見るの？")
         (wait)
         (text #:color 7 "【" 0 "】そりゃあ、決まってるさ・・・。")
         (wait)))
       ((== (: 15) 1)
        (<> (text #:color 7 "【" 0 "】だからね、俺が美穂ちゃんと一緒に見たい映画は・・・。") (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "思ひ出どろどろ") (text "肉棒の旅立ち") (text "下の毛半次郎")))
      (cond
       ((&& (== N 1) (== (: 15) 0))
        (<>
         (text #:color 7 "【" 0 "】『思ひ出どろどろ』を一緒に見ようぜ。")
         (wait)
         (text #:color 6 "【美穂】あのね・・・私も見たかったの。")
         (wait)
         (text #:color 7 "【" 0 "】ほーら、俺と美穂ちゃんって気が合うんだよ・・・これで一緒に見なかったらバチが当るぜ。")
         (wait)
         (text #:color 6 "【美穂】うん・・・じゃあ一緒に見る。")
         (wait)
         (text #:color 7 "【" 0 "】やったあ！！")
         (wait)
         (set-reg: 14 1)
         (set-reg: 50 1)
         (set-reg: 102 (+ (: 102) 1))))
       ((&& (== N 1) (== (: 15) 1))
        (<>
         (text #:color 7 "【" 0 "】『思ひ出どろどろ』を一緒に見ようぜ。")
         (wait)
         (text #:color 6 "【美穂】あのね・・・私も見たかったの。")
         (wait)
         (text #:color 7 "【" 0 "】ほーら、俺と美穂ちゃんって気が合うんだよ・・・これで一緒に見なかったらバチが当るぜ。")
         (wait)
         (text #:color 6 "【美穂】うん・・・じゃあ一緒に見る。")
         (wait)
         (text #:color 7 "【" 0 "】やったあ！！")
         (wait)
         (set-reg: 14 1)
         (set-reg: 50 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】『愛と肉棒の旅立ち』なんてどう？・・・女の映画だぜ、これは。")
         (wait)
         (text #:color 6 "【美穂】私・・・あまり見たくない。")
         (wait)
         (text #:color 7 "【" 0 "】でしょう？・・・俺も見たいと思ってなかったんだ、本当は。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】『下の毛半次郎』だよ・・・面白いぜ。")
         (wait)
         (text #:color 6 "【美穂】私・・・あまり見たくない。")
         (wait)
         (text #:color 7 "【" 0 "】だろう？・・・こんな映画を美穂ちゃんと一緒に見るなんて、最初から思ってなかったぜ。")
         (wait)))
       (else (<>)))
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 7 "【" 0 "】『思ひ出どろどろ』は・・・一階で上映中だ。")
      (wait)
      (text #:color 6 "【美穂】私・・・男の人と一緒に映画を見るのって初めてなの。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】美穂ちゃんのリボンって・・・本当に似合ってるなあ。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君、ありがとう。")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】かわいい髪型だね・・・世界一かわいいと思うぜ。")
      (wait)
      (text #:color 6 "【美穂】本当に？・・・うれしいな。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】なんてかわいい顔なんだ・・・美穂ちゃんのかわいさは、アイドルタレントよりも上だな。")
      (wait)
      (text #:color 6 "【美穂】私って・・・普通だと思うけど。")
      (wait)
      (text #:color 7 "【" 0 "】普通！？・・・冗談じゃないよ、そんな事を言ったら普通の女どもがかわいそうだ。")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】（美穂ちゃんって・・・首が細いけど、顔が大きいな。）")
      (wait)
      (text #:color 7 "【" 0 "】（はーーっはっはっはっ！！・・・なんて心の中で大笑いしてるなんて、絶対に思いもしないだろう。）")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 7 "【" 0 "】美穂ちゃんの、そのしぐさ・・・すっごくかわいいよ。")
      (wait)
      (text #:color 6 "【美穂】どのしぐさ？")
      (wait)
      (text #:color 7 "【" 0 "】だから・・・その手を顔のところに持ってきて、首を少しかしげてるしぐさ。")
      (wait)
      (text #:color 6 "【美穂】意識してやってるつもりはないけど・・・。")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】（美穂ちゃんだ・・・映画館の中に入ったら、俺の話術で狂わせてやるぜいっ！！）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))