(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\、
  #\な
  #\っ
  #\。
  #\て
  #\の
  #\た
  #\真
  #\子
  #\だ
  #\う
  #\し
  #\る
  #\を
  #\ん
  #\か
  #\ま
  #\も
  #\が
  #\ら
  #\で
  #\は
  #\に
  #\あ
  #\！
  #\？
  #\す
  #\こ
  #\と
  #\よ
  #\生
  #\ふ
  #\わ
  #\け
  #\ー
  #\く
  #\れ
  #\先
  #\ち
  #\ゃ
  #\め
  #\り
  #\ど
  #\そ
  #\君
  #\書
  #\ょ
  #\つ
  #\や
  #\見
  #\ン
  #\え
  #\き
  #\類
  #\モ
  #\み
  #\お
  #\痛
  #\思
  #\じ
  #\事
  #\（
  #\）
  #\尻
  #\手
  #\取
  #\俺
  #\ミ
  #\穴
  #\言
  #\目)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "g04.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "g04an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "g04.s4" (~ @ 2))
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 25)
 (proc 26)
 (set-reg: 836 0)
 (set-arr~ @ 7 0)
 (load "g04.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 253) 0)
   (<>
    (animate 0 8 0)
    (animate 4 8)
    (text #:color 3 "【真子】いったーい！！")
    (wait)
    (text #:color 7 "【" 0 "】いててて・・・び、びっくりしたぜ・・・ぎょっ！？")
    (wait)
    (text #:color 3 "【真子】" 0 "君・・・い、いきなりぶつかって来るんですもの、こっちがびっくりだわ。")
    (wait)
    (text #:color 7 "【" 0 "】だらだらだらだらだらだら・・・さ、際限なくヨダレがたれる、なんて過激なポーズなんだあ！！")
    (wait)
    (text #:color 3 "【真子】書類が宙に舞っちゃったわ・・・お尻は痛いし。")
    (wait)
    (text #:color 7 "【" 0 "】お、起こします、拾います！！")
    (wait)
    (text #:color 3 "【真子】ち、ちょっと待って・・・お尻が痛くて・・・もうちょっとこのままでいいわ。")
    (wait)
    (text #:color 7 "【" 0 "】の、望むところです！！")
    (wait)
    (set-reg: 253 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "助け起こす") (text "書類を拾う")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 3 "【真子】いたたた・・・ま、まだこのままでいいわ。")
         (wait)
         (text #:color 7 "【" 0 "】よっぽど強く、尻モチをついたんだな。")
         (wait)
         (text #:color 3 "【真子】もう・・・骨盤が割れるかと思ったわよ。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】ああ・・・先生の手って、なんて暖かくて柔らかいんだ。")
         (wait)
         (text #:color 3 "【真子】ふう・・・どうもありがとう。")
         (wait)
         (text #:color 3 "【真子】階段や廊下を走っちゃだめよ、" 0 "君。")
         (wait)
         (text #:color 7 "【" 0 "】へーい・・・でもいい物、見れちゃったな。")
         (wait)
         (set-var N 1)
         (set-reg: 330 1)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((&& (== N 2) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】まだ空中に舞ってる・・・スローモーションのようだな。")
         (wait)
         (text #:color 3 "【真子】そう？・・・私には、ストップモーションのように思えるけど。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 2) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】よいしょ、よいしょ・・・ずいぶんとたくさんの書類だな。")
         (wait)
         (text #:color 3 "【真子】あなた達生徒の健康診断書よ・・・来年受験だから、内申書に使うらしいの。")
         (wait)
         (text #:color 7 "【" 0 "】ふーん。")
         (wait)
         (set-reg: 10 2)))
       ((&& (== N 2) (== (: 10) 2))
        (<> (text #:color 7 "【" 0 "】ふうふう・・・けっこう大変だ。") (wait)))
       (else (<>)))))
    ((&&
      (== V 2)
      (== N 1)
      (== (: 11) 2)
      (== (: 15) 1)
      (== (: 16) 1)
      (== (: 50) 0))
     (<>
      (text #:color 3 "【真子】ん・・・やっと痛みが取れたみたい、もう動けそうだわ。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】先生、無理しない方がいいですよ・・・なんだったら、あと２４時間このままでいた方がいいんじゃないですか？")
      (wait)
      (text #:color 3 "【真子】もう平気よ・・・今晩中に、この書類を整理しないといけないから。")
      (wait)
      (text #:color 7 "【" 0 "】忙しいんだなあ・・・真子先生って。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君・・・悪いけど、助け起こしてくれる？")
      (wait)
      (text #:color 7 "【" 0 "】助け起こすって事は・・・先生の手を握って・・・ぐふっ、ぐふふふふっ！！")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生、大丈夫ですか？")
      (wait)
      (text #:color 3 "【真子】大丈夫だけど、お尻が痛いわ。")
      (wait)
      (text #:color 7 "【" 0 "】お尻が痛い？それじゃあ俺が・・・。")
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ナデナデする") (text "モミモミする") (text "穴に指を入れる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】ナデナデしましょうか？")
         (wait)
         (text #:color 3 "【真子】ありがとう・・・でも、このままでいれば治るから。")
         (wait)
         (text #:color 7 "【" 0 "】ちぇっ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】モミモミしましょうか？")
         (wait)
         (text #:color 3 "【真子】ありがとう・・・でも、このままでいれば治るから。")
         (wait)
         (text #:color 7 "【" 0 "】ちぇっ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】穴に指を入れましょうか・・・って、とんでもない事を言ってるな。")
         (wait)
         (text #:color 3 "【真子】穴って・・・どこの穴？")
         (wait)
         (text #:color 7 "【" 0 "】えーと、えーと・・・ぬめぬめ、べたべたした穴。")
         (wait)
         (text #:color 3 "【真子】いいかげんにしないさい。")
         (wait)
         (set-reg: 108 (- (: 108) 1))))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君、猪みたいに階段を降りないで・・・危ないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・夏休みだから誰もいないと思って。")
      (wait)
      (text #:color 3 "【真子】私も書類を持っていたから、よく見えなかったのよ・・・足音だけは聞こえたんだけど。")
      (wait)
      (text #:color 7 "【" 0 "】すいません・・・先生にもしもの事があったら、俺が一生面倒見させていただきますっ！！")
      (wait)
      (text #:color 3 "【真子】ふふふ・・・かわいい事を言うじゃない。")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 2) (== N 1) (== (: 11) 2))
     (<>
      (text #:color 3 "【真子】" 0 "君は・・・怪我はないの？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・俺は頑丈だから。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】髪の毛を見てる場合じゃない・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】でも、奇麗な髪の毛だな・・・柔らかそうで、キラキラ輝いてる。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】フワフワしてる・・・柔らかそうだ。") (wait)))
    ((&& (== V 1) (== N 3) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】痛そうな表情をしてるな・・・悪い事をしてしまったぞ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】真子先生って・・・セックスする時も、こんな顔をするのかな？")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】どんな表情をしても、奇麗な人は奇麗なんだ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】逆に考えれば、汚いやつがどんなにいい表情をしても・・・やっぱり汚いのかな？")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（く、黒いパンティ・・・いや、スキャンティかな？）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】毛がはみ出て・・・ないかな？")
      (wait)
      (text #:color 3 "【真子】毛が・・・何ですって？")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 4) (== (: 14) 1) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（真子先生って・・・黒い下着が好きなんだ。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（下着の中味も真っ黒だったら・・・お茶の間ドッカンだな。）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 4) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】（いやー、思わず拝みたくなっちゃうな・・・パンパン、と。）")
      (wait)
      (text #:color 3 "【真子】" 0 "君、手をたたいて・・・どうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・いや、転んだ拍子に手にゴミが。")
      (wait)))
    ((&& (== V 10) (== N 5) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】" 0 "のザラザラした犬のような舌が、真子先生の白いふとももを丹念になめ上げる。")
      (wait)
      (text #:color 3 "【真子】あっ・・・。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】思わず声をあげる真子先生・・・その目はうるみ、"
       0
       "を見つめる目は、もはや教師の目ではなかった。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・コウコツの顔をして、何をぶつぶつ言ってるの？")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 10) (== N 5) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（なめたい・・・なめたい・・・なめたいっ！！）") (wait)))
    ((&& (== V 10) (== N 6) (== (: 17) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】"
       0
       "は、そっと真子の首筋に舌を這わす・・・真子の熟れた身体は、"
       0
       "が舌を動かすたびに敏感に反応する。")
      (wait)
      (text #:color 3 "【真子】あ・・・んんん・・・。")
      (wait)
      (text #:color 7 "【" 0 "】たまらず、顔をのけぞらせる真子・・・しかし、" 0 "は舌の動きを休めない。")
      (wait)
      (text #:color 3 "【真子】あんっ・・・も、もう我慢てできないわ・・・。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】懇願するような目で、"
       0
       "を見つめる真子・・・"
       0
       "は哀れむような目つきで、ゆっくりとズボンのジッパーを下ろすのであった。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・一人でブツブツ何を言ってるの？")
      (wait)
      (text #:color 7 "【" 0 "】はっ！？・・・い、いかん、白昼夢を見てしまった！？")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 10) (== N 6) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（なめたいけど・・・そんな事をしたら退学だあ。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】ああ・・・このネクタイのように、時間がこのまま止まってしまえ！！")
      (wait)
      (text #:color 7 "【" 0 "】でも・・・見てるだけじゃ、俺の方が欲求不満になっちゃうぞ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 7) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】真子先生のネクタイは、ノリがビシバシにきいているのかな？") (wait)))
    ((&& (== V 1) (== N 8) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生が脚を開いて、淫らなポーズで俺を誘惑してる・・・なんて言ったら怒るだろうなあ。")
      (wait)
      (text #:color 3 "【真子】怒るだろうなあって・・・しっかり聞こえているわよ。")
      (wait)
      (text #:color 7 "【" 0 "】し、しまったあ！！")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 8) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】真子先生だ・・・このまま固めて、家に持って帰りたい。") (wait)))
    ((&& (== V 6) (== N 9) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】ふうふう・・・取っても取っても、減らない書類だな。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 6) (== N 9) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん、不思議だ・・・いくら取っても、まだそこに存在してるぞ。")
      (wait)
      (text #:color 3 "【真子】気のせいよ・・・取った書類は、ちゃんと" 0 "君の手の中にあるじゃない。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))