(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\っ
  #\い
  #\あ
  #\子
  #\真
  #\。
  #\ん
  #\の
  #\【
  #\】
  #\、
  #\う
  #\な
  #\に
  #\る
  #\そ
  #\て
  #\し
  #\は
  #\を
  #\く
  #\よ
  #\か
  #\が
  #\ら
  #\！
  #\だ
  #\も
  #\た
  #\こ
  #\れ
  #\と
  #\き
  #\君
  #\で
  #\先
  #\す
  #\わ
  #\生
  #\り
  #\俺
  #\め
  #\さ
  #\動
  #\じ
  #\感
  #\け
  #\ゃ
  #\つ
  #\夢
  #\ま
  #\ぶ
  #\体
  #\え
  #\分
  #\舌
  #\出
  #\ス
  #\や
  #\見
  #\？
  #\刺
  #\女
  #\強
  #\一
  #\優
  #\今
  #\事
  #\部
  #\言
  #\む
  #\せ
  #\ち
  #\触
  #\覚
  #\目
  #\熱
  #\突
  #\ご)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "g12.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "g12an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "g12.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 55)
 (proc 26)
 (set-reg: 836 0)
 (animate 0 8 1)
 (animate 4 8)
 (set-arr~ @ 7 0)
 (load "g07.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (set-reg: 331 0)
 (if (== (: 604) 1)
   (<>
    (text #:color 3 "【真子】ドアに鍵はかかってるわ・・・誰も入ってこれない。")
    (wait)
    (text #:color 7 "真子先生の肢体が、外の光を受けて白く光っている・・・陰部を隠すゆびの隙間から、淡いかげが見えている。")
    (wait)
    (text #:color 3 "【真子】" 0 "君・・・そこにずっと立っているつもりかしら？")
    (wait)
    (text #:color 7 "そう言うと真子先生は、俺を誘うかのように指を動かす・・・淫らな音が俺の耳を刺激する。")
    (wait)
    (text #:color 3 "【真子】ほら・・・" 0 "君のここ、あなたの鼓動と同じように脈打っているわ。")
    (wait)
    (text #:color 7 "俺は我慢できなくなってきた・・・そう、真子先生が言ったようにこれは夢なのだ。")
    (wait)
    (text #:color 7 "自分で脱いだ下着につまづきそうになりながら、俺は真子先生の肢体に抱きついた。")
    (wait)
    (text #:color 3 "【真子】ああ・・・" 0 "君。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (set-reg: 331 (+ (: 331) 1))
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "悩む")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】（うーん・・・これは現実か、はたまた夢か！？）")
         (wait)
         (text #:color 3 "【真子】" 0 "君・・・どうしたのかしら？")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】（うーん、うーん、うーん・・・。）")
         (wait)
         (text #:color 3 "【真子】" 0 "君・・・手と唇を動かして。")
         (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】んんっ・・・。")
      (wait)
      (text #:color 3 "【真子】" 0 "君の唇・・・暖かいわ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 7) (== N 1) (== (: 10) 1))
     (<> (text #:color 3 "【真子】んんっ・・・ん。") (wait) (set-reg: 10 2)))
    ((&& (== V 7) (== N 1) (== (: 10) 2))
     (<> (text #:color 3 "【真子】上手よ・・・" 0 "君。") (wait)))
    ((&& (== V 10) (== N 2) (== (: 11) 0))
     (<>
      (text #:color 3 "【真子】ああ・・・" 0 "君、イヤリングを食べないでね。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 10) (== N 2) (== (: 11) 1))
     (<>
      (text #:color 3 "【真子】耳はね、女性の性器を連想させるの・・・だから、もっと舌を固くして、耳の穴に・・・そう、そうよ。")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 10) (== N 2) (== (: 11) 2))
     (<> (text #:color 3 "【真子】そう・・・舌を入れたり、出したり・・・ああ、いいわよ、" 0 "君。") (wait)))
    ((&& (== V 7) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 3 "【真子】そうよ・・・キスするのは、唇だけじゃないの。")
      (wait)
      (text #:color 3 "【真子】愛情を込めて・・・そう・・・いとおしむようにキスするの。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 7) (== N 3) (== (: 12) 1))
     (<>
      (text #:color 3 "【真子】あまり強くキスしちゃだめ・・・触れるか、触れないかぐらいが一番いいのよ。")
      (wait)
      (text #:color 3 "【真子】そう・・・そうよ・・・" 0 "君って物覚えがいいのね。")
      (wait)))
    ((&& (== V 8) (== N 4) (== (: 13) 0))
     (<>
      (text #:color 3 "【真子】その女性が好きだったら・・・髪を触りたくなるはずよ。")
      (wait)
      (text #:color 3 "【真子】そう、優しくなでて・・・耳元で優しい言葉をささやくの。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 8) (== N 4) (== (: 13) 1))
     (<> (text #:color 3 "【真子】んんっ・・・そう・・・いい感じだわ。") (wait)))
    ((&& (== V 10) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 3 "【真子】ああっ・・・ん・・・。")
      (wait)
      (text #:color 3 "【真子】そうよ・・・舌の先でつつくように・・・今度は舌全体で、舌からなめあげるように・・・。")
      (wait)
      (text #:color 3 "【真子】ああんっ・・・いいっ・・・いいわ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 10) (== N 5) (== (: 14) 1))
     (<> (text #:color 3 "【真子】んんんっ・・・感じて・・・感じてくるう。") (wait)))
    ((&& (== V 9) (== N 6) (== (: 15) 0))
     (<>
      (text #:color 3 "【真子】胸をもむ時は・・・手の平で包むようにして・・・ん、そうよ。")
      (wait)
      (text #:color 3 "【真子】乳首をなでるように・・・ああっ・・・胸をゆっくりもむの。")
      (wait)
      (text #:color 3 "【真子】ああんっ・・・いいわ・・・。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 9) (== N 6) (== (: 15) 1))
     (<>
      (text #:color 3 "【真子】優しいだけじゃだめ・・・たまに強く・・・痛くないように・・・ああんっ！！")
      (wait)
      (text #:color 3 "【真子】そうよ・・・そう・・・もっと強く・・・まだ痛くないから・・・ああん・・・あんあん。")
      (wait)
      (set-reg: 15 2)))
    ((&& (== V 9) (== N 6) (== (: 15) 2))
     (<>
      (text #:color 3 "【真子】優しく、強くを・・・交互に繰り返して・・・んんんっ・・・そ、そう・・・いいわ、いいの、とってもいい。")
      (wait)))
    ((&& (== V 10) (== N 7) (> (: 331) 14))
     (<>
      (text #:color 3 "【真子】も、もう・・・だめよ・・・んんんっ！！")
      (wait)
      (text #:color 3 "【真子】あああっ・・・" 0 "君・・・じらさないでえ。")
      (wait)
      (set-arr~ @ 7 0)
      (load "g07a.a6" 47104)))
    ((&& (== V 10) (== N 7) (== (: 16) 0))
     (<>
      (text #:color 3 "【真子】いきなりここをなめちゃ駄目よ・・・女の子は恥ずかしいの、ここを見られたり触られたりする事が・・・。")
      (wait)
      (text
       #:color
       3
       "【真子】十分に女の子がリラックスしたら、優しく愛撫するの・・・愛情がなければ・・・そんな事をしちゃ駄目・・・。")
      (wait)
      (text #:color 3 "【真子】優しく・・・そう・・・もっと・・・ああっ・・・だめ・・・。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 10) (== N 7) (== (: 16) 1))
     (<>
      (text #:color 3 "【真子】んんっ・・・舌で・・・一番敏感な部分を・・・ああんっ！！")
      (wait)
      (text #:color 3 "【真子】で、でも・・・経験の少ない女の子は・・・その部分は刺激が強すぎるから・・・あああっ！！")
      (wait)
      (text
       #:color
       3
       "【真子】あまりしつこくしちゃ駄目・・・先生は・・・ああっ・・・色々と経験してるから・・・あんっ・・・平気・・・んんんっ！！")
      (wait)
      (set-reg: 16 2)))
    ((&& (== V 10) (== N 7) (== (: 16) 2))
     (<>
      (text #:color 3 "【真子】あふれる・・・熱いのが・・・あふれてくるわ。")
      (wait)
      (text #:color 3 "【真子】あんっ・・・んああっ・・・いいっ・・・いいっ・・・。")
      (wait)
      (text #:color 3 "【真子】んっ・・・" 0 "君・・・だ、だめよ・・・そんな事をしたら・・・んんっ・・・。")
      (wait)))
    ((&& (== V 12) (== N 7))
     (<>
      (text #:color 3 "【真子】ここじゃいや・・・" 0 "君、こっちに来て。")
      (wait)
      (text #:color 7 "真子先生は、するりと俺の腕の中から抜け出した。")
      (wait)
      (text #:color 3 "【真子】ここの方がもっと刺激的・・・さあ、" 0 "君のもので私を突き刺して。")
      (wait)
      (text #:color 7 "そう言うと真子先生は、白いお尻を俺の方に突き出した・・・蜜のあふれるその部分が、みだらな香りを漂わせる。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "g08.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "g08an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "g08.s4" (~ @ 2))
      (set-arr~ @ 7 0)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 3 "【真子】さあ・・・私を突き刺すのよ。")
      (wait)
      (text #:color 7 "俺は自分のイチモツを手で持つと、彼女の未知の部分に押し当てる・・・。")
      (wait)
      (text #:color 3 "【真子】あっ・・・。")
      (wait)
      (text
       #:color
       7
       "肉は割れ、深く深く飲み込まれていく・・・熱く濡れた内側の感触を俺は全身で感じた・・・そう、この感覚は俺と真子先生が一体になった証なのだ。")
      (wait)
      (text #:color 3 "【真子】こ、こんなの・・・初めて。")
      (wait)
      (text
       #:color
       7
       "真子先生の胸は、ガラスに押し付けられている。幸いこの窓は校庭の裏側に面しているを・・・誰にも見られる心配はないだろう。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・もっと深く・・・突き刺してえ。")
      (wait)
      (text #:color 7 "俺は腰をゆっくりと動かす・・・。")
      (wait)
      (text #:color 3 "【真子】あんっ・・・あっ・・・あっ・・・。")
      (wait)
      (text #:color 7 "そして今度は舌から突き上げるように・・・ぐいぐいと動かす。")
      (wait)
      (text #:color 3 "【真子】ああんっ・・・あっ・・・あっ・・・んんっ！！")
      (wait)
      (text
       #:color
       7
       "真子先生のお尻が、俺の動きと同調するように動く・・・その動きは、知的な真子先生に合わず、とても動物的な感じがする。")
      (wait)
      (text #:color 3 "【真子】ううんっ・・・うんっ・・・す、すごい・・・こんなにいっぱい・・・あああっ！！")
      (wait)
      (text #:color 7 "何が言いたいのか、さっぱりわからない・・・。")
      (wait)
      (text #:color 3 "【真子】ああんっ・・・だめっ・・・だめっ・・・いいっ！！")
      (wait)
      (text #:color 3 "【真子】んんんっ・・・あんんっ・・・いやあっ！！")
      (wait)
      (text #:color 7 "夏だというのに、真子先生の息がガラスに白く光る・・・よっぽど熱い吐息なのだろう。")
      (wait)
      (text #:color 3 "【真子】んんんっ・・・んんんっ・・・あああっ・・・あんあんっ！！")
      (wait)
      (text #:color 7 "真子先生の腰の動きが、俺の動きよりも早くなってきた・・・そのとき俺は、誰かに見られてるような感覚に襲われる。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・ああんっ・・・こ、こんな・・・こんな感じ・・・すごい・・・すごいわあっ！！")
      (wait)
      (text #:color 7 "真子先生の肉壁が、俺のものをしめつける・・・そして誰かに見られてるような感覚が、さらに俺の感覚を興奮させる。")
      (wait)
      (text #:color 3 "【真子】うっ・・・うっ・・・うっ・・・ううっ・・・。")
      (wait)
      (text #:color 7 "ガラスがカタカタ動く音が聞こえる・・しかし、その音も真子先生の歓喜の声にかき消されるようになる。")
      (wait)
      (text #:color 3 "【真子】うあっ・・・うあああっ・・・うあああっ・・・も、もう・・・" 0 "君・・・だめよ・・・。")
      (wait)
      (text #:color 3 "【真子】きて・・・一緒じゃなきゃだめ・・・いい・・・いい？")
      (wait)
      (text #:color 7 "俺の腰の動きが、真子先生の動きに追いつく・・・俺も身体の芯が熱くなり、今にも爆発しそうだ。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・わ、私・・・もう待てない・・・だ、だめえっ！！")
      (wait)
      (text #:color 7 "真子先生の肢体がのけぞり、声にならない声を出す・・・身体が激しくビクビクと揺れる。")
      (wait)
      (text #:color 3 "【真子】っっっっっ・・・。")
      (wait)
      (text #:color 7 "俺はその瞬間、真子先生のお尻に放出していた・・・。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "g01.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 0)
      (text #:color 7 "・・・。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "kuro.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (sound 1)
      (set-var I 29)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・今のは夢・・・二人で一緒に見た夢。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【真子】いいわね、それで？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "夢だ") (text "夢じゃない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】今あった事は・・・夢だ。")
         (wait)
         (text #:color 3 "【真子】そう・・・それでいいの。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いいや・・・これは夢なんかじゃない。")
         (wait)
         (text #:color 3 "【真子】" 0 "君、先生を困らせないで・・・今あった事は全て夢、そう思わなければいけないの。")
         (wait)))
       (else (<>)))
      (text #:color 3 "【真子】さあ、目を開けて・・・廊下に出るのよ。")
      (wait)
      (text #:color 3 "【真子】廊下に一歩出たら・・・" 0 "君は夢からさめる、いい？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【真子】さあ・・・もう行きなさい。")
      (wait)
      (set-reg: 108 (+ (: 108) 5))
      (set-var A 1)
      (proc 13)
      (proc 11)
      (set-var N 3)
      (slot 1 3)
      (mes-jump "gakko1.mes")))
    ((&& (== V 8) (== N 8))
     (<>
      (text #:color 3 "【真子】")
      (set-var S (? 10))
      (if (== S 0) (<> (text "あんっ・・・")))
      (if (== S 1) (<> (text 0 "君・・・")))
      (if (== S 2) (<> (text "んっあっ・・・")))
      (if (== S 3) (<> (text "も、もっと強く・・・")))
      (if (== S 4) (<> (text "ど、どこでそんな事を・・・")))
      (if (== S 5) (<> (text "んんんっ・・・")))
      (if (== S 6) (<> (text "いいわ・・・")))
      (if (== S 7) (<> (text "あはあっ・・・")))
      (if (== S 8) (<> (text "あんっ・・・")))
      (if (== S 9) (<> (text "いいわよ、すごく・・・")))
      (set-var S (? 10))
      (if (== S 0) (<> (text "だ、だめえっ！！")))
      (if (== S 1) (<> (text "熱い・・・。")))
      (if (== S 2) (<> (text "いやいやっ。")))
      (if (== S 3) (<> (text "いい・・・すごくいいわ。")))
      (if (== S 4) (<> (text "あんんっ。")))
      (if (== S 5) (<> (text "あっ、いやあ。")))
      (if (== S 6) (<> (text "ああっ、頭の中が真っ白になる・・・。")))
      (if (== S 7) (<> (text "あはあっ・・・")))
      (if (== S 8) (<> (text "あんっ・・・")))
      (if (== S 9) (<> (text "ううっ・・ん。")))
      (wait)))
    ((&& (== V 12) (== N 9) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】ぶんぶんぶんっ！！")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・振り回さないで。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 12) (== N 9) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】ぶんぶんぶんぶんぶんっ！！")
      (wait)
      (text #:color 3 "【真子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】もうしません。")
      (wait)
      (set-reg: 17 2)))
    ((&& (== V 12) (== N 9) (== (: 17) 2))
     (<> (text #:color 7 "【" 0 "】（よそうぜ・・・真子先生の目つきが危ない。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))