(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\る
  #\な
  #\。
  #\い
  #\く
  #\っ
  #\て
  #\ん
  #\み
  #\の
  #\う
  #\だ
  #\、
  #\し
  #\か
  #\に
  #\た
  #\？
  #\と
  #\ゃ
  #\ち
  #\も
  #\ら
  #\よ
  #\で
  #\あ
  #\は
  #\事
  #\ど
  #\を
  #\一
  #\怒
  #\ま
  #\が
  #\さ
  #\れ
  #\つ
  #\り
  #\き
  #\ね
  #\え
  #\子
  #\話
  #\そ
  #\哉
  #\じ
  #\ー
  #\け
  #\こ
  #\来
  #\生
  #\言
  #\君
  #\学
  #\校
  #\や
  #\俺
  #\ば
  #\ホ
  #\テ
  #\ル
  #\ろ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "18.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "r.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "ran.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "r.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 23)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "18r.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 293) 0)
   (<>
    (text #:color 7 "【" 0 "】くるみちゃん・・・また学校に来たの？")
    (wait)
    (text #:color 6 "【くるみ】うん・・・また真子先生と話しちゃった。")
    (wait)
    (text #:color 7 "【" 0 "】（うーん・・・よっぽど悩んでるのかな？）")
    (wait)
    (set-reg: 293 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（なんか・・・まだ話がありそうだぞ。）") (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 6 "【くるみ】" 0 "さんに話を聞いてもらって、ちょっとすっきりしちゃった。")
         (wait)
         (text #:color 7 "【" 0 "】俺でよければ・・・いつでもいいよ、できれば俺の部屋とかホテルで話をしよう。")
         (wait)
         (text #:color 6 "【くるみ】ううん、立ち話で充分・・・ばいばい。")
         (wait)
         (text #:color 7 "【" 0 "】あ、そう・・・つまんないの。")
         (wait)
         (set-var N 1)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 6 "【くるみ】どこに行くの？")
         (wait)
         (text #:color 7 "【" 0 "】どこにも行かないよ・・・暇だから。")
         (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 1))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃん、これは『門』って言うんだぜ。")
      (wait)
      (text #:color 6 "【くるみ】知ってる。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃん・・・これは塀だよね？")
      (wait)
      (text #:color 6 "【くるみ】壁・・・かしら？")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】電柱だよ・・・知ってる？")
      (wait)
      (text #:color 6 "【くるみ】うん。")
      (wait)
      (text #:color 6 "【くるみ】・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん・・・私の事、バカにしてる。")
      (wait)
      (text #:color 7 "【" 0 "】してない、してない。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】校庭だな・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん・・・落ち着きがない。")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】学校の前の道だ・・・早く道路工事が終ってくれないかな。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さんが住んでる場所だと・・・遠回りになっちゃうのよね。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<> (text #:color 7 "【" 0 "】いい景色・・・とは言えないな。") (wait)))
    ((&& (== V 2) (== N 7) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】そう言えば、学校に来たのにセーラー服を着てないな。")
      (wait)
      (text
       #:color
       6
       "【くるみ】うん・・・学校に来るつもりはなかったんだけど、色々と考えているうちに、真子先生に相談したくなっちゃったの。")
      (wait)
      (text #:color 7 "【" 0 "】一哉の事だろ？")
      (wait)
      (text #:color 6 "【くるみ】うん・・・真子先生と話してると、色々とアドバイスしてくれるから。")
      (wait)
      (text #:color 7 "【" 0 "】真子先生は何だって？")
      (wait)
      (text #:color 6 "【くるみ】うん・・・内緒。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 2) (== N 7) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】ホテルの一件以来、一哉とはどうなんだ・・・うまくいってるんだろ？")
      (wait)
      (text #:color 6 "【くるみ】それがね、変なんだ・・・あまり電話もかかって来ないし。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (text #:color 6 "【くるみ】今度、私の方から一哉君に電話してみよっと。")
      (wait)
      (set-reg: 20 2)))
    ((&& (== V 2) (== N 7) (== (: 20) 2))
     (<>
      (text #:color 6 "【くるみ】一哉君、ちょっと怒っちゃったみたい・・・でも、あんな事ぐらいで怒るなんて子供みたい。")
      (wait)
      (text #:color 7 "【" 0 "】あんな事ぐらいねえ・・・。")
      (wait)
      (text #:color 6 "【くるみ】だってホテルに行こうって事と、触ろうとした事と、キスしようとした事を断っただけだもん。")
      (wait)
      (text #:color 7 "【" 0 "】充分だと思うけど。")
      (wait)
      (set-reg: 20 3)))
    ((&& (== V 2) (== N 7) (== (: 20) 3))
     (<>
      (text #:color 6 "【くるみ】もし" 0 "さんが私の彼氏で・・・同じ事をしたら怒るのかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "怒る") (text "怒らない") (text "無理にでもする")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】怒るだろうな・・・たぶん。")
         (wait)
         (text #:color 6 "【くるみ】どうして？・・・そんな事をしなくても、楽しくつき合えるじゃない。")
         (wait)
         (text #:color 7 "【" 0 "】くるみちゃんは、子供だからわからないんだよ。")
         (wait)
         (text #:color 6 "【くるみ】私・・・子供じゃないもん。")
         (wait)
         (set-reg: 112 (- (: 112) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】怒らないよ・・・まったく怒らない。")
         (wait)
         (text #:color 6 "【くるみ】そうでしょ？・・・一哉君がおかしいのよね。")
         (wait)
         (text #:color 7 "【" 0 "】キスとか、触りたいとか思うけど・・・やっぱり相手の女の子の気持ちを大事にしてやりたいな。")
         (wait)
         (text #:color 6 "【くるみ】" 0 "さんって・・・優しい。")
         (wait)
         (text #:color 7 "【" 0 "】（うーん、俺は嘘つきになってしまったのか？）")
         (wait)
         (set-reg: 112 (+ (: 112) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】怒るも怒らないも・・・無理にやっちゃうからな、俺は。")
         (wait)
         (text #:color 6 "【くるみ】無理にって・・・相手がイヤって言っても？")
         (wait)
         (text #:color 7 "【" 0 "】関係ないね、男の力にはかなわないさ。")
         (wait)
         (text #:color 6 "【くるみ】こわーい。")
         (wait)
         (set-reg: 112 (- (: 112) 1))))
       (else (<>)))
      (set-reg: 20 4)))
    ((&& (== V 2) (== N 7) (== (: 20) 4))
     (<>
      (text #:color 6 "【くるみ】一哉君、まだ怒ってるのかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】大丈夫だよ・・・あいつ、根に持つ性格じゃないしさ。")
      (wait)
      (text #:color 6 "【くるみ】うん・・・だから一哉君が好きなの。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】おさげ髪って言うのか？")
      (wait)
      (text #:color 6 "【くるみ】おさげ髪って言うと、なんだか女学生って感じ・・・嫌いじゃないけど。")
      (wait)))
    ((&& (== V 1) (== N 13))
     (<>
      (text #:color 7 "【" 0 "】俺の事を見つめてる・・・もしかして好きなのかい？")
      (wait)
      (text #:color 6 "【くるみ】嫌いじゃないよ・・・だって、大好きな一哉君の友達だもの。")
      (wait)
      (text #:color 7 "【" 0 "】一番都合のいい答えだな、おい。")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】なめていい？")
      (wait)
      (text #:color 6 "【くるみ】やだあ。")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】なあ・・・一度そのリボンを取った髪型を見せてくれよ。")
      (wait)
      (text #:color 6 "【くるみ】うん・・・。")
      (wait)
      (text #:color 7 "【" 0 "】いつ見せてくれるんだよ。")
      (wait)
      (text #:color 6 "【くるみ】今度ね。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん・・・女ってのは生まれつき、男のあしらい方がＤＮＡに入ってるんじゃないか？）")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ、どうして手を胸のところにもっていってるの？")
      (wait)
      (text #:color 6 "【くるみ】え？・・・別に理由はないけど。")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃんだ・・・ホテルで会って以来だな。")
      (wait)
      (text #:color 6 "【くるみ】あの時は、アセっちゃった・・・ホテルに行くなんて思ってもなかったから。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))