(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\。
  #\な
  #\だ
  #\、
  #\の
  #\ん
  #\て
  #\っ
  #\に
  #\は
  #\る
  #\か
  #\が
  #\く
  #\あ
  #\し
  #\た
  #\こ
  #\う
  #\生
  #\先
  #\も
  #\よ
  #\と
  #\子
  #\？
  #\真
  #\ら
  #\で
  #\を
  #\ー
  #\さ
  #\す
  #\れ
  #\！
  #\美
  #\一
  #\ゃ
  #\み
  #\じ
  #\ま
  #\ス
  #\え
  #\り
  #\俺
  #\談
  #\何
  #\そ
  #\わ
  #\相
  #\け
  #\入
  #\沙
  #\人
  #\ち
  #\哉
  #\『
  #\』
  #\ト
  #\ン
  #\健
  #\室
  #\来
  #\き
  #\事
  #\ば
  #\机
  #\つ
  #\ぞ
  #\穂
  #\君
  #\保
  #\体
  #\上
  #\ッ
  #\寝
  #\書
  #\や
  #\ろ
  #\ど
  #\げ
  #\お
  #\へ
  #\ぜ
  #\見
  #\中
  #\言
  #\今
  #\カ
  #\タ
  #\ポ
  #\ラ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "39.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "39.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 220) 0)
   (<> (text #:color 7 "【" 0 "】あらら・・・誰もいない。") (wait) (set-reg: 220 1)))
  ((&& (== (: 709) 1) (== (: 711) 0) (== (: 712) 0))
   (<>
    (text #:color 7 "【" 0 "】（・・・。）")
    (wait)
    (text #:color 7 "【" 0 "】（美沙を一人にしてやろう・・・それが男の優しさってもんだ。）")
    (wait)
    (set-var N 3)
    (slot 1 3)
    (mes-jump "gakko1.mes")))
  ((&& (== (: 334) 1) (== (: 341) 0) (== (: 324) 0))
   (<>
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "m.pd8")
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "man.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "m.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 27)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 6 "【美穂】あ・・・。")
    (wait)
    (text #:color 7 "【" 0 "】あれれ！？・・・美穂ちゃん。")
    (wait)
    (text #:color 6 "【美穂】" 0 "君、夏休みなのに・・・どうして保健室に来るの？")
    (wait)
    (text #:color 7 "【" 0 "】俺は・・・真子先生に用があってさ。")
    (wait)
    (text #:color 6 "【美穂】なんだ、私と同じなんだ・・・。")
    (wait)
    (text #:color 7 "【" 0 "】美穂ちゃんも真子先生に用があるんだ・・・わかった、身体に関するの相談でしょ？")
    (wait)
    (text #:color 7 "【" 0 "】水くさいなあ、俺が相談に乗ってあげるから・・・ね？")
    (wait)
    (text #:color 6 "【美穂】" 0 "君じゃ相談できない事なの・・・ばいばい。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "39.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 19)
    (proc 26)
    (set-reg: 836 1)
    (text #:color 7 "【" 0 "】うーん・・・行ってしまった。")
    (wait)
    (set-reg: 341 1)))
  ((&& (== (: 150) 1) (== (: 342) 0) (== (: 481) 0) (> H 810))
   (<>
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "i.pd8")
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "ran.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "r.s4" (~ @ 2))
    (animate 0 0 1)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 5 "【一哉】わあっ！！")
    (wait)
    (text #:color 7 "【" 0 "】お、驚かすなよ。")
    (wait)
    (text #:color 5 "【一哉】へっへっへっ、" 0 "も真子先生に会いに来たんだろ？")
    (wait)
    (text #:color 7 "【" 0 "】まあ・・・な。")
    (wait)
    (text #:color 5 "【一哉】いないぜ、真子先生・・・美沙から保健室にいるって聞いたんだけど。")
    (wait)
    (text #:color 7 "【" 0 "】机の下を見たか？")
    (wait)
    (text #:color 5 "【一哉】机の下？")
    (wait)
    (text #:color 7 "【" 0 "】引き出しの中は？")
    (wait)
    (text #:color 5 "【一哉】俺はな、大切な相談があってここに来たんだ・・・" 0 "と冗談を言い合う為じゃないぜ。")
    (wait)
    (text #:color 5 "【一哉】真子先生がいないんじゃ、ここにいても仕方がないな・・・" 0 "、これからどこかに遊びに行かないか？")
    (wait)
    (text #:color 7 "【" 0 "】一哉、俺はこの夏休みを女一色にしたいんだ。")
    (wait)
    (text #:color 5 "【一哉】わかってるよ、終業式の時から言ってたもんな・・・じゃあな、" 0 "！！")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "39.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ちぇっ、みんな何かと理由をつけて、真子先生に会いに来るんだよな。")
    (wait)
    (set-reg: 342 1)))
  ((&& (== (: 271) 1) (== (: 343) 0) (== (: 685) 0))
   (<>
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "l.pd8")
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "lan.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "l.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 28)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 3 "【美沙】真子先生？")
    (wait)
    (text #:color 7 "【" 0 "】そうよ。")
    (wait)
    (text #:color 3 "【美沙】何が『そうよ』だ・・・そんな野太い声の真子先生がいるかよ。")
    (wait)
    (text #:color 7 "【" 0 "】はっはっはっ、生理用品でも貰いに来たのか？")
    (wait)
    (text #:color 3 "【美沙】" 0 "、下品だぞ。")
    (wait)
    (text #:color 7 "【" 0 "】悪い、悪い、美沙はもう上がっちゃったんだよな。")
    (wait)
    (sound 1)
    (set-var I 37)
    (proc 26)
    (set-reg: 836 0)
    (text #:color 6 "ドシュッ！！")
    (wait)
    (text #:color 7 "【" 0 "】いったーい。")
    (wait)
    (text #:color 3 "【美沙】じゃあな、" 0 "・・・今度下品な事を言ったら、顔の形を変えてやる。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "39.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 19)
    (proc 26)
    (set-reg: 836 1)
    (text #:color 7 "【" 0 "】いててて・・・乱暴だなあ。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】美沙は・・・保健室で何をしてたんだろ？")
    (wait)
    (set-reg: 343 1)))
  ((&& (== (: 317) 1) (== (: 344) 0) (== (: 412) 0))
   (<>
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "p.pd8")
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "pan.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "p.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 42)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】さ、さとみ！？・・・い、いつ死んだんだ！？")
    (wait)
    (text #:color 6 "【さとみ】はあ？")
    (wait)
    (text #:color 7 "【" 0 "】さとみは、喫茶店にいるはずだ・・・きっと毒入りのコーヒーでも飲んで息絶えたに違いない。")
    (wait)
    (text #:color 6 "【さとみ】" 0 "・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ははあ、わかったぞ・・・さてはお前、さとみの皮をかぶった偽者だな。")
    (wait)
    (text #:color 6 "【さとみ】じゃあね、" 0 "・・・せっかく店を抜けて来たのに、真子先生いないんだもん。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "39.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 19)
    (proc 26)
    (set-reg: 836 1)
    (text #:color 7 "【" 0 "】待てっ！！偽者のさとみっ！！・・・俺が服を脱がして正体を暴いてやるっ！！")
    (wait)
    (text #:color 7 "【" 0 "】はあはあはあ。")
    (wait)
    (text #:color 7 "【" 0 "】はあはあはあ。")
    (wait)
    (text #:color 7 "【" 0 "】・・・俺って馬鹿？")
    (wait)
    (set-reg: 344 1)))
  ((&& (== (: 333) 1) (== (: 345) 0) (== (: 641) 0))
   (<>
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "c.pd8")
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "can.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "c.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 60)
    (proc 26)
    (set-reg: 836 0)
    (text #:color 6 "【よしこ】あら、" 0 "君・・・怪我でもしたの？")
    (wait)
    (text #:color 7 "【" 0 "】真子先生、心の中が傷だらけです・・・先生の暖かい手で、僕の心の傷を癒してください。")
    (wait)
    (text #:color 6 "【よしこ】" 0 "君、私は斎藤先生じゃないわよ。")
    (wait)
    (text #:color 7 "【" 0 "】あれ？・・・どうりで声が違うと思った。")
    (wait)
    (text #:color 6 "【よしこ】言われないと気づかないの？・・・もう、ぼーっとしてるんだから。")
    (wait)
    (text #:color 7 "【" 0 "】はっはっはっ、芹沢先生こそ・・・ここは保健室だよ、職員室じゃないぜ。")
    (wait)
    (text #:color 6 "【よしこ】わかっています・・・斎藤先生とお話がしたくて来ただけです。")
    (wait)
    (text #:color 7 "【" 0 "】へえ・・・先生同士で相談もするんだ、知らなかった。")
    (wait)
    (text #:color 6 "【よしこ】" 0 "君、相談する内容はもちろん生徒の事です・・・個人の事を斎藤先生に相談する訳がありません。")
    (wait)
    (text #:color 7 "【" 0 "】じゃあ個人の事は、僕が相談にのってあげましょう。")
    (wait)
    (text #:color 6 "【よしこ】さようなら、" 0 "君。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "39.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 19)
    (proc 26)
    (set-reg: 836 1)
    (text #:color 7 "【" 0 "】遠慮しなくていいですよ・・・何でも相談にのりましょう。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ちっ、誰もいない。")
    (wait)
    (set-reg: 345 1)))
  ((== (: 220) 1)
   (<> (text #:color 7 "【" 0 "】ここは先負学園の保健室だ・・・誰もいないな。") (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・真子先生がいなければ、ここにいても仕方がないぞ。")
         (wait)
         (set-var N 3)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】保健室で居眠りでもするのか？")
         (wait)
         (text #:color 7 "【" 0 "】どうせ寝るんだったら、自分の部屋で寝よう・・・寝過ごして学校に閉じ込められたら大変だ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】ここに立っていよう・・・何か起こるかな？")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】何も起こらない気がする。")
         (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】これはついたてだな・・・この向こう側には、ベットが並んでいるんだ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 1) (== N 1) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】だからついたてだってば・・・入口から、ベットに寝てる人が見えないようにする物だ。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】色々な器具が入ってる・・・残念ながら『電動コケシ』はないぞ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 2) (== (: 11) 1))
     (<>
      (text #:color 7 "【" 0 "】よくある薬や器具ばかりだな・・・胃薬、鎮痛剤、風邪薬、湿布薬、体温計、血圧計に、カン腸！？")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】体重計だ・・・ずいぶんと古いタイプだな。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 3) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】俺の体重は５６キロだ・・・スポーツをしない割には、まったく太らないぞ。") (wait)))
    ((&& (== V 1) (== N 4) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】ありがちなポスターだな・・・『健康の源となる、バランスのとれた食事』のポスターだ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 4) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】ポスター通りの食生活をしている人は・・・地球上に何人いるだろう？")
      (wait)
      (text #:color 7 "【" 0 "】一人もいなかったりして・・・ははは。")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】この視力検査のポスターも、単なる飾りだな・・・今は顕微鏡みたいな器具で検査するんだ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 5) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】懐かしいな・・・一番上の文字が見えない人は、『一歩前へ』って言われるんだぜ。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】ゴミ箱だ・・・中に何が入っているのかな？")
      (wait)
      (text #:color 7 "【" 0 "】まさか、真子先生の口紅をふいたティッシュとか・・・真子先生がかんだ鼻紙とか・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なんだ・・・何も入ってないじゃないか。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 6) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】ゴミ箱だ・・・中には何も入ってない。")
      (wait)
      (text #:color 7 "【" 0 "】残念だ。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 16) 0))
     (<> (text #:color 7 "【" 0 "】ベットだな・・・当然、誰も寝てないぞ。") (wait) (set-reg: 16 1)))
    ((&& (== V 1) (== N 7) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】このベットで、真子先生と一緒に寝たい・・・なんて夢のような話しだぜ。") (wait)))
    ((&& (== V 1) (== N 8) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】くんくんくんくんくんくん。")
      (wait)
      (text #:color 7 "【" 0 "】くんくんくんくんくんくん。")
      (wait)
      (text #:color 7 "【" 0 "】くんくんくんくんくんくん。")
      (wait)
      (text #:color 7 "【" 0 "】真子先生が座ってた椅子だ・・・ついつい匂いをかいでしまった。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 8) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】くんくんくんくんくんくん・・・。")
      (wait)
      (text #:color 7 "【" 0 "】いいかげんにしよう。")
      (wait)
      (text #:color 7 "【" 0 "】くんくんくん。")
      (wait)
      (text #:color 7 "【" 0 "】今度こそ、いいかげんにしよう。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生がいれば、この机すらブリリアントに見えてしまうのに・・・今はただの鉄の塊だな。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 9) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】真子先生が使ってる机だな・・・。") (wait)))
    ((&& (== V 1) (== N 10) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】このケースには、色々な書類が入ってるようだ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】真子先生に迷惑がかかるから、この書類を触るのはよそう。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・俺は真子先生に対してだけ、純情な少年になってしまうなあ。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 10) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】ガラスケースだ・・・書類が入ってる。") (wait)))
    ((&& (== V 1) (== N 11) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】小さなカレンダーが壁にかけてある・・・真子先生の予定が書き込まれてるようだ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、デートの予定はないようだ・・・もっとも、これに書き込むとは思えないが。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 11) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】小さなカレンダーだ・・・。") (wait)))
    ((&& (== V 1) (== N 12) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生の机の上には、本が乗っている・・・。")
      (wait)
      (text #:color 7 "【" 0 "】『思春期の生理学』『ティーンエイジの性行動』『身体の悩みお答え集』・・・。")
      (wait)
      (text #:color 7 "【" 0 "】さすが・・・俺達の事を親身になって考えているなあ。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 12) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】机の上の本には、俺達に対する愛情があふれている。") (wait)))
    ((&& (== V 1) (== N 13) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】普通のデスクライトだが・・・真子先生が使ってると思うと、すごくおシャレな物に見えてくる。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 13) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】デスクライトだ・・・小さく『真子』と名前が書いてあるぞ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・かわいい。")
      (wait)))
    ((&& (== V 1) (== N 14) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】カーテンだな・・・机の裏にあるから、閉めるときが大変そうだ。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 14) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】カーテンだ・・・この柄は、真子先生の趣味なのかな？") (wait)))
    ((&& (== V 1) (== N 15) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】窓の外は校庭だな・・・陸上部が練習をしている。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 15) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】ガラスも奇麗にみがかれている・・・真子先生は奇麗好きなんだ。") (wait)))
    ((&& (== V 1) (== N 16) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】蛍光灯だ・・・今は明るいから、電気はついてない。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 16) (== (: 24) 1))
     (<>
      (text #:color 7 "【" 0 "】蛍光灯だな・・・端のほうが少しだけ黒くなっている。")
      (wait)
      (text #:color 7 "【" 0 "】ケチ校長め、取り替えてあげればいいのに・・・ちっ。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))