(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\子
  #\。
  #\い
  #\真
  #\な
  #\の
  #\、
  #\は
  #\う
  #\て
  #\っ
  #\に
  #\か
  #\し
  #\た
  #\ん
  #\？
  #\だ
  #\君
  #\ら
  #\る
  #\も
  #\よ
  #\あ
  #\が
  #\と
  #\わ
  #\で
  #\を
  #\事
  #\こ
  #\そ
  #\ね
  #\ま
  #\生
  #\く
  #\先
  #\ど
  #\え
  #\れ
  #\さ
  #\ち
  #\き
  #\ゃ
  #\（
  #\）
  #\ょ
  #\日
  #\り
  #\何
  #\じ
  #\す
  #\け
  #\ぜ
  #\言
  #\来
  #\亜
  #\俺
  #\女
  #\人
  #\用
  #\今
  #\気
  #\つ
  #\私
  #\や
  #\時
  #\み
  #\好
  #\見
  #\ー
  #\せ
  #\ふ
  #\ば
  #\大
  #\目
  #\！
  #\美
  #\会
  #\思
  #\め
  #\沙
  #\ろ
  #\彼
  #\ッ
  #\ト
  #\考
  #\男
  #\話
  #\休
  #\健
  #\夢
  #\１
  #\年
  #\学
  #\夏
  #\一
  #\ご
  #\行
  #\ず
  #\本
  #\当
  #\ク
  #\ぼ
  #\少
  #\コ
  #\ン)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (if (== (: 708) 1) (<> (set-reg: 668 1)))
 (if (== (: 695) 1) (<> (set-reg: 694 1)))
 (set-reg: 674 0)
 (if (== (: 664) 1) (<> (set-reg: 669 (+ (: 669) 1))))
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "39.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 6 1)
 (image "g.pd8")
 (proc 25)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "tan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "t.s4" (~ @ 2))
 (animate 0 0 1)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 25)
 (proc 26)
 (set-reg: 836 0)
 (set-arr~ @ 7 0)
 (load "g.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((&& (== (: 690) 1) (== (: 692) 0))
   (<>
    (text #:color 3 "【真子】まあ・・・どうしたの？")
    (wait)
    (text #:color 7 "【" 0 "】ぜいぜいぜいぜいぜいぜい。")
    (wait)
    (text #:color 3 "【美沙】" 0 "・・・いいかげんに降ろせよ。")
    (wait)
    (text #:color 7 "【" 0 "】ふうふうふうふうふうふう。")
    (wait)
    (text #:color 3 "【真子】" 0 "君・・・汗びっしょりよ。")
    (wait)
    (text #:color 3 "【美沙】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ぜいぜいぜい・・・美沙が膝に怪我を。")
    (wait)
    (text #:color 3 "【真子】美沙さんが？・・・ちょっと見せてごらんなさい。")
    (wait)
    (text #:color 7 "【" 0 "】ぜいぜいぜいぜいぜい。")
    (wait)
    (text #:color 7 "【" 0 "】はあはあはあはあはあ。")
    (wait)
    (text #:color 3 "【真子】" 0 "君・・・あなたはもういいわよ。")
    (wait)
    (text #:color 7 "【" 0 "】え？・・・はあはあはあ。")
    (wait)
    (text #:color 3 "【真子】彼女の怪我を見るから・・・男の子はあっちに行ってなさい。")
    (wait)
    (set-reg: 692 1)
    (set-var N 3)
    (slot 1 3)
    (mes-jump "gakko1.mes")))
  ((&& (== (: 692) 1) (== (: 693) 0))
   (<>
    (text #:color 3 "【真子】" 0 "君・・・何度言ったらわかるの？")
    (wait)
    (text #:color 7 "【" 0 "】美沙は？")
    (wait)
    (text #:color 3 "【真子】ベットで横になってるわ・・・まだ消毒もしてないから。")
    (wait)
    (text #:color 7 "【" 0 "】へえ・・・きょろきょろきょろ。")
    (wait)
    (text #:color 3 "【真子】" 0 "君、外に出てなさい。")
    (wait)
    (set-var N 3)
    (slot 1 3)
    (mes-jump "gakko1.mes")))
  ((&& (== (: 693) 1) (== (: 694) 0))
   (<>
    (text #:color 3 "【真子】あら、" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】美沙は・・・どうだったの？")
    (wait)
    (text #:color 3 "【真子】大した怪我じゃないわ・・・消毒をすませて、さっき帰ったばかり。")
    (wait)
    (text #:color 7 "【" 0 "】そうか・・・。")
    (wait)
    (text #:color 3 "【真子】それよりも問題なのは・・・。")
    (wait)
    (text #:color 7 "【" 0 "】え？")
    (wait)
    (text #:color 3 "【真子】い、いえ・・・何でもないわ。")
    (wait)
    (set-reg: 694 1)))
  ((&& (== (: 711) 1) (== (: 712) 0))
   (<>
    (text #:color 3 "【真子】" 0 "・・・まだ美沙さんと話をしたいの？")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・もういいかな。")
    (wait)
    (text #:color 3 "【真子】でしょう？・・・後は先生にまかせてておきなさい。")
    (wait)
    (set-var N 3)
    (slot 1 3)
    (mes-jump "gakko1.mes")))
  ((&& (== (: 712) 1) (== (: 713) 0))
   (<>
    (text #:color 3 "【真子】あら、" 0 "君・・・どうしたの？")
    (wait)
    (text #:color 7 "【" 0 "】美沙は？")
    (wait)
    (text #:color 3 "【真子】病院に行ってから、家で休んでるって言ってたわね・・・しばらくは練習も無理でしょうし。")
    (wait)
    (set-reg: 713 1)))
  ((== (: 462) 0)
   (<>
    (text #:color 3 "【真子】あら、" 0 "君じゃない・・・亜子に会った？")
    (wait)
    (text #:color 7 "【" 0 "】うん・・・会った。")
    (wait)
    (text #:color 3 "【真子】あの子もこれで、ちょっと大人になったかもしれないわね・・・" 0 "君もそう思うでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・。")
    (wait)))
  ((&& (== (: 462) 1) (== (: 595) 0))
   (<> (text #:color 3 "【真子】" 0 "君・・・保健室に何か用かしら？") (wait)))
  ((&& (== (: 595) 1) (== (: 596) 0))
   (<>
    (text #:color 7 "【" 0 "】あれれ・・・。")
    (wait)
    (text #:color 3 "【真子】あら、" 0 "君・・・保健室に何か用？")
    (wait)
    (text #:color 7 "【" 0 "】真子先生、今日はもう屋上で考え事はしないの？")
    (wait)
    (text #:color 3 "【真子】もう考えはまとまったわ・・・安心して。")
    (wait)
    (text #:color 7 "【" 0 "】そうか・・・俺を彼氏にする事に決めたんだな、うんうん。")
    (wait)
    (text #:color 3 "【真子】ふふふっ・・・" 0 "君、亜子はどうするの？")
    (wait)
    (text #:color 7 "【" 0 "】亜子さんは、ただの友達。")
    (wait)
    (set-reg: 596 1)))
  ((&& (== (: 604) 1) (== (: 607) 0))
   (<>
    (text #:color 3 "【真子】" 0 "君・・・こんにちは。")
    (wait)
    (text #:color 7 "【" 0 "】こ、こ、こんにちは。")
    (wait)
    (text #:color 3 "【真子】今日もいい天気ね・・・私に何か用かしら？")
    (wait)
    (text #:color 7 "【" 0 "】（うーん、以前とまったく変わらない真子先生が目の前にいる・・・やはりあれは夢だったのかな？）")
    (wait)
    (text #:color 3 "【真子】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】（俺も以前と変わらない態度をとらないと・・・気まずい雰囲気になりそうだな。）")
    (wait)
    (set-reg: 607 1)))
  ((&& (== (: 596) 1) (== H 819))
   (<>
    (text #:color 3 "【真子】あら・・・" 0 "君、今日は８月１９日よ。")
    (wait)
    (text #:color 7 "【" 0 "】はあ？")
    (wait)
    (text #:color 3 "【真子】だから、今日は８月１９日なのよ。")
    (wait)
    (text #:color 7 "【" 0 "】何か・・・特別な日だったかな？")
    (wait)
    (text #:color 3 "【真子】毎日特別な日じゃない・・・１年で８月１９日は今日だけよ。")
    (wait)
    (text #:color 7 "【" 0 "】真子先生の言葉って、たまーにわからない時があるな。")
    (wait)))
  ((&& (== (: 596) 1) (== H 820))
   (<>
    (text #:color 3 "【真子】" 0 "君・・・最近、よく学校に来るわね。")
    (wait)
    (text #:color 7 "【" 0 "】そうかなあ・・・。")
    (wait)
    (text #:color 3 "【真子】夏休みもあと１０日余りね、" 0 "君の事だから宿題には手をつけてないでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・実は、その通りなんだ。")
    (wait)))
  ((&& (== (: 596) 1) (== H 821))
   (<>
    (text #:color 3 "【真子】あら、" 0 "君・・・ここは具合が悪い人と、悩み事がある人が来る場所よ。")
    (wait)
    (text #:color 7 "【" 0 "】どうせ俺は健康だけが取柄の、悩みなんか全然ない脳天気野郎だよ・・・ちっ。")
    (wait)
    (text #:color 3 "【真子】" 0 "君はいつも元気で、くよくよしない性格でしょ？")
    (wait)
    (text #:color 7 "【" 0 "】うーん、同じ事を言ってるんだけど・・・ずいぶんと違うな。")
    (wait)))
  ((&& (== (: 596) 1) (== H 822))
   (<>
    (text #:color 3 "【真子】" 0 "君・・・今日は何の用かしら？")
    (wait)
    (text #:color 7 "【" 0 "】真子先生の彼氏になりたくて・・・。")
    (wait)
    (text #:color 3 "【真子】ふふっ・・・" 0 "君が私だけを好きになれるなら、考えてもいいわよ。")
    (wait)
    (text #:color 7 "【" 0 "】（うーん・・・今の俺にはできそうにないかな？）")
    (wait)))
  ((&& (== (: 596) 1) (== H 823))
   (<>
    (text #:color 3 "【真子】" 0 "君・・・今日も用がないのに来たの？")
    (wait)
    (text #:color 7 "【" 0 "】真子先生の顔を見に来たんです。")
    (wait)
    (text #:color 3 "【真子】うれしいわね・・・でも私は忙しいのよ。")
    (wait)
    (text #:color 7 "【" 0 "】冷たいなあ・・・。")
    (wait)))
  ((&& (== (: 664) 1) (== (: 667) 0) (== (: 668) 0) (== (: 708) 0))
   (<>
    (text #:color 3 "【真子】あら、" 0 "君・・・亜子と河原で会えたの？")
    (wait)
    (text #:color 7 "【" 0 "】いいや、会ってないけど・・・。")
    (wait)
    (text #:color 3 "【真子】そうなの・・・会わなかったのね。")
    (wait)
    (set-reg: 668 1)))
  ((&& (== (: 664) 1) (== (: 667) 1) (== (: 668) 0) (== (: 708) 0))
   (<>
    (text #:color 3 "【真子】あら、" 0 "君・・・亜子と河原で会ったの？")
    (wait)
    (text #:color 7 "【" 0 "】会って・・・色々といじめられた。")
    (wait)
    (text #:color 3 "【真子】" 0 "君って、女の子にいじめられてばかりね・・・よっぽどひどい事をしてるのかしら？。")
    (wait)
    (text #:color 7 "【" 0 "】うっうっうっ・・・真子先生だけには、そんな事を言われたくない。")
    (wait)
    (set-reg: 668 1)))
  ((&& (== (: 596) 1) (> H 824))
   (<>
    (text #:color 3 "【真子】" 0 "君じゃない・・・今日は何の用かしら？")
    (wait)
    (text #:color 7 "【" 0 "】ははは、毎度の事です。")
    (wait)))
  ((== (: 669) 1)
   (<>
    (text #:color 7 "【" 0 "】真子先生・・・いつ来てもここにいるなあ。")
    (wait)
    (text #:color 3 "【真子】私がここにいないと・・・誰かさんがここのベットを、ホテル代わりに使いそうですから。")
    (wait)
    (text #:color 7 "【" 0 "】へえ、そんなやつがいるんだ。")
    (wait)
    (text #:color 3 "【真子】・・・。")
    (wait)))
  ((== (: 669) 2)
   (<>
    (text #:color 3 "【真子】" 0 "君・・・今日はどんなご用？")
    (wait)
    (text #:color 7 "【" 0 "】いつもと同じです・・・つまり、これと言って用がないという事かな。")
    (wait)
    (text #:color 3 "【真子】" 0 "君って、暇のようで暇じゃなさそうだし・・・不思議よね。")
    (wait)))
  ((== (: 669) 3)
   (<>
    (text #:color 3 "【真子】" 0 "君じゃない・・・どうしたの？")
    (wait)
    (text #:color 7 "【" 0 "】真子先生の顔を見に来ました。")
    (wait)
    (text #:color 3 "【真子】学校が始まれば、毎日見れるわよ・・・夏休みの間ぐらい、見なくても平気てしょう？")
    (wait)))
  ((== (: 669) 4)
   (<>
    (text #:color 7 "【" 0 "】真子先生・・・。")
    (wait)
    (text #:color 3 "【真子】" 0 "君・・・本当によくここに来るわね。")
    (wait)
    (text #:color 7 "【" 0 "】はっはっはっ・・・伝書バトと呼んでください。")
    (wait)))
  ((== (: 669) 5)
   (<> (text #:color 3 "【真子】またまた" 0 "君の登場ね・・・たまには、用がある時に来たらどう？") (wait)))
  ((== (: 669) 6)
   (<>
    (text #:color 7 "【" 0 "】真子先生っ！！")
    (wait)
    (text #:color 3 "【真子】" 0 "君・・・びっくりさせないで。")
    (wait)
    (text #:color 7 "【" 0 "】失神したら、そのまま家に持って帰ろうかと思って・・・。")
    (wait)
    (text #:color 3 "【真子】ここはテイクアウトはしてません・・・残念ね。")
    (wait)))
  ((== (: 669) 7)
   (<>
    (text #:color 3 "【真子】" 0 "君って・・・保健室が本当に好きなのね。")
    (wait)
    (text #:color 7 "【" 0 "】やだなあ、俺が好きなのは保健室じゃなくて・・・真子先生だよ。")
    (wait)
    (text #:color 3 "【真子】ありがとう・・・うれしいわ。")
    (wait)))
  ((== (: 669) 8)
   (<>
    (text #:color 3 "【真子】" 0 "君・・・こんにちは。")
    (wait)
    (text #:color 7 "【" 0 "】こんにちは、真子先生。")
    (wait)))
  ((== (: 669) 9)
   (<>
    (text #:color 3 "【真子】" 0 "君・・・さようなら。")
    (wait)
    (text #:color 7 "【" 0 "】え！？・・・どこかに行っちゃうの！？")
    (wait)
    (text #:color 3 "【真子】いいえ、私はここにいますけど。")
    (wait)
    (text #:color 7 "【" 0 "】じゃあどうして、さようならなんだよう。")
    (wait)
    (text #:color 3 "【真子】たまには違う事を言わないと、あきるとかと思って・・・。")
    (wait)))
  ((== (: 669) 10)
   (<>
    (text #:color 3 "【真子】" 0 "君・・・今日も暑いわね。")
    (wait)
    (text #:color 7 "【" 0 "】真子先生、白衣を脱いだら？")
    (wait)
    (text #:color 3 "【真子】そんな事ばかり言ってるから、女の子達が喜ぶんです。")
    (wait)
    (text #:color 7 "【" 0 "】もしかして・・・誉めてる？")
    (wait)))
  ((== (: 669) 11)
   (<>
    (text #:color 3 "【真子】あら、" 0 "君・・・。")
    (wait)
    (text #:color 7 "【" 0 "】真子先生って・・・奇麗だなあ。")
    (wait)
    (text #:color 3 "【真子】ありがとう、" 0 "君も奇麗よ。")
    (wait)
    (text #:color 7 "【" 0 "】え！？")
    (wait)))
  ((== (: 669) 12)
   (<>
    (text #:color 3 "【真子】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】真子・・・先生？")
    (wait)
    (text #:color 3 "【真子】あら・・・" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】どうしたの・・・ぼーっとしちゃって。")
    (wait)
    (text #:color 3 "【真子】ええ、ちょっと考え事をしてたの・・・ごめんなさいね、気がつかなくて。")
    (wait)))
  ((== (: 669) 13)
   (<>
    (text #:color 7 "【" 0 "】真子先生・・・こんにちは。")
    (wait)
    (text #:color 3 "【真子】" 0 "君、あいかわらず元気ね。")
    (wait)))
  ((== (: 669) 14)
   (<>
    (text #:color 7 "【" 0 "】真子先生っ！！")
    (wait)
    (text #:color 3 "【真子】" 0 "君・・・また来たの？")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・。")
    (wait)
    (text #:color 3 "【真子】" 0 "君がここに何回来たか・・・数えたくなってきたわ。")
    (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0) (== (: 462) 0))
        (<> (text #:color 3 "【真子】" 0 "君、せっかく来たんだから・・・もう少しここにいたら？") (wait)))
       ((&& (== N 1) (== (: 50) 1) (== (: 462) 0))
        (<>
         (text #:color 3 "【真子】" 0 "君、女の子を泣かせちゃ駄目よ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、俺は女の子を喜ばす為に存在してるんだぜ・・・。")
         (wait)
         (set-reg: 462 1)
         (set-var N 3)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((== N 1)
        (<>
         (text #:color 3 "【真子】" 0 "君、女の子を泣かせちゃ駄目よ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、俺は女の子を喜ばす為に存在してるんだぜ・・・。")
         (wait)
         (text #:color 3 "【真子】本当に・・・そうよ。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (set-var N 3)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【真子】具合が悪いのなら、ベットを使ってもいいわよ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、俺は大丈夫・・・健康が服を着ているからね。")
         (wait)))
       ((== N 3) (<> (text #:color 7 "【" 0 "】（そうだよ・・・俺はまだここにいたいんだ。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 29) (== (: 462) 0) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、亜子と話をしたの？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "した") (text "しない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】したぜ・・・そんなに長くは話さなかったけど。")
         (wait)
         (text #:color 3 "【真子】そう、ならいいんだけど。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】してないな・・・話す事がなかったからさ。")
         (wait)
         (text #:color 3 "【真子】亜子は" 0 "君と話がしたいみたいよ・・・あの子、" 0 "君の事が好きなんじゃないかしら？")
         (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 0) (== (: 11) 0))
     (<>
      (text #:color 3 "【真子】いいわねえ、" 0 "君ってもてて。")
      (wait)
      (text #:color 7 "【" 0 "】俺、真子先生にもてたいなあ。")
      (wait)
      (text #:color 3 "【真子】亜子の次は、私をものにしようって言うのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】あの・・・まだ亜子さんをものにしたつもりはないけど。")
      (wait)
      (text
       #:color
       3
       "【真子】女に惚れさせたら、ものにしたのも同然なのよ・・・"
       0
       "君って女の子の事はよく知ってると思ったけど？")
      (wait)
      (text #:color 7 "【" 0 "】うーん、まだ勉強不足だなあ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 0) (== (: 12) 0))
     (<>
      (text #:color 3 "【真子】さてと・・・私は仕事の続きをしようかしら？")
      (wait)
      (set-reg: 50 1)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 0) (== (: 12) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君、また何か用？・・・ここにはコンドームはないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・真子先生にそういう事を言われると、とっても辛いなあ。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (< H 820) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】しばらくここにいなかったから・・・生徒達が前にも増して来るのよ。")
      (wait)
      (text #:color 7 "【" 0 "】一哉とか？")
      (wait)
      (text #:color 3 "【真子】一哉君も来たわね・・・彼はくるみちゃんの事で悩んでいるみたい。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (< H 820) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】一哉は、何て言ってたのかな？")
      (wait)
      (text #:color 3 "【真子】生徒の相談事を、他の人に言う訳にいかないでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・そりゃそうだ。")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 820) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君も、よくここに来るわね・・・何か悩み事かしら？")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (text #:color 3 "【真子】まさか、亜子の事じゃないでしょうね。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (< H 820) (== (: 10) 1))
     (<>
      (text #:color 3 "【真子】夏休みって言うのはね、学生にとってすごく大事な時なのよ。")
      (wait)
      (text #:color 3 "【真子】アルバイトや旅行や、彼氏や彼女の事や・・・とにかく色々な経験ができる時だわ。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 821) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君は、ちゃんと経験してる？")
      (wait)
      (text #:color 7 "【" 0 "】ぼちぼちです。")
      (wait)
      (text #:color 3 "【真子】そうね、ぼちぼちなのが一番いいかもしれないわね・・・" 0 "君ってやる事が過激すぎる事があるから。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 821) (== (: 10) 1))
     (<> (text #:color 3 "【真子】" 0 "君、用がなければ仕事をしたいの・・・いい？") (wait)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 822) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生って、どうしてそんなに人気があるんだろ？")
      (wait)
      (text #:color 3 "【真子】人気？")
      (wait)
      (text #:color 7 "【" 0 "】先負学園の生徒達にさ。")
      (wait)
      (text #:color 3 "【真子】人気があるかは知らないけど、私って若い子が大好きよ。")
      (wait)
      (text #:color 7 "【" 0 "】一歩間違えたら、逆ロリコンだな。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、私ってまだ若いのよ・・・そんなにフケて見える？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 822) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】今日は・・・８月の２２日か。")
      (wait)
      (text #:color 3 "【真子】デートの約束でもしてるの？")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 823) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】この間ね、" 0 "君の事を聞かれたわよ・・・彼女がいるのかしらって。")
      (wait)
      (text #:color 7 "【" 0 "】だ、誰？")
      (wait)
      (text #:color 3 "【真子】自分で捜しなさい・・・" 0 "君だったら、すぐにわかるでしょ？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 823) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】女の人って・・・どういう男が好きなんだろ？")
      (wait)
      (text #:color 3 "【真子】人それぞれよ・・・みんな同じだったら、大変な事になるわ。")
      (wait)
      (text #:color 7 "【" 0 "】だってさ、もてる男ともてない男っているじゃない。")
      (wait)
      (text
       #:color
       3
       "【真子】外見でも、性格でも女の子によって違うのよ・・・まあ、俗に言う『いい男』っていうのがいる事は確かだけどね。")
      (wait)
      (set-reg: 10 2)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (== H 823) (== (: 10) 2))
     (<> (text #:color 3 "【真子】" 0 "君、女の子が好きなのはわかるけど・・・傷つけちゃ駄目よ。") (wait)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (> H 824) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、今年の夏休みは充実していた？")
      (wait)
      (text #:color 7 "【" 0 "】充実していたって、まだ終ってないよ・・・。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 462) 1) (> H 824) (== (: 10) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君って・・・少年のような目をしてるわね、そういう目っていいと思うわよ。")
      (wait)
      (text #:color 7 "【" 0 "】俺って、少年のようなポコチンをしてるんだぜ・・・見てみる？")
      (wait)
      (text #:color 3 "【真子】遠慮しとくわ・・・子供のポコチンには興味がないの。")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 669) 1) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君・・・亜子とはどうなっているのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】ねえ、どうなってるんだろう？")
      (wait)
      (text #:color 3 "【真子】私が聞いたのよ・・・もう。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 669) 1) (== (: 10) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君、最後の夏休みも・・・あと少しで終りね。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 669) 2) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、目が赤いわね・・・どうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】貴重な時間を無駄に過ごさないように・・・あまり寝ないようにしてるんだ。")
      (wait)
      (text #:color 3 "【真子】まあ・・・身体に悪いわよ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 669) 2) (== (: 10) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君・・・私に何か用かしら？")
      (wait)
      (text #:color 7 "【" 0 "】うーん、一番困る質問だな・・・。")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 669) 3) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】ねえ・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (cond
       ((== (: 604) 1)
        (<>
         (text #:color 3 "【真子】あの時の事・・・時々思い出すわ。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)))
       ((== (: 604) 0) (<> (text #:color 3 "【真子】う、ううん・・・何でもないわ。") (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 669) 3) (== (: 10) 1))
     (<> (text #:color 3 "【真子】今日も暑いわね・・・いつまでも夏が続きそうだわ。") (wait)))
    ((&& (== V 2) (== N 29) (== (: 669) 4) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、先生は忙しいの・・・用もないのに、ここに来ちゃだめよ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 669) 5) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生って・・・いつからそんなに美人だったの？")
      (wait)
      (text #:color 3 "【真子】生まれた時からよ。")
      (wait)
      (text #:color 7 "【" 0 "】普通、そこまで言う？")
      (wait)
      (text #:color 3 "【真子】いいのよ、自分に自信を持つ事は大事だから・・・ね、" 0 "君もそう思うでしょう？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 669) 6) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】進学や就職の時期が近づくと・・・いま以上に忙しくなりそうだわ。")
      (wait)
      (text #:color 7 "【" 0 "】その時は俺を呼んでくれよ・・・性感マッサージででも、何でもやってあげよう。")
      (wait)
      (text #:color 3 "【真子】掃除、洗濯をやってもらおうかしら・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 669) 7) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、いつも元気そうね・・・元気な秘訣は何なの？")
      (wait)
      (text #:color 7 "【" 0 "】そうだな、よく食べ、よく寝て、よくセックスをする事だ。")
      (wait)
      (text #:color 3 "【真子】最後だけは、私には無理ね・・・。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 669) 8) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】亜子は・・・あなたの事を毎日考えてるわよ。")
      (wait)
      (text #:color 7 "【" 0 "】俺も考えてるよ・・・亜子さんと真子さんと、その他１０名ほど。")
      (wait)
      (text #:color 3 "【真子】なんだか、亜子がかわいそうになってきたわ・・・。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、亜子の事・・・好きなんでしょう？")
      (wait)
      (text #:color 7 "【" 0 "】好きだよ。")
      (wait)
      (text #:color 3 "【真子】" 0 "君の『好き』って、本当に『好き』なのかわからない『好き』だから。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 29) (== (: 10) 1))
     (<>
      (text #:color 3 "【真子】暑いわね・・・本当に。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (cond
       ((== (: 604) 0)
        (<>
         (text #:color 3 "【真子】" 0 "君、来年は社会人なんでしょ？・・・がんばってね。")
         (wait)
         (text #:color 7 "【" 0 "】ずいぶんと唐突な会話だな・・・。")
         (wait)))
       ((== (: 604) 1)
        (<>
         (text #:color 3 "【真子】あの時の事は・・・いい思い出になるかしら。")
         (wait)
         (text #:color 7 "【" 0 "】え？")
         (wait)
         (text #:color 3 "【真子】う、ううん・・・何でもないわ。")
         (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 30) (== (: 11) 0) (== (: 604) 0))
     (<>
      (text #:color 3 "【真子】どうしたの？・・・髪に何かついてる？")
      (wait)
      (text #:color 7 "【" 0 "】いえ、奇麗な髪なんで・・・見とれちゃったんだ。")
      (wait)
      (text #:color 3 "【真子】私には、そんな誉め言葉は通用しないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】ちぇっ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 30) (== (: 11) 1) (== (: 604) 0))
     (<>
      (text #:color 3 "【真子】こんな髪型をしてるとね、学校の校医だなんて言っても信じてもらえない時があるの。")
      (wait)))
    ((&& (== V 1) (== N 30) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（髪の毛を触った事も・・・夢だぞ。）") (wait)))
    ((&& (== V 1) (== N 23) (== (: 12) 0) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】（色っぽいなあ・・・セックスの時は、どんな顔をするのかな？）")
      (wait)
      (text #:color 3 "【真子】" 0 "君の目って・・・少年の目よね。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 3 "【真子】大人になっても、" 0 "君ってその目のままじゃないかしら。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 23) (== (: 12) 1) (== (: 604) 0))
     (<> (text #:color 7 "【" 0 "】（真子先生とキスできたら・・・俺はレベルが上がるかもしれない。）") (wait)))
    ((&& (== V 1) (== N 23) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（顔にキスした事も・・・夢なんだ。）") (wait)))
    ((&& (== V 1) (== N 24) (== (: 13) 0) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】（真子先生の首筋は、大人の色気が漂ってる・・・くんかくんか。）")
      (wait)
      (text #:color 7 "【" 0 "】（漂ってると言っても、匂いがする訳じゃないよな・・・ははは。）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 24) (== (: 13) 1) (== (: 604) 0))
     (<> (text #:color 7 "【" 0 "】（先生の首を想像しただけで、おなにいができそうだ。）") (wait)))
    ((&& (== V 1) (== N 24) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（首を愛撫した事も・・・絶対に夢だったんだ。）") (wait)))
    ((&& (== V 1) (== N 25) (== (: 14) 0) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】（あのネクタイで、先生の胸を縛る・・・うーん。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（い、いかん・・・ポコチンがはれてきそうだ。）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 25) (== (: 14) 1) (== (: 604) 0))
     (<> (text #:color 7 "【" 0 "】（ちょっとラフな感じが大人っぽいぞ。）") (wait)))
    ((&& (== V 1) (== N 25) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（真子先生がネクタイをはずし、服を脱いだ事も・・・夢の中の出来事だ。）") (wait)))
    ((&& (== V 1) (== N 26) (== (: 15) 0) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】（この胸を見た事がある男もいる訳だ・・・ちくしょうっ！！）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 26) (== (: 15) 1) (== (: 604) 0))
     (<>
      (text #:color 3 "【真子】好きよ・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】え！？")
      (wait)
      (text #:color 3 "【真子】胸ばかり見てるから、ちょっとからかっただけ。")
      (wait)))
    ((&& (== V 1) (== N 26) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（胸をもんだ事も、乳首をなめた事も・・・全部夢だ。）") (wait)))
    ((&& (== V 1) (== N 27) (== (: 16) 0) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】（真子先生・・・全生徒の、あこがれの的だ。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 27) (== (: 16) 1) (== (: 604) 0))
     (<> (text #:color 7 "【" 0 "】（亜子さんと、エッチな事をしたら・・・真子先生に嫌われちゃうかな？）") (wait)))
    ((&& (== V 1) (== N 27) (== (: 604) 1))
     (<>
      (text #:color 7 "【" 0 "】（俺と真子先生は・・・何もしてない。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（無理にそう考えてると、心が痛む・・・何故なんだ？）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))