(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\な
  #\子
  #\。
  #\真
  #\の
  #\、
  #\て
  #\る
  #\っ
  #\か
  #\？
  #\し
  #\だ
  #\よ
  #\に
  #\う
  #\た
  #\は
  #\わ
  #\が
  #\ら
  #\ん
  #\あ
  #\を
  #\ね
  #\で
  #\君
  #\も
  #\生
  #\ゃ
  #\こ
  #\と
  #\れ
  #\く
  #\先
  #\そ
  #\人
  #\ど
  #\ま
  #\事
  #\ふ
  #\つ
  #\け
  #\じ
  #\み
  #\見
  #\き
  #\や
  #\女
  #\私
  #\俺
  #\思
  #\え
  #\ー
  #\イ
  #\ル
  #\ょ
  #\ケ
  #\ガ
  #\大
  #\さ
  #\り
  #\奇
  #\麗
  #\ハ
  #\ヒ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "39.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 6 1)
 (image "l07.pd8")
 (proc 25)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 25)
 (proc 26)
 (set-reg: 836 0)
 (set-arr~ @ 7 0)
 (load "l07.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 221) 0)
   (<>
    (text #:color 3 "【真子】あら、" 0 "君・・・夏休みなのに学校に来たの？")
    (wait)
    (text #:color 7 "【" 0 "】真子先生こそ、何をしてるの？")
    (wait)
    (text #:color 3 "【真子】学校の校医ってね、休みの間も忙しいのよ・・・色々と残務もあるし、ほら、陸上部が練習しているでしょ？")
    (wait)
    (text #:color 3 "【真子】いつケガ人がでるかわからないからね・・・夏の大会が終るまで、できるだけここにいる事にしたの。")
    (wait)))
  ((== (: 221) 1)
   (<>
    (text #:color 3 "【真子】" 0 "君じゃない・・・どこかケガしたの？")
    (wait)
    (text #:color 7 "【" 0 "】いや・・・ケガはしてないけど。")
    (wait)
    (text #:color 3 "【真子】ははあ、女の子にひっかかれたとか・・・噛まれたとか？")
    (wait)
    (text #:color 7 "【" 0 "】真子先生に言われると、けっこう傷つくなあ。")
    (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 238) 0))
        (<> (text #:color 7 "【" 0 "】いやだ、まだ行きたくない。") (wait)))
       ((&& (== N 1) (== (: 238) 1))
        (<>
         (text #:color 7 "【" 0 "】行きたくないけど・・・真子先生の邪魔になるし。")
         (wait)
         (text #:color 7 "【" 0 "】仕方がない、他の場所に行くか。")
         (wait)
         (set-reg: 175 1)
         (set-reg: 221 1)
         (set-var N 3)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【真子】ケガをしたなら、いつでも見てあげるわよ・・・入ってらっしゃい。")
         (wait)
         (text #:color 7 "【" 0 "】いや、いいよ・・・ケガなんかしてない。")
         (wait)
         (text #:color 3 "【真子】変な" 0 "君ね・・・顔が赤いわよ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 3 "【真子】どうしたの？・・・私と話しをしたい？")
         (wait)
         (text #:color 7 "【" 0 "】俺は悩みなんかないさ・・・いつも脳天気だから。")
         (wait)
         (text #:color 3 "【真子】" 0 "君がいい子だって事は、私がよく知ってるわよ・・・本当は優しいのよね。")
         (wait)
         (text #:color 7 "【" 0 "】いい子って・・・俺は子供か？")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 221) 0) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】陸上部のみんな、必死で練習してるわね・・・特に３年生は、最後の大会だから。")
      (wait)
      (text #:color 3 "【真子】" 0 "君も最後の夏休みね・・・もう半分過ぎちゃったけど、いい思い出をつくれるといいわね。")
      (wait)
      (text #:color 7 "【" 0 "】思い出ねえ・・・。")
      (wait)
      (text
       #:color
       3
       "【真子】思い出のない学生生活なんて、つまらないわよ・・・未来の人生も大事だけど、過去を懐かしむ事だって必要なんだから。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 221) 0) (== (: 10) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君、あいかわらず女の子を追いかけてるの？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・。")
      (wait)
      (text #:color 3 "【真子】でも、得な性格よねー・・・普通だったら嫌われちゃうのに、" 0 "君の場合は人気があるのよね。")
      (wait)
      (text #:color 7 "【" 0 "】え！？・・・俺って人気があるの！？")
      (wait)
      (set-reg: 238 1)))
    ((&& (== V 2) (== N 1) (== (: 221) 1) (== (: 10) 0))
     (<>
      (text #:color 3 "【真子】今年の夏は暑いわね・・・昨日も、暑さで倒れる生徒が２人ばかりいたのよ。")
      (wait)
      (text #:color 7 "【" 0 "】もしかして、陸上部の男じゃない？")
      (wait)
      (text #:color 3 "【真子】あら、よくわかったわね。")
      (wait)
      (text #:color 7 "【" 0 "】仮病だよ・・・みんな真子先生にかまって欲しいと思ってるんだ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 221) 1) (== (: 10) 1) (== (: 222) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生ってさ・・・彼氏はいるの？")
      (wait)
      (text #:color 3 "【真子】彼氏？・・・いると思う？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いる") (text "いない") (text "俺には関係ない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】いると・・・思う。")
         (wait)
         (text #:color 3 "【真子】じゃあ、いるかもね・・・ふふふ。")
         (wait)
         (text #:color 7 "【" 0 "】なんだそりゃ？・・・答えになってない。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いない・・・かな？")
         (wait)
         (text #:color 3 "【真子】じゃあ、きっといないわよ・・・ふふふ。")
         (wait)
         (text #:color 7 "【" 0 "】なんだそりゃ？・・・答えになってない。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】俺には関係ないから、別にいいよ。")
         (wait)
         (text #:color 3 "【真子】かわいいじゃない、" 0 "君が怒ったような顔をする事はないでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】べ、別に怒ってないさ。")
         (wait)
         (text #:color 3 "【真子】ふふふ・・・関係ないって、" 0 "君が聞いたのよ。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そうだったな。")
         (wait)
         (set-reg: 108 (+ (: 108) 1))))
       (else (<>)))
      (set-reg: 222 1)))
    ((&& (== V 2) (== N 1) (== (: 221) 1) (== (: 10) 1) (== (: 222) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君こそ、彼女がいるんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】いるような・・・いないような。")
      (wait)
      (text #:color 3 "【真子】だめよ、女の子をだましちゃ。")
      (wait)
      (text #:color 7 "【" 0 "】そんな事はしないよう。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 221) 0) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生だ・・・男子生徒のあこがれの的だ。")
      (wait)
      (text #:color 3 "【真子】なに？")
      (wait)
      (text #:color 7 "【" 0 "】い、いや・・・なんでもない。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 2) (== (: 221) 0) (== (: 11) 1))
     (<>
      (text #:color 7 "【" 0 "】これほど白衣の似合う女性は、他にいないだろう。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、言いたい事があるならはっきり言いなさい。")
      (wait)
      (text #:color 7 "【" 0 "】真子先生って、白衣が似合うよね。")
      (wait)
      (text #:color 3 "【真子】やだわ・・・私をナンパするつもり？")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 1) (== N 2) (== (: 221) 0) (== (: 11) 2))
     (<> (text #:color 7 "【" 0 "】真子先生だ・・・。") (wait)))
    ((&& (== V 1) (== N 2) (== (: 221) 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生がいると、この保健室の雰囲気まで違うな・・・。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、そんなに見ないでよ・・・恥ずかしいじゃない。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 2) (== (: 221) 1) (== (: 11) 1))
     (<> (text #:color 7 "【" 0 "】奇麗だな・・・どうしてこんなに奇麗な人が存在するんだろう。") (wait)))
    ((&& (== V 1) (== N 3) (== (: 221) 0) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】美人でスタイルもよくて・・・足も奇麗だ。")
      (wait)
      (text #:color 3 "【真子】こら、どこを見てるの？")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 3) (== (: 221) 0) (== (: 12) 1))
     (<>
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、変な事を想像してるでしょ？")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 221) 1) (== (: 12) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、私の足を見ながら何を考えてるか当ててあげようか？")
      (wait)
      (text #:color 7 "【" 0 "】数学の公式。")
      (wait)
      (text #:color 3 "【真子】保健体育じゃないの？")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 3) (== (: 221) 1) (== (: 12) 1))
     (<>
      (text #:color 3 "【真子】もう・・・そんなに私の足を見たいの？")
      (wait)
      (text #:color 7 "【" 0 "】どうして見てるってわかるんだ？")
      (wait)
      (text #:color 3 "【真子】そんなに見つめられたら、誰だってわかるわよ。")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 221) 0) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】（ああ・・・真子先生のハイヒールで顔を踏まれてみたい。）")
      (wait)
      (text #:color 3 "【真子】" 0 "君、私のハイヒールで顔を踏まれたい・・・なんて考えてないでしょうね。")
      (wait)
      (text #:color 7 "【" 0 "】ぎくうっ！！")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 4) (== (: 221) 0) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】大人の女性じゃないと、ハイヒールは似合わないよな・・・うん。") (wait)))
    ((&& (== V 1) (== N 4) (== (: 221) 1) (== (: 13) 0))
     (<>
      (text #:color 3 "【真子】ハイヒールを履くとね、足が奇麗になるのよ。")
      (wait)
      (text #:color 7 "【" 0 "】俺も履こうかな？")
      (wait)
      (text #:color 3 "【真子】" 0 "君って、そういう趣味ねあったの？・・・初耳だわ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 4) (== (: 221) 1) (== (: 13) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君、ハイヒールは好き？")
      (wait)
      (text #:color 7 "【" 0 "】履いている人が奇麗だったらね。")
      (wait)
      (text #:color 3 "【真子】マセた事を言っちゃって・・・話術だけは大人だわ。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))