(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\の
  #\。
  #\舞
  #\、
  #\て
  #\ん
  #\に
  #\だ
  #\う
  #\っ
  #\か
  #\る
  #\ゃ
  #\？
  #\た
  #\あ
  #\が
  #\ら
  #\し
  #\で
  #\事
  #\も
  #\よ
  #\は
  #\ち
  #\！
  #\こ
  #\じ
  #\と
  #\え
  #\そ
  #\ど
  #\く
  #\れ
  #\け
  #\子
  #\ー
  #\（
  #\）
  #\君
  #\を
  #\わ
  #\真
  #\先
  #\生
  #\俺
  #\ま
  #\お
  #\相
  #\談
  #\言
  #\女
  #\変
  #\き
  #\す
  #\め
  #\私
  #\り
  #\ろ
  #\ね
  #\リ
  #\来
  #\さ
  #\ン
  #\ト
  #\度
  #\見)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "39.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 6 1)
 (image "w.pd8")
 (proc 25)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "wan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "w.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 24)
 (proc 26)
 (set-reg: 836 0)
 (set-arr~ @ 7 0)
 (load "w.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 307) 0)
   (<>
    (text #:color 7 "【" 0 "】舞ちゃん！？")
    (wait)
    (text #:color 3 "【舞】こんにちは、" 0 "君・・・" 0 "君も学校に来てたの？")
    (wait)
    (text #:color 7 "【" 0 "】た、大変だあ！！舞ちゃんが病気だあっ！！保健室にいるなんて・・・ど、どこが悪いの？")
    (wait)
    (text #:color 3 "【舞】お、驚いたあ・・・急に大きな声を出すんですもの。")
    (wait)
    (text #:color 3 "【舞】具合が悪くて保健室に来た訳じゃないのよ・・・真子先生に会いに来たの。")
    (wait)
    (text #:color 7 "【" 0 "】なんだ・・・それじゃあ俺と同じじゃないか。")
    (wait)
    (text #:color 3 "【舞】え？・・・それって、どういう意味かしら？")
    (wait)
    (text #:color 7 "【" 0 "】あ・・・だ、だからあ、俺も真子先生に相談したい事があってさ。")
    (wait)
    (set-reg: 307 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】舞ちゃん・・・まだここにいるだろ？")
         (wait)
         (text #:color 3 "【舞】ええ、もう少し待ってようかな？")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ、俺もまだここにいよっと。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】真子先生も来ないようだし・・・。")
         (wait)
         (text #:color 3 "【舞】そうよね・・・私もお花のお稽古に行かないと。")
         (wait)
         (text #:color 7 "【" 0 "】俺は・・・どこに行こうかな？")
         (wait)
         (text #:color 3 "【舞】変よ、" 0 "君って・・・誰かに聞いてるみたい。")
         (wait)
         (set-var N 3)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【舞】" 0 "君、真子先生はいないわよ。")
         (wait)
         (text #:color 7 "【" 0 "】そうだな・・・。")
         (wait)))
       ((== N 3)
        (<> (text #:color 7 "【" 0 "】同感だ・・・たとえ真子先生がいなくても、俺はここにいたいぞ。") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんは・・・真子先生に何の相談？")
      (wait)
      (text #:color 3 "【舞】え！？・・・う、ううん。")
      (wait)
      (text #:color 7 "【" 0 "】ううん、じゃわからないよ。")
      (wait)
      (text #:color 3 "【舞】そんな事・・・" 0 "君に言える訳がないじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】うっうっうっ・・・それって、俺じゃあ相談相手にならないって事？")
      (wait)
      (text #:color 3 "【舞】違うのよ・・・説明できないけど、それは違うの。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 3 "【舞】" 0 "君は・・・真子先生に何の相談があるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "身体の事") (text "舞の事") (text "勉強の事")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】身体の事で相談があるんだ・・・最近、やたらに夢精が多くてさ。")
         (wait)
         (text #:color 3 "【舞】ムセイ？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】うん、朝になるとパンツがバリバリで・・・ほら、俺って一人暮しをしてるだろ・・・だから洗濯が大変なんだ。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・何の事を言ってるのか、よくわからないわ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】決まってるじゃないか・・・舞ちゃんの事だよ。")
         (wait)
         (text #:color 3 "【舞】私の事？")
         (wait)
         (text #:color 7 "【" 0 "】ああ・・・いくらデートに誘っても、全然『うん』って言ってくれない。")
         (wait)
         (text #:color 3 "【舞】なんだ・・・私と同じだったのね。")
         (wait)
         (text #:color 7 "【" 0 "】え？")
         (wait)
         (text #:color 3 "【舞】う、ううん・・・何でもないの。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】勉強の事でちょっと・・・。")
         (wait)
         (text #:color 3 "【舞】え！？")
         (wait)
         (text #:color 7 "【" 0 "】だからあ、勉強の事で相談があったんだ。")
         (wait)
         (text #:color 3 "【舞】真子先生に・・・勉強の相談をするの？")
         (wait)
         (text #:color 7 "【" 0 "】変かな？")
         (wait)
         (text #:color 3 "【舞】変じゃないけど・・・ちょっと変かしら。")
         (wait)))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん、しつこいようだけどさ・・・俺とデートしようぜ。")
      (wait)
      (text #:color 3 "【舞】うん・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うん、って事は・・・いいって事？")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ねえ・・・一度だけでいいからさ。")
      (wait)
      (text #:color 3 "【舞】私とのデートって・・・一度でおしまいなの？")
      (wait)
      (text #:color 7 "【" 0 "】一度しなけりゃ、二度目はないじゃないか・・・ね？")
      (wait)
      (text #:color 3 "【舞】確かにそうだけど・・・。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】デートっ！！")
      (wait)
      (text #:color 3 "【舞】考えてみる・・・こんな返事じゃだめ？")
      (wait)
      (text #:color 7 "【" 0 "】（まあ・・・断られるよりも、多少は進歩があったかな？）")
      (wait)
      (text #:color 7 "【" 0 "】いや、それでいい・・・考えてくれよ。")
      (wait)
      (text #:color 3 "【舞】うん・・・。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 3 "【舞】真子先生、今日は学校に来ないのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・薬局にいるのかな。")
      (wait)
      (text #:color 3 "【舞】お仕事の邪魔をしたくないから・・・また今度にした方がいいかもしれないわね。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、私お花のお稽古があるから・・・もう行かないと。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 2) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】奇麗な髪・・・まるでシルクのようだ。")
      (wait)
      (text #:color 3 "【舞】私って、柔らかい髪質なの・・・だから朝とか大変なのよ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 2) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】ベスト・オブ・ヘヤーだぜ・・・触ってみたいけど、舞ちゃんだけは冗談でもそんな事はできないんだ。")
      (wait)
      (text #:color 3 "【舞】男の人って・・・髪の毛に触りたがるの？")
      (wait)
      (text #:color 7 "【" 0 "】２５歳以下の女性に限るけど。")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんがしてると、リボンまでも神聖に見えてしまう。")
      (wait)
      (text #:color 3 "【舞】やだ・・・ただのリボンよ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 3) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】かわいいリボンだ・・・俺もリボンになりたい。")
      (wait)
      (text #:color 3 "【舞】え！？・・・紐になりたいって言ったの？")
      (wait)
      (text #:color 7 "【" 0 "】（意味がわかってないのかもしれないけど、すっごい事を言うな・・・。）")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 16) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（かわいいなんて言葉じゃ足りなすぎる・・・うーん、彼女のかわいらしさを形容する言葉が見つからない。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 4) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】見つめていたい・・・ずっと見つめていたい。")
      (wait)
      (text #:color 3 "【舞】子供の頃、よくにらめっこをしたわ・・・あの頃が懐かしくて。")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃん・・・そういう意味で言ったんじゃないぜ。")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】ああ・・・この首に触れる事ができるのは、舞ちゃん以外いないだろうな！？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】いたら、殴っちゃうぞ。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、乱暴はだめよ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 5) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】この首にキスできたら・・・寿命が半分になってもいい！！")
      (wait)
      (text #:color 3 "【舞】" 0 "君が死んだら・・・私・・・。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】（白い肌・・・水泳部なのに、どうしてこんなに白いんだろ？）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 6) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの胸元が少し見えている事は・・・他の女の全裸と同じくらいの価値があるぞ。）")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 19) 0))
     (<> (text #:color 7 "【" 0 "】（駄目だ・・・正視する事ができない。）") (wait) (set-reg: 19 1)))
    ((&& (== V 1) (== N 7) (== (: 19) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（ああ、舞ちゃんにも『おっぱい』があるなんて・・・彼女の存在だけで、血管から血が吹き出しそうなのに！！）")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんのセーラー服だ・・・。）")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】（他の女はゴザでも巻いていればいいんだ・・・セーラー服は、彼女の為だけにある事を法律で決めろっ！！）")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 8) (== (: 20) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（素直で頭もよくて、清潔で上品で・・・それでいて、普通の女の子が持っている魅力を全て兼ね備えてる。）")
      (wait)
      (text #:color 7 "【" 0 "】（ああ・・・他の女どもにしたら、こんな不公平な事はないだろう。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))