(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\な
  #\。
  #\ん
  #\夏
  #\子
  #\う
  #\っ
  #\は
  #\の
  #\、
  #\し
  #\が
  #\て
  #\か
  #\る
  #\も
  #\さ
  #\一
  #\と
  #\ら
  #\た
  #\だ
  #\ね
  #\哉
  #\言
  #\く
  #\よ
  #\わ
  #\を
  #\？
  #\ゃ
  #\君
  #\で
  #\事
  #\に
  #\ち
  #\れ
  #\そ
  #\ど
  #\け
  #\あ
  #\つ
  #\（
  #\）
  #\え
  #\み
  #\方
  #\じ
  #\こ
  #\り
  #\め
  #\き
  #\ぜ
  #\俺
  #\ょ
  #\私)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "52.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "j.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "jan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "j.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 30)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "j.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 488) 0)
   (<>
    (text #:color 7 "【" 0 "】あ・・・夏子さん。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君・・・めずらしい場所で会うわね。")
    (wait)
    (text #:color 7 "【" 0 "】もしかして、一哉から悪い病気をうつされたとか？")
    (wait)
    (text #:color 2 "【夏子】言ってくれるわね・・・残念ながら、病気をうつされるような事はしてないの。")
    (wait)
    (set-reg: 488 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（夏子さんと話がしたい・・・まだここにいようぜ。）") (wait)))
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】じゃあ、夏子さん・・・。")
         (wait)
         (text #:color 2 "【夏子】あのね、" 0 "君・・・。")
         (wait)
         (text #:color 7 "【" 0 "】え？")
         (wait)
         (text #:color 2 "【夏子】ありがとう・・・色々と話を聞いてくれて。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、どうって事ないさ・・・じゃあね！！")
         (wait)
         (set-reg: 109 (+ (: 109) 1))
         (set-var N 6)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 2 "【夏子】あら、" 0 "君も具合が悪いの？")
         (wait)
         (text #:color 7 "【" 0 "】全然っ！！俺は超健康体だから。")
         (wait)))
       ((== N 3)
        (<> (text #:color 7 "【" 0 "】（そうだな・・・夏子さんの顔をずっと見ていたいぞ。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】しかし、びっくりしたよな・・・一哉と一緒の時は。")
      (wait)
      (text #:color 2 "【夏子】あの時ね、偶然とか言ってたでしょ？・・・" 0 "君はわかってると思うけど嘘なのよ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・。")
      (wait)
      (text
       #:color
       2
       "【夏子】ごめんなさいね、嘘をつくつもりはなかったんだけど・・・"
       0
       "君ってくるみちゃんの事も知ってるでしょう？")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・知ってる。")
      (wait)
      (text
       #:color
       2
       "【夏子】でも誤解しないで、アルバイトを辞めたのは一哉君と関係ないからね・・・私と一哉君はつき合ってる訳じゃないのよ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君も・・・一哉君がくるみちゃんと、仲直りした方がいいと思うでしょ？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "もちろん") (text "そんな事はない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】もちろんさ・・・一哉とくるみちゃんは、似合いのカップルだもんな。")
         (wait)
         (text #:color 2 "【夏子】でしょう？・・・私も二人の邪魔をするつもりはないのよ。")
         (wait)))
       ((== N 2)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】そんな事はないさ・・・一哉がくるみちゃんを一番好きで、くるみちゃんも一哉が一番好きなら話は別だけどね。")
         (wait)
         (text #:color 2 "【夏子】一哉君は・・・彼女の事を好きなのよね？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】夏子さん、俺の口からは言えないよ・・・俺は確かにスケベで適当でお喋りだけど、そういう事は直接本人に聞いてみたい方がいい。")
         (wait)
         (text #:color 2 "【夏子】そうよね・・・私もそう思うわ。")
         (wait)))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】正直言うとね、ちょっと困ってるのよ・・・一哉君の事は嫌いじゃないけど、本気になられるとね。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【夏子】一哉君に・・・はっきり言った方がいいのかしら？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "もちろん") (text "そんな事はない") (text "わからない")))
      (cond
       ((== N 1)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】言った方がいいんじゃないか？・・・あいつ、けっこう一途だしさ、その話が後になればなるほど一哉は傷つくぜ。")
         (wait)
         (text #:color 2 "【夏子】そうよね・・・言った方がいいわよね。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いいや、そんな事はないよ・・・言わない方がいいかもしれない。")
         (wait)
         (text #:color 2 "【夏子】どうして？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】だって、そんな事を言われたら一哉が傷つくぜ・・・夏子さんは一哉の事が嫌いじゃないわけだし、もう少し様子を見た方がいいんじゃない？")
         (wait)
         (text #:color 2 "【夏子】そうよね・・・彼ってけっこうナイーブかもね。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】わからないなあ・・・どっちとも言えないよ。")
         (wait)
         (text #:color 2 "【夏子】どうして？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】俺は予知能力がないからね・・・言った方がいいか、言わない方がいいかは自分で決めるしかないと思うけど。")
         (wait)
         (text #:color 2 "【夏子】ええ・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 2 "【夏子】私のせいでくるみちゃんと別れたら・・・後味が悪いわ。")
      (wait)
      (text #:color 7 "【" 0 "】難しく考えすぎだせ、夏子さん。")
      (wait)
      (text #:color 2 "【夏子】え？")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】恋愛なんて簡単に壊れるもんさ、誰のせいでもない・・・夏子さんが一哉を好きだったら、くるみちゃんから奪っちゃえばいいんだ。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君って・・・過激な事を言うわね。")
      (wait)
      (set-reg: 13 1)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 2 "【夏子】一哉君には・・・私が言った事を内緒にしといて。")
      (wait)
      (text #:color 7 "【" 0 "】言わないさ・・・いや、言えないよ。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんだぜ・・・髪の毛を見れば、１００メートル離れてても夏子さんだってわかるぞ。）")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 7 "【" 0 "】（夏なのに、涼しげな顔だな・・・。）") (wait)))
    ((&& (== V 1) (== N 4))
     (<> (text #:color 7 "【" 0 "】（うーん・・・このしぐさが色っぽいんだ。）") (wait)))
    ((&& (== V 1) (== N 5))
     (<> (text #:color 7 "【" 0 "】（うっすらと汗がにじんでいる・・・うーん、なめたい。）") (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 7 "【" 0 "】（この胸のふくらみは・・・一哉の物なのか？）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（違うな・・・俺のもんだ。）")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<> (text #:color 7 "【" 0 "】（夏子さんだ・・・けっこう背が高いぜ。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))