(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\。
  #\い
  #\っ
  #\！
  #\だ
  #\は
  #\ん
  #\う
  #\（
  #\）
  #\二
  #\、
  #\健
  #\の
  #\て
  #\か
  #\舞
  #\に
  #\し
  #\る
  #\ち
  #\あ
  #\ゃ
  #\た
  #\く
  #\？
  #\君
  #\が
  #\よ
  #\や
  #\も
  #\れ
  #\事
  #\を
  #\と
  #\ま
  #\こ
  #\そ
  #\り
  #\ど
  #\で
  #\き
  #\え
  #\じ
  #\つ
  #\ぜ
  #\す
  #\ら
  #\ょ
  #\ろ
  #\僕
  #\俺
  #\め)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "50.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "v14.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 765) 0)
   (<>
    (slot 1 6)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "v15.pd8")
    (proc 16)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】あれ・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】あの二人は・・・。")
    (wait)
    (text #:color 7 "【" 0 "】舞ちゃんと・・・健二！？")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ぬ、ぬ、ぬわんだってえっ！？")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "50.pd8")
    (proc 15)
    (set-arr~ @ 6 1)
    (image "v14.pd8")
    (proc 16)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "v14an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "v14.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (animate 0 8 1)
    (animate 4 8)
    (sound 1)
    (set-var I 24)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】ま、ま、ま、舞ちゃん・・・。")
    (wait)
    (text #:color 3 "【舞】" 0 "・・・君！？")
    (wait)
    (text #:color 4 "【健二】やあ、" 0 "君・・・こんな所で奇遇だな。")
    (wait)
    (text #:color 7 "【" 0 "】そ、そんな・・・。")
    (wait)
    (text #:color 4 "【健二】どうした、" 0 "君・・・震えてるぜ。")
    (wait)
    (text #:color 7 "【" 0 "】（舞ちゃんと健二がラブホテルにいる・・・って事は！？）")
    (wait)
    (text #:color 3 "【舞】・・・。")
    (wait)
    (text #:color 4 "【健二】" 0 "君、震えてるようだな・・・寒いのか？")
    (wait)
    (set-reg: 765 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "泣く") (text "他の場所に行く")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】（ち、ちくしょうっ・・・泣いてたまるかあ。）")
         (wait)
         (text #:color 4 "【健二】おやおや、" 0 "君・・・顔がプルプル震えてるじゃないか。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<> (text #:color 7 "【" 0 "】（泣いてたまるか・・・ちくしょうっ！！）") (wait)))
       ((&& (== N 2) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（か、金縛りにあったように・・・足が動かない！？）") (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】（この状況じゃ・・・どうする事もできないよ。）")
         (wait)
         (text #:color 4 "【健二】やっと行く気になったようだな・・・よかったな舞、邪魔者がいなくなって。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】（帰ろう・・・。）")
         (wait)
         (set-var N 11)
         (slot 1 2)
         (mes-jump "town1.mes")))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃん・・・。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 4 "【健二】よせよ、" 0 "君・・・舞に話しかけても無駄だ。")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 2) (== N 1) (== (: 11) 2))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん・・・。")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・違うの。")
      (wait)
      (text #:color 4 "【健二】おっと、舞・・・こういう場合は何も言わない方がいいぜ。")
      (wait)
      (set-reg: 11 3)))
    ((&& (== V 2) (== N 1) (== (: 11) 3))
     (<>
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（うつむいて・・・何も話してくれない。）")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 11) 3) (== (: 12) 3))
     (<> (text #:color 4 "【健二】邪魔なんだよ、" 0 "君。") (wait) (set-reg: 50 1)))
    ((&& (== V 2) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 4 "【健二】見ての通りだよ、" 0 "君・・・何か質問はあるかい？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ある") (text "ない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】あ、当り前だろ・・・聞きたい事は山ほどあるぜ。")
         (wait)
         (text #:color 4 "【健二】そりゃあ残念だな、僕は何も答えるつもりはないんだ・・・はっはっはっ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ないよ・・・なにも。")
         (wait)
         (text #:color 4 "【健二】そうだろう、そうだろう・・・男は引き際が肝心だからな。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 2) (== (: 12) 1))
     (<>
      (text #:color 4 "【健二】" 0 "君、僕達は忙しいんだ・・・これから色々と話をしないといけないしな。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 4 "【健二】君は、まだここにいるつもりかい？")
      (wait)
      (set-reg: 12 2)))
    ((&& (== V 2) (== N 2) (== (: 12) 2))
     (<>
      (text #:color 4 "【健二】" 0 "君・・・君はこの状況を見て、理解できないほど馬鹿じゃないだろう？")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 4 "【健二】はっきのり言って、君が邪魔だ・・・どこかに行ってくれ。")
      (wait)
      (set-reg: 12 3)))
    ((&& (== V 2) (== N 2) (== (: 12) 3))
     (<>
      (text #:color 4 "【健二】君もわからないやつだな・・・どこかに行ってくれと言ってるんだ。")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 0))
     (<>
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（舞ちゃんは・・・俺と視線を合わせようとしない。）")
      (wait)
      (text #:color 7 "【" 0 "】（どうして舞ちゃんが・・・健二と一緒にいるんだあっ！？）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】（舞ちゃんは・・・うつ向いたままだ。）") (wait)))
    ((&& (== V 3) (== N 4) (== (: 14) 0))
     (<>
      (text #:color 4 "【健二】やめてくれ・・・僕の美貌に傷がつくじゃないか。")
      (wait)
      (text #:color 4 "【健二】暴力なんて恐くはないね・・・" 0 "君もいいかげん、腕力に頼るのはやめたらどうだ？")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 3) (== N 4) (== (: 14) 1))
     (<> (text #:color 4 "【健二】暴力で舞は奪えないぜ・・・はっはっはっ！！") (wait)))
    ((&& (== V 1) (== N 5) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（この奇麗な髪は・・・健二の為のものだったのか！？）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（そ、そんな事は絶対になあいっ！！ないないないっ！！）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 5) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの髪に・・・もう触れる事ができないのか？）")
      (wait)
      (text #:color 7 "【" 0 "】（いやだあっ！！そんな事は絶対にいやだあっ！！やだやだやだっ！！）")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（ちくしょうっ・・・健二の髪をつかんで、引っ張り回してやりたいっ！！）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（そんな事をしたら・・・ますます俺がみじめになるだけか。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 6) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（健二の髪を一本残らず抜いてやりたいぜ・・・ちくしょう。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（なんだよ・・・この手は。）")
      (wait)
      (text #:color 7 "【" 0 "】（肩になんか手をのせて・・・なれなれしいぜ、まったく。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（ようするに、そういう事ができる仲って事か？）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 7) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（ちくしょう・・・今の俺にはどうする事もできないのか？）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】（この胸を・・・健二は・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（あーっ！！考えたくもないっ！！）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 8) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】（遊園地での事は・・・すべて夢だったんだな。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（ちっがーうっ！！あれは現実だあっ！！きっと今が夢なんだっ！！）")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんは俺の目を見ようとしない・・・どうしてなんだ？）")
      (wait)
      (text #:color 7 "【" 0 "】（俺の目を見れないような事をしたのか！？・・・そ、そんな事は絶対に許されないぞおっ！！）")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 9) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんは・・・健二の彼女になってしまったんだ。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（ち、違うっ！！舞ちゃんは健二の彼女なんかじゃなあいっ！！）")
      (wait)))
    ((&& (== V 3) (== N 10) (== (: 20) 0))
     (<>
      (text #:color 4 "【健二】なんだ・・・拳を握りしめて。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 4 "【健二】僕は・・・暴力なんか恐くないぞ。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 3) (== N 10) (== (: 20) 1))
     (<> (text #:color 4 "【健二】ふっ・・・僕を殴れば、君がみじめになるだけだ。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))