(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\る
  #\い
  #\。
  #\っ
  #\く
  #\一
  #\哉
  #\、
  #\の
  #\ん
  #\だ
  #\て
  #\は
  #\か
  #\み
  #\う
  #\ら
  #\に
  #\し
  #\？
  #\た
  #\も
  #\よ
  #\を
  #\あ
  #\れ
  #\と
  #\が
  #\や
  #\こ
  #\事
  #\俺
  #\わ
  #\！
  #\で
  #\ち
  #\言
  #\そ
  #\ゃ
  #\さ
  #\す
  #\お
  #\ぜ
  #\き
  #\君
  #\じ
  #\り
  #\ど
  #\け
  #\人
  #\ー
  #\何
  #\見
  #\ね
  #\行
  #\気
  #\テ
  #\ょ
  #\所
  #\来
  #\ろ
  #\え
  #\入
  #\め
  #\ま
  #\ホ
  #\ル
  #\ひ
  #\ほ
  #\場
  #\持)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "50.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "i.pd8")
 (proc 16)
 (set-arr~ @ 6 1)
 (image "r.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "ran.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "r.s4" (~ @ 2))
 (animate 0 0 2)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 23)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "ir.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 288) 0)
   (<>
    (text #:color 7 "【" 0 "】ぎょっ！？")
    (wait)
    (text #:color 5 "【一哉】や、やあ。")
    (wait)
    (text #:color 6 "【くるみ】やだ・・・" 0 "さん。")
    (wait)
    (text #:color 7 "【" 0 "】ほほう、こんな所で何をしてるのかな？")
    (wait)
    (if (> T 1900)
      (<>
       (text #:color 7 "【" 0 "】この時間って事は・・・これからいやらしい事をするのか？それとも、もう終ったのか？・・・ん？")
       (wait)))
    (text #:color 5 "【一哉】ははは・・・ちょっと見学に来だけだ。")
    (wait)
    (text #:color 6 "【くるみ】一哉君ったらね・・・おもしろい場所に行くなんて言って、私をこんな所に連れてくるんだから。")
    (wait)
    (text #:color 7 "【" 0 "】ほほう、面白い場所ねえ・・・。")
    (wait)
    (text #:color 5 "【一哉】" 0 "・・・お前だったら俺の気持ちをわかってくれるよな？")
    (wait)
    (set-reg: 288 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】お邪魔のようだから、俺は行くぜ。")
         (wait)
         (text #:color 6 "【くるみ】だめ・・・" 0 "さんがいなくなると、一哉君がまた狼に変身するもの。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】じゃあな、一哉。")
         (wait)
         (text #:color 5 "【一哉】ああ・・・。")
         (wait)
         (text #:color 6 "【くるみ】一哉君、私達もお家に帰りましょ？")
         (wait)
         (set-var N 11)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 6 "【くるみ】" 0 "さんも中に入りに来たの？")
         (wait)
         (text #:color 5 "【一哉】くるみ、" 0 "は一人じゃないか。")
         (wait)
         (text #:color 6 "【くるみ】だって・・・" 0 "さんだったら、１人で入って２人で出て来そうな気がするもの。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 5 "【一哉】" 0 "俺達は見せ物じゃないぞ。")
         (wait)
         (text #:color 7 "【" 0 "】ここでやり始めたら、完全に見せ物になるんだが・・・。")
         (wait)
         (text #:color 5 "【一哉】そんな事するかっ！！")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 12) 1) (== (: 14) 1) (== (: 50) 0))
     (<>
      (text #:color 5 "【一哉】くるみ・・・わかったよ。")
      (wait)
      (text #:color 6 "【くるみ】なにが？")
      (wait)
      (text #:color 5 "【一哉】もうホテルに行こうなんて言わない・・・絶対に言わない。")
      (wait)
      (text #:color 6 "【くるみ】うん・・・。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<> (text #:color 5 "【一哉】" 0 "・・・俺は悲しいぞ。") (wait)))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 5 "【一哉】なあ、" 0 "・・・俺の気持ちがわかるだろ？")
      (wait)
      (text #:color 7 "【" 0 "】何の気持ちだ？")
      (wait)
      (text #:color 5 "【一哉】だからあ・・・こういう場所にふらふらっと来てしまった気持ちだよ。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "わかる") (text "わからない") (text "スケベ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】わかるぜ、一哉・・・俺だって同じ事をするかもしれない。")
         (wait)
         (text #:color 5 "【一哉】聞いたかくるみ・・・ようするに俺がとった行動は、男の生理的現象なんだ。")
         (wait)
         (text #:color 6 "【くるみ】いやらしい事をしなくても、おつき合いはできるもん。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】わからないな・・・まったくわからん。")
         (wait)
         (text #:color 5 "【一哉】お、おい・・・" 0 "はくるみの味方なのか！？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】お前なあ、ホテルに連れ込むなら相手を選べよ・・・くるみちゃんが、素直についてくる女の子か？")
         (wait)
         (text #:color 5 "【一哉】だって・・・くるみ以外、誰を連れてくるんだよ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】スケベ。")
         (wait)
         (text #:color 5 "【一哉】な、なんだよ・・・。")
         (wait)
         (text #:color 7 "【" 0 "】スケベ。")
         (wait)
         (text #:color 5 "【一哉】" 0 "に言われたくないぜ・・・なあ、くるみ？")
         (wait)
         (text #:color 6 "【くるみ】しーらないっと。")
         (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text
       #:color
       5
       "【一哉】俺はだな、何もいやらしい事をしようとした訳じゃなくて・・・そう、二人っきりでゆっくり話がしたかったんだ。")
      (wait)
      (text #:color 7 "【" 0 "】はははっ！！男がよく使う手だぜ・・・『何もしないから、ホテルに行こう』ってね。")
      (wait)
      (text #:color 6 "【くるみ】あ・・・一哉君も同じ事を言った。")
      (wait)
      (text #:color 5 "【一哉】" 0 "・・・覚えてろよ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 5 "【一哉】あーあ・・・せっかくの夏休みなのに。")
      (wait)
      (text #:color 7 "【" 0 "】お前、そればっかりだな。")
      (wait)
      (text #:color 5 "【一哉】最後の夏休みだぜ・・・俺は学生時代に童貞を捨てたいんだあ、うっうっうっ。")
      (wait)
      (text #:color 6 "【くるみ】一哉君、ドーテイって何？")
      (wait)
      (text #:color 5 "【一哉】ホテルの中に入ればわかるよ・・・な、入ろうぜ？")
      (wait)
      (text #:color 6 "【くるみ】いや、お父さんに怒られるもん。")
      (wait)
      (text #:color 5 "【一哉】わかったよ・・・俺の事が嫌いなんだな。")
      (wait)
      (text #:color 6 "【くるみ】好きだけど・・・いやらしい事はしたくない。")
      (wait)
      (text #:color 5 "【一哉】" 0 "・・・俺はどうしたらいいんだ？")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ！！男はあきらめが肝心だ。")
      (wait)
      (text #:color 5 "【一哉】わかったよう・・・ちくしょうっ！！")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 1))
     (<> (text #:color 5 "【一哉】あーあ・・・エッチビデオでも見ようかな？") (wait)))
    ((&& (== V 2) (== N 7) (== (: 13) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・一哉君ってひどいと思わない？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ひどすぎる") (text "ひどくない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】うーん、ひどすぎる。")
         (wait)
         (text #:color 6 "【くるみ】でしょ？")
         (wait)
         (text #:color 5 "【一哉】" 0 "・・・自分でしてる事をよく考えてから言えよ。")
         (wait)))
       ((== N 2)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】くるみちゃんさあ・・・おつき合いって言うのはね、肉体関係がなければ成り立たないものなんだよ。")
         (wait)
         (text #:color 5 "【一哉】" 0 "、よくぞ言ってくれた。")
         (wait)
         (text #:color 7 "【" 0 "】一哉がここに来たのは、彼がそれだけ自分の気持ちに正直なだけさ・・・ちっともひどくないさ。")
         (wait)
         (text #:color 6 "【くるみ】だって・・・いやなんだもん。")
         (wait)))
       (else (<>)))
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 7) (== (: 14) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・男の人って、いやらしい事をしないと死んじゃうの？")
      (wait)
      (text #:color 7 "【" 0 "】はあ？")
      (wait)
      (text #:color 6 "【くるみ】だって、一哉君がそう言うんですもの。")
      (wait)
      (text #:color 5 "【一哉】死ぬよな？・・・エッチな事をしないと、死んじゃうよな？な？な？")
      (wait)
      (text #:color 7 "【" 0 "】くだらなすぎて、答える気になれないよ。")
      (wait)
      (text #:color 6 "【くるみ】ほーら、やっぱり嘘なんだ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 7) (== (: 50) 0))
     (<>
      (text #:color 6 "【くるみ】一哉君たらね・・・中に入るまで、ここを動かないなんて言うのよ。")
      (wait)
      (text #:color 5 "【一哉】はははは・・・。")
      (wait)))
    ((&& (== V 2) (== N 7) (== (: 50) 1))
     (<>
      (text #:color 6 "【くるみ】いやらしい事なんかしなくても、楽しい交際はできるもの・・・ねえ、一哉君。")
      (wait)
      (text #:color 5 "【一哉】ははは・・・はは・・・は。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 5 "【一哉】" 0 "・・・俺の髪を見てる場合か？") (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 5 "【一哉】" 0 "・・・俺の顔がいけないのか？")
      (wait)
      (text #:color 7 "【" 0 "】そうだな・・・額に『いやらしいヤツ』って書いてあるぜ。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 5 "【一哉】俺の心は、このシャツのように・・・。")
      (wait)
      (text #:color 7 "【" 0 "】真っ黒なんだろ？")
      (wait)
      (text #:color 5 "【一哉】真っ白だあ・・・俺の最後の夏休みが終ったも同然だ。")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】一哉、そのネクタイで首を吊るなよ・・・人生はこれからだ。")
      (wait)
      (text #:color 6 "【くるみ】そんなに重要な事なのかなあ・・・。")
      (wait)
      (text #:color 5 "【一哉】重要なんだよっ！！")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 5 "【一哉】制服を来てる時代に、童貞を捨てたかったぜ。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ！！俺にとっては過去の話だ。")
      (wait)
      (text #:color 5 "【一哉】どうして" 0 "だけ・・・ちくしょうっ！！")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】一哉・・・くるみちゃんの髪を触って、キスをして、それから抱き締めて、と。")
      (wait)
      (text #:color 5 "【一哉】もう言うな・・・俺にとってはかなわぬ夢だ。")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】いやあ、この首を見てると一哉の言う事もわからんでもない。")
      (wait)
      (text #:color 5 "【一哉】ホテルに行きたくないのなら、肌を１ミリも見せるなっ・・・単なる目の毒だからな。")
      (wait)
      (text #:color 6 "【くるみ】ひっどーい。")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃんって、リボンをといたら・・・もっと大人っぽくなるんじゃないか？")
      (wait)
      (text #:color 6 "【くるみ】くるみはね、大人になりたくないの。")
      (wait)
      (text #:color 5 "【一哉】" 0 "・・・何とか言ってくれ。")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 7 "【" 0 "】うーん、ホテルに輝く処女の白い腕・・・生めかしいな。")
      (wait)
      (text #:color 6 "【くるみ】結婚するまで、いやらしい事をしちゃいけないのよ・・・そんな事も知らないの？")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<>
      (text #:color 7 "【" 0 "】一哉、この身体を抱きたいんだろ？")
      (wait)
      (text #:color 5 "【一哉】うん。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ、無理だぜ。")
      (wait)
      (text #:color 5 "【一哉】怒るぜ。")
      (wait)))
    ((&& (== V 1) (== N 13))
     (<> (text #:color 6 "【くるみ】" 0 "さん、私の顔に何かついてる？") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))