(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\。
  #\子
  #\夏
  #\し
  #\だ
  #\た
  #\っ
  #\の
  #\て
  #\ん
  #\な
  #\、
  #\を
  #\う
  #\に
  #\が
  #\か
  #\さ
  #\？
  #\ら
  #\君
  #\あ
  #\そ
  #\で
  #\る
  #\め
  #\ゃ
  #\は
  #\わ
  #\よ
  #\事
  #\く
  #\も
  #\ど
  #\ょ
  #\！
  #\り
  #\私
  #\見
  #\き
  #\と
  #\れ
  #\ち
  #\我
  #\慢
  #\こ
  #\キ
  #\ス
  #\ま
  #\ね
  #\お
  #\胸
  #\じ
  #\す
  #\け
  #\目
  #\ー
  #\達
  #\言
  #\俺
  #\友
  #\何
  #\抱
  #\女
  #\顔
  #\や)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "j06.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "j06an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "j06.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 44)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "j06.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (set-reg: 331 0)
 (if (== (: 544) 1)
   (<>
    (text #:color 2 "【夏子】" 0 "君、キスがうまいじゃない。")
    (wait)
    (text #:color 7 "【" 0 "】夏子さん・・・。")
    (wait)
    (text #:color 2 "【夏子】目つきが危ないわね・・・もうキスしちゃだめよ。")
    (wait)
    (text #:color 7 "【" 0 "】キスしたい。")
    (wait)
    (text #:color 2 "【夏子】だーめ・・・私達、友達でしょう？")
    (wait)
    (text #:color 7 "【" 0 "】友達だろうが、何だろうがキスしたいんだっ！！")
    (wait)
    (text #:color 2 "【夏子】あはは・・・完全なだだっ子ね。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (set-reg: 331 (+ (: 331) 1))
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "だーっ！！")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】だーっ！！")
         (wait)
         (text #:color 2 "【夏子】駄目だったら・・・" 0 "君。")
         (wait)
         (text #:color 7 "【" 0 "】だって・・・我慢できないんだよう。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】だーっ！！")
         (wait)
         (text #:color 2 "【夏子】そんな事をしてると、またお腹が痛くなるわよ。")
         (wait)
         (text #:color 7 "【" 0 "】痛くなったっていい・・・夏子さんを抱きしめられれば。")
         (wait)
         (text #:color 2 "【夏子】だめ、我慢して。")
         (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、キスはさっきのでおしまいよ。")
      (wait)
      (text #:color 7 "【" 0 "】誰がそんな事を決めたんだ？")
      (wait)
      (text #:color 2 "【夏子】私・・・。")
      (wait)
      (text #:color 7 "【" 0 "】キスしたい・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、私だって女なのよ・・・キスとかしてたら、ね、わかるでしょう？")
      (wait)
      (text #:color 7 "【" 0 "】わからない。")
      (wait)
      (text #:color 2 "【夏子】私にだって・・・性欲はあるって事よ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 7) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 2 "【夏子】駄目だったら・・・我慢して。")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんの唇って・・・すごく素敵だった。")
      (wait)
      (text #:color 2 "【夏子】ありがとう・・・でもだめ。")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 7) (== N 1) (== (: 11) 2))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、そんな事をしないで・・・お話をしましょう？")
      (wait)
      (text #:color 7 "【" 0 "】キスしながら、お話をしよう。")
      (wait)
      (text #:color 2 "【夏子】無理よ、そんな事・・・私は" 0 "君みたいに器用じゃないの。")
      (wait)
      (set-reg: 11 3)
      (set-arr~ @ 7 0)
      (load "j06a.a6" 47104)))
    ((&& (== V 2) (== N 1) (< (: 331) 15))
     (<>
      (text #:color 2 "【夏子】" 0 "君・・・私の気持ちもわかって。")
      (wait)
      (text #:color 7 "【" 0 "】どんな気持ち？")
      (wait)
      (text #:color 2 "【夏子】だから・・・私だって女だって言ったでしょう？")
      (wait)))
    ((&& (== V 2) (== N 1) (> (: 331) 14) (== (: 11) 3))
     (<>
      (text #:color 2 "【夏子】" 0 "君・・・こんな事をする為に、ここに来たの？")
      (wait)
      (text #:color 7 "【" 0 "】だったら聞くけど・・・俺が目を覚ました時に、どうしてあんな近くにいたんだよ。")
      (wait)
      (text #:color 2 "【夏子】それは・・・" 0 "君がかわいかったから。")
      (wait)
      (text #:color 7 "【" 0 "】それだけの理由で、息がかかるくらい顔を近付けたのか？")
      (wait)
      (text #:color 2 "【夏子】そうよ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんみたいな奇麗な人が、あんなに近くにいて・・・目と目が合って。")
      (wait)
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】俺の腕には、まだ胸の感触が残ってる・・・この感触だけを思い出にしろって言うのか？")
      (wait)
      (text #:color 2 "【夏子】胸が" 0 "君の腕に当たってたのは・・・知らなかったもの。")
      (wait)
      (text #:color 7 "【" 0 "】そりゃないぜ、夏子さん・・・耳から血が出そうだ。")
      (wait)
      (text #:color 2 "【夏子】へえ、男の人って中途半端に興奮すると・・・耳から血が出るの？")
      (wait)
      (text #:color 7 "【" 0 "】そのくらい、我慢してるって事っ！！")
      (wait)
      (set-reg: 11 4)))
    ((&& (== V 2) (== N 1) (== (: 11) 4) (== (: 19) 0))
     (<>
      (cond
       ((== (: 21) 0)
        (<>
         (text #:color 7 "【" 0 "】ひどいや・・・夏子さんって。")
         (wait)
         (text #:color 2 "【夏子】わかったわ・・・" 0 "君は何がしたいの？")
         (wait)
         (text #:color 7 "【" 0 "】何がしたいって、そりゃあ・・・。")
         (wait)))
       ((== (: 21) 1)
        (<>
         (text #:color 2 "【夏子】もう一度聞くけど・・・" 0 "君は何がしたいの？")
         (wait)
         (text #:color 7 "【" 0 "】さっき言ったじゃないか・・・。")
         (wait)
         (text #:color 2 "【夏子】あれはだめ・・・他の事にして。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "胸を") (text "お尻を") (text "あそこを") (text "脚を")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ、胸を・・・。")
         (wait)
         (text #:color 2 "【夏子】胸を・・・どうしたいの？")
         (wait)
         (set-reg: 20 0)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ、お尻を・・・。")
         (wait)
         (text #:color 2 "【夏子】お尻を・・・どうしたいの？")
         (wait)
         (set-reg: 20 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ、あそこを・・・。")
         (wait)
         (text #:color 2 "【夏子】あそこ！？・・・まあいいわ、どうしたいの？")
         (wait)
         (set-reg: 20 2)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ、脚を・・・。")
         (wait)
         (text #:color 2 "【夏子】脚を・・・どうしたいの？")
         (wait)
         (set-reg: 20 3)))
       (else (<>)))
      (text #:color 7 "【" 0 "】どうしたいのって、そりゃあ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "なめたい") (text "見たい") (text "さわりたい") (text "もみたい")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】なめたいんだ・・・。") (wait)))
       ((&& (== N 2) (== (: 20) 0))
        (<>
         (text #:color 7 "【" 0 "】胸を見たい・・・夏子さんの胸を見たいんだ。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君・・・本当に見るだけ？")
         (wait)
         (text #:color 7 "【" 0 "】ああ・・・。")
         (wait)
         (text #:color 2 "【夏子】いいわ、見るだけなら・・・見せてあげる。")
         (wait)
         (set-var A 1)
         (proc 13)
         (proc 11)
         (slot 1 6)
         (mes-jump "j08.mes")))
       ((== N 2) (<> (text #:color 7 "【" 0 "】見たいんだ・・・。") (wait)))
       ((== N 3) (<> (text #:color 7 "【" 0 "】さわりたいんだ・・・。") (wait)))
       ((== N 4) (<> (text #:color 7 "【" 0 "】もみたいんだ・・・。") (wait)))
       (else (<>)))
      (text #:color 2 "【夏子】だめ・・・そんな事をしたら、私だって我慢できないもの。")
      (wait)
      (text #:color 7 "【" 0 "】いいじゃないか・・・我慢できなくたって。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、他の事にして・・・お願い。")
      (wait)
      (set-reg: 21 1)))
    ((== (: 21) 1)
     (<>
      (text #:color 2 "【夏子】" 0 "君・・・私の目を見て。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君は・・・私に何をして欲しいの？")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】ちくしょう・・・どうしてそんなに冷静な顔をしてられるんだ。")
      (wait)
      (text #:color 2 "【夏子】私が興奮してたら、する事は一つになっちゃうでしょう？")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 1))
     (<>
      (text #:color 7 "【" 0 "】夏子さんの顔にも・・・キスしたい。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君って情熱的なのね・・・彼女がうらやましいわ。")
      (wait)
      (text #:color 7 "【" 0 "】だからあ、彼女はいないってば。")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】ベットに横になってる時、夏子さんの髪が俺の頬をくすぐったんだ・・・すごく柔らかい髪だった。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君って、女性をくどくのが上手よね・・・感心しちゃう。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】夏子さんの髪に触りたい・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君が我慢してくれないと・・・困っちゃうわ。")
      (wait)))
    ((&& (== V 9) (== N 4) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんの胸を・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君・・・そんな事をしないで。")
      (wait)
      (text #:color 7 "【" 0 "】あまりにも魅力的すぎるんだ・・・我慢できない。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、男でしょ？・・・我慢しなさい。")
      (wait)
      (text #:color 7 "【" 0 "】男だから我慢できないんだよう・・・。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 9) (== N 4) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・。")
      (wait)
      (text #:color 2 "【夏子】胸に触っちゃだめよ・・・そんな事をしたら、絶対にだめ。")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんの腰に手を回して・・・顔を股間に埋めたい。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、すっごい事を言うのね。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 5) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】夏子さんの腰って・・・きゅっとしまってて、なんて魅力的なんだろう。")
      (wait)
      (text #:color 2 "【夏子】ありがとう・・・友達としてお礼を言うわ。")
      (wait)
      (text #:color 7 "【" 0 "】友達じゃいやだっ！！")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんに・・・膝枕してもらいたい。")
      (wait)
      (text #:color 2 "【夏子】かわいい事を言うのね・・・" 0 "君って。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 6) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・ここに顔を埋めてもいい？")
      (wait)
      (text #:color 2 "【夏子】だめよ、そんな事をしたら・・・私だって我慢してるんだから。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・抱きしめたいんだ。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君・・・抱きしめてから、どうするつもり？")
      (wait)
      (text #:color 7 "【" 0 "】それは、抱きしめた後に考えればいい事だ。")
      (wait)
      (text #:color 2 "【夏子】へえ、今のは大人の会話だわ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 7) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】ああ・・・夏子さんを俺の手の中に・・・。")
      (wait)
      (text #:color 2 "【夏子】手の中に抱いて、キスして、私の服を脱がして・・・でしょ？")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 2 "【夏子】いいでしょ・・・気に入ってるのよ。")
      (wait)
      (text #:color 7 "【" 0 "】そんな物はどうでもいい・・・今の俺には夏子さんしか見えない。")
      (wait)
      (text #:color 2 "【夏子】やだ、" 0 "君が見たんじゃない。")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<> (text #:color 7 "【" 0 "】（このベットに押し倒したい・・・。）") (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 2 "【夏子】水玉なのよ・・・かわいいでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんの下着が？")
      (wait)
      (text #:color 2 "【夏子】違うわよ、シーツの話をしてるの。")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<>
      (text #:color 2 "【夏子】友達に貰ったの・・・いい絵でしょ？")
      (wait)
      (text #:color 7 "【" 0 "】俺は夏子さんを貰いたい・・・。")
      (wait)
      (text #:color 2 "【夏子】私をお嫁に貰ってくれるの？・・・うれしいわあ。")
      (wait)))
    ((&& (== V 1) (== N 13))
     (<>
      (text #:color 2 "【夏子】マンションってね、昼間でもカーテンを閉めてないと覗く人がいるの・・・気をつけないとね。")
      (wait)))
    ((&& (== V 1) (== N 14))
     (<>
      (text #:color 2 "【夏子】この部屋に決めた時、一番のポイントだったのは・・・壁が板張りだった事ね。")
      (wait)
      (text #:color 7 "【" 0 "】そんな事はどうでもいいっ！！")
      (wait)
      (text #:color 2 "【夏子】だって・・・" 0 "君が見るからよ。")
      (wait)))
    ((&& (== V 6) (== N 15) (== (: 18) 0))
     (<>
      (text #:color 2 "【夏子】だめよ・・・ほどかないで。")
      (wait)
      (text #:color 7 "【" 0 "】いいじゃないか・・・夏子さんの胸が見たいんだ。")
      (wait)
      (text #:color 2 "【夏子】今日、プールで見たでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】あれだけじゃいやだ・・・もっと見たい。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 6) (== N 15) (== (: 18) 1))
     (<>
      (text #:color 2 "【夏子】だめ・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】ちくしょう、ちょうちょ結びかと思ったら・・・違うようだぞ。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))