(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\て
  #\。
  #\っ
  #\み
  #\ろ
  #\、
  #\ひ
  #\う
  #\の
  #\ん
  #\に
  #\る
  #\だ
  #\か
  #\？
  #\し
  #\は
  #\た
  #\も
  #\よ
  #\ゃ
  #\こ
  #\あ
  #\れ
  #\が
  #\で
  #\そ
  #\ー
  #\と
  #\ら
  #\ね
  #\を
  #\じ
  #\わ
  #\く
  #\ち
  #\事
  #\え
  #\ど
  #\（
  #\）
  #\す
  #\ぜ
  #\り
  #\ス
  #\君
  #\け
  #\！
  #\人
  #\言
  #\レ
  #\ょ
  #\何
  #\イ
  #\さ
  #\キ
  #\つ
  #\ま
  #\俺
  #\き
  #\や
  #\学
  #\プ
  #\め
  #\見
  #\日
  #\誰
  #\ト
  #\合
  #\ふ
  #\今
  #\お
  #\生
  #\コ
  #\本
  #\会
  #\社
  #\時
  #\気
  #\ラ
  #\ン
  #\ッ
  #\思
  #\ブ
  #\方
  #\ム
  #\せ
  #\私
  #\年
  #\ホ
  #\考
  #\自
  #\分
  #\知
  #\所
  #\３)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "28.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "o.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "oan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "o.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 18)
 (proc 26)
 (set-reg: 835 0)
 (slot 1 8)
 (set-arr~ @ 7 0)
 (load "o15.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 405) 1)
   (<>
    (text #:color 2 "【ひろみ】ふうふうふう、" 0 "君って脚が早いのね・・・でも走る事はないんじゃない？")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・ごめん、ごめん。")
    (wait)
    (text #:color 2 "【ひろみ】変な道を通るんですもの、" 0 "君を見失いそうになっちゃったわ。")
    (wait)
    (text #:color 7 "【" 0 "】ひろみちゃん、本当に今日は創立記念日なの？")
    (wait)
    (text #:color 2 "【ひろみ】だって・・・誰もいないじゃない。")
    (wait)
    (if (< T 1800)
      (<> (text #:color 7 "【" 0 "】誰もいないって・・・この会社って、いつも誰もいないぜ。") (wait)))
    (if (> T 1759)
      (<>
       (text #:color 7 "【" 0 "】誰もいないって、もうこんな時間だぜ・・・創立記念日じゃくても誰もいないよな。")
       (wait)))
    (text #:color 2 "【ひろみ】とにかく、中に入ってみればわかるわよ・・・行きましょ？")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "kuro.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】げっ！！・・・暗くて何も見えない。")
    (wait)
    (text #:color 2 "【ひろみ】会社の中ってね、昼間でも電気をつけないと暗いのよ・・・特に今日はブラインドも降りてるし。")
    (wait)
    (text #:color 2 "【ひろみ】ちょっと待ってね・・・今、電気をつけるから。")
    (wait)
    (text #:color 6 "パチ。")
    (wait)
    (slot 1 8)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "o15.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o15an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "o15.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 2 "【ひろみ】ほーら、誰もいない。")
    (wait)
    (text #:color 7 "【" 0 "】本当だ・・・誰もいない会社って気味が悪いな。")
    (wait)
    (text #:color 2 "【ひろみ】でしょう？・・・夜に一人でいたら、けっこう恐いかもしれないわね。")
    (wait)
    (text #:color 7 "【" 0 "】（どうでもいいけど・・・過激な座り方だなあ、下着が見えてるぜ。）")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((== N 1) (<> (text #:color 2 "【ひろみ】まだいいじゃない、もう少しここにいましょうよ。") (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】（うーん、何かいい事が起こりそうな予感がする・・・まだここにいようぜ。）")
         (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 1))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・なんだかムラムラしてきたぞっ！！）")
      (wait)
      (text #:color 2 "【ひろみ】あんっ・・・だ、だめっ！！。")
      (wait)
      (text #:color 7 "【" 0 "】そんな格好をして、今さら駄目なんて言わせないぞっ！！")
      (wait)
      (slot 1 8)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "o01.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "o01an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "o01.s4" (~ @ 2))
      (set-arr~ @ 7 0)
      (sound 1)
      (set-var I 44)
      (proc 26)
      (set-reg: 835 0)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 2 "【ひろみ】んんっ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ひろみちゃん・・・。")
      (wait)
      (text #:color 2 "【ひろみ】駄目よ・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】駄目って言われても・・・もうブレーキが壊れちゃってだめなんだ。")
      (wait)
      (text #:color 2 "【ひろみ】サイドブレーキを引いて・・・ん・・・お願い。")
      (wait)
      (text #:color 7 "【" 0 "】サイドブレーキは・・・ほら、ここにあるぜ。")
      (wait)
      (text #:color 2 "【ひろみ】んんっ・・・やだ・・・これは" 0 "君の・・・。")
      (wait)
      (text #:color 7 "【" 0 "】こんなになったのは、ひろみちゃんのせいだ・・・なんとかしてくれよう。")
      (wait)
      (text #:color 2 "【ひろみ】んんっ、いやっ・・・服を脱がさないで。")
      (wait)
      (set-reg: 406 1)
      (slot 1 8)
      (mes-jump "o02.mes")))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【ひろみ】ここが私の机で、あそこが係長の机・・・あそこが部長の机なの。")
      (wait)
      (text #:color 7 "【" 0 "】よくわからないけど・・・ふーん。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君も、５年後にはサラリーマンをやってるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】うーん、サラリーマンをやってるかどうかわからないけど・・・何か仕事はしてるんじゃないか？")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君って、なってみたい職業ってないの？")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (text "パイロット")
        (text "ホスト")
        (text "芸能人")
        (text "政治家")
        (text "学校の先生")
        (text "宇宙人")
        (text "お金持ち")
        (text "わからない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】僕ってパイロットになりたいんだ！！")
         (wait)
         (text #:color 2 "【ひろみ】あはははっ！！・・・" 0 "君、子供みたいな言い方をしないでよ。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・ホストになりたい。")
         (wait)
         (text #:color 2 "【ひろみ】ホスト？")
         (wait)
         (text #:color 7 "【" 0 "】ああ、女性を相手にする仕事が似合ってると思うんだ。")
         (wait)
         (text #:color 2 "【ひろみ】ふーん。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】芸能人になりたいな・・・女の子にモテそうだし。")
         (wait)
         (text #:color 2 "【ひろみ】" 0 "君って、けっこうミーハーなのね。")
         (wait)
         (set-reg: 103 (- (: 103) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】みんなに尊敬される、政治家になりたいな。")
         (wait)
         (text #:color 2 "【ひろみ】政治家って簡単になれないんじゃない？")
         (wait)
         (text #:color 7 "【" 0 "】だって俺、小学校の時に学級委員長をやってた事があるぜ。")
         (wait)
         (text #:color 2 "【ひろみ】じゃあ・・・なれるかもね。")
         (wait)))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】学校の先生になって、俺みたいに生徒をたっくさん育ててみたい。")
         (wait)
         (text #:color 2 "【ひろみ】それって・・・問題あるんじゃない？")
         (wait)
         (text #:color 7 "【" 0 "】どうしてだよう。")
         (wait)))
       ((== N 6)
        (<>
         (text #:color 7 "【" 0 "】宇宙人になりたい。")
         (wait)
         (text #:color 2 "【ひろみ】え？")
         (wait)
         (text #:color 7 "【" 0 "】だから、宇宙人になりたいって言ってるんだよ。")
         (wait)
         (text #:color 2 "【ひろみ】広い意味で考えれば、私達だって宇宙人じゃない？")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そうか。")
         (wait)))
       ((== N 7)
        (<>
         (text #:color 7 "【" 0 "】漠然とした考えだけど・・・とにかくお金持ちになりたい。")
         (wait)
         (text #:color 2 "【ひろみ】お金持ち？")
         (wait)
         (text #:color 7 "【" 0 "】ああ、楽をしてじゃなくて・・・死ぬほど働いた結果としてお金持ちになっていたい。")
         (wait)
         (text #:color 2 "【ひろみ】向上心のある男性って・・・好きよ。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 8)
        (<>
         (text #:color 7 "【" 0 "】わからないな・・・。")
         (wait)
         (text #:color 2 "【ひろみ】そうよね、まだ学生だもんね。")
         (wait)
         (text #:color 7 "【" 0 "】色々な事をやっていくうちに・・・自分のやりたい事が見つかるかもしれないな。")
         (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】そうそう、俺にあげたい物って何？・・・会社に忘れたんだろう？")
      (wait)
      (text #:color 2 "【ひろみ】後であげる・・・もうちょっとお話しましょうよ。")
      (wait)
      (text #:color 7 "【" 0 "】話をすると、何かいい事があるのかな？")
      (wait)
      (text #:color 2 "【ひろみ】あはは・・・どうかしらね？")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【ひろみ】喫茶店で話した事を覚えてる？・・・ほら、冬彦君と知り合った場所の事。")
      (wait)
      (text #:color 7 "【" 0 "】あの時は確か、教えてくれなかったよな。")
      (wait)
      (text #:color 2 "【ひろみ】あのね、コスプレで知り合ったの。")
      (wait)
      (text #:color 7 "【" 0 "】コスプレって言うと・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "こするプレイ") (text "ホテルの名前") (text "衣装遊び")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】こするプレイの事？")
         (wait)
         (text #:color 2 "【ひろみ】何よ、それ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・自分でもよくわかんない。")
         (wait)
         (text #:color 2 "【ひろみ】コスチューム・プレイ・・・略してコスプレって言うの。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】知ってるよ、それってホテルの名前でしょ？")
         (wait)
         (text #:color 2 "【ひろみ】違うわよ。")
         (wait)
         (text #:color 7 "【" 0 "】おっかしいなあ・・・。")
         (wait)
         (text #:color 2 "【ひろみ】コスチューム・プレイ・・・略してコスプレって言うの。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】コスチューム・プレイ・・・衣装遊びって事だろ？")
         (wait)
         (text #:color 2 "【ひろみ】衣装遊びって言うか知らないけど、確かに意味は合ってると思うわ。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】そこで知り合った事が、どうして暗い過去なんだ？")
      (wait)
      (text #:color 2 "【ひろみ】だって・・・俗に言う、オタッキーじゃない？")
      (wait)
      (text #:color 7 "【" 0 "】オタッキー？・・・誰が？")
      (wait)
      (text #:color 2 "【ひろみ】だから、私が。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】別に思わないぜ・・・オタッキーって、一つの事に凝ってる連中の事だろ、別に悪い事じゃないと思うけどな。")
      (wait)
      (text #:color 2 "【ひろみ】そうよ・・・そうなのよね。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 2 "【ひろみ】考えてみれば、短いつき合いだったわ・・・半年ぐらいかしら？")
      (wait)
      (text #:color 7 "【" 0 "】俺なんて３日ってのがあるぜ。")
      (wait)
      (text #:color 2 "【ひろみ】３日で別れちゃったの！？・・・それって、短すぎない？")
      (wait)
      (text #:color 7 "【" 0 "】ははは、３日、３ヶ月、３年って言うのが別れの周期なんだってさ。")
      (wait)
      (text #:color 2 "【ひろみ】へえ、" 0 "君ってそういう事には詳しいのね。")
      (wait)
      (text #:color 7 "【" 0 "】そういう事じゃなくても詳しいぜ・・・色々と。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 2 "【ひろみ】冬彦君ってね、私の身体に触ろうとしないの。")
      (wait)
      (text #:color 7 "【" 0 "】だって、人のいない場所でデートしてたんだろ？")
      (wait)
      (text #:color 2 "【ひろみ】そうだけど、キスもしないのよ・・・変でしょ？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "すごく変") (text "普通だよ") (text "魅力がない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】変だぜ・・・ひろみちゃんにキスしたくない男なんて、地球上に一人もいないと思ってた。")
         (wait)
         (text #:color 2 "【ひろみ】あははは・・・オーバーな言い方。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】普通じゃないか？・・・キスする為につき合ってる訳じゃないしさ。")
         (wait)
         (text #:color 2 "【ひろみ】そうだけど・・・少し寂しいじゃない、そういうのって。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】魅力がなかったんじゃないの・・・ひろみちゃんに。")
         (wait)
         (text #:color 2 "【ひろみ】けっこうキツい事を言うわね・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・そう？")
         (wait)
         (set-reg: 103 (- (: 103) 1))))
       (else (<>)))
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君ってさ・・・経験あるの？")
      (wait)
      (text #:color 7 "【" 0 "】何の経験？")
      (wait)
      (text #:color 2 "【ひろみ】わかってるでしょ？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ある") (text "ない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】あるよ。")
         (wait)
         (text #:color 2 "【ひろみ】そうよね、今時の１８歳って早熟だもの。")
         (wait)
         (text #:color 7 "【" 0 "】自分だって、数年前には１８歳だったくせに。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ないよ。")
         (wait)
         (text #:color 2 "【ひろみ】めずらしくない？・・・今時の学生って、みんな早熟なんでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】俺には関係ないな・・・人は人、自分は自分さ。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       (else (<>)))
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ、俺にくれる物って何？")
      (wait)
      (text #:color 2 "【ひろみ】内緒よ。")
      (wait)
      (text #:color 7 "【" 0 "】どこに置き忘れたの？")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君の手が、届く所に置いてあるわ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・どこだ？")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 1))
     (<>
      (text #:color 2 "【ひろみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【ひろみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（妙な雰囲気だぜ・・・。）")
      (wait)
      (set-reg: 16 2)))
    ((&& (== V 2) (== N 1) (== (: 16) 2))
     (<>
      (text #:color 2 "【ひろみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（ひろみちゃんは何も喋らずに俺の事を見つめてる・・・。）")
      (wait)
      (text #:color 2 "【ひろみ】ねえ・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 2 "【ひろみ】う、ううん・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（こんな雰囲気になって何もしない程、俺は馬鹿じゃないぜ・・・。）")
      (wait)
      (set-arr~ @ 7 0)
      (load "o15a.a6" 47104)))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 7 "【" 0 "】（ひろみちゃんって、ロングにしても似合うんじゃないか？）") (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 7 "【" 0 "】（俺を見つめてるな・・・考えてみたら、彼女と二人きりだぜ。）") (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（手を頬にあてている時は、『あなたに抱かれたい信号』だって・・・どこかの週刊誌に書いてあったな。）")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<> (text #:color 7 "【" 0 "】（ひろみちゃんだ・・・椅子に座るのはいいけど、格好がすごすぎる。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（これで２回目だぜ・・・今日も白いパンティのようだぞ。）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 6) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】（あれれ・・・少し濡れているような？）")
      (wait)
      (text #:color 7 "【" 0 "】（ははは、こんな遠くからわかる訳がないか。）")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】（ふとももがニョッキリ出ている・・・わざと見せているのか？）")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、この脚の開き方は、意識的としか思えないぞ・・・。）")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<> (text #:color 7 "【" 0 "】（まさか・・・いつもこんな格好で座ってる訳じゃないだろうな。）") (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】（スカートがまくれているよ・・・いくらスカートが長くても、これじゃあまる見えだぜ。）")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】これ・・・ひろみちゃんの？")
      (wait)
      (text #:color 2 "【ひろみ】うん、かわいいでしょ？")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】この本は・・・何の本なの？")
      (wait)
      (text #:color 2 "【ひろみ】私は経理をやってるから、帳簿に関する本なの。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 11) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】帳簿に関する本だよね？")
      (wait)
      (text #:color 2 "【ひろみ】そうよ・・・読んでみる？")
      (wait)
      (text #:color 7 "【" 0 "】いいよ、どうせわからないから。")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<> (text #:color 7 "【" 0 "】（ひろみちゃんの机だ・・・奇麗に整頓されてるな。）") (wait)))
    ((&& (== V 1) (== N 13))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ、これって邪魔じゃない？")
      (wait)
      (text #:color 2 "【ひろみ】仕方がないのよ・・・ここ以外に置き場所がないんですって。")
      (wait)))
    ((&& (== V 1) (== N 14))
     (<> (text #:color 2 "【ひろみ】会社の中ってね、昼間でもブラインドを下ろすと、真っ暗になっちゃうのよ。") (wait)))
    ((&& (== V 1) (== N 15) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】うーん、いかにも会社って雰囲気だぜ。")
      (wait)
      (text #:color 2 "【ひろみ】学校と違って、へたをしたら１０年以上通う場所なのよ。")
      (wait)
      (text #:color 7 "【" 0 "】そう考えると・・・学生って楽だよなあ。")
      (wait)
      (text #:color 2 "【ひろみ】勉強しない学生はね。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、そりゃ俺だよ。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 15) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】ここでひろみさんが働いてるのか・・・。")
      (wait)
      (text #:color 2 "【ひろみ】そう、結婚するまでずーっと、ね。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))