(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\の
  #\、
  #\て
  #\っ
  #\。
  #\か
  #\は
  #\み
  #\ひ
  #\ろ
  #\ん
  #\る
  #\だ
  #\た
  #\に
  #\よ
  #\う
  #\？
  #\も
  #\ら
  #\そ
  #\で
  #\し
  #\が
  #\を
  #\れ
  #\と
  #\あ
  #\く
  #\歳
  #\わ
  #\ね
  #\け
  #\事
  #\り
  #\ゃ
  #\ふ
  #\子
  #\ー
  #\女
  #\ま
  #\ち
  #\え
  #\私
  #\２
  #\こ
  #\す
  #\じ
  #\見
  #\俺
  #\め
  #\さ
  #\ど
  #\言
  #\男
  #\０
  #\君
  #\き
  #\知
  #\思
  #\や
  #\会
  #\社
  #\つ
  #\学
  #\顔
  #\ば
  #\変
  #\下
  #\当
  #\話
  #\ぜ
  #\気
  #\生
  #\彼
  #\氏
  #\時
  #\何
  #\者
  #\ょ
  #\単
  #\人
  #\ト
  #\大)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "28.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "o.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "oan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "o.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 18)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "hiromi.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 183) 0)
   (<>
    (text #:color 2 "【女の子】こんにちは。")
    (wait)
    (text #:color 7 "【" 0 "】え？")
    (wait)
    (text #:color 2 "【女の子】今は夏休み・・・よね？")
    (wait)
    (text #:color 7 "【" 0 "】はあ・・・。")
    (wait)
    (text
     #:color
     2
     "【女の子】ごめんなさい、いきなり声をかけて・・・いつもあなたが学校に行く時に見かけていたから、知り合いみたいに思えちゃって。")
    (wait)
    (text #:color 7 "【" 0 "】（かわいい女の子だけど・・・いったい誰だ？）")
    (wait)
    (text #:color 2 "【女の子】私の事、何者だ？・・・って、顔をしているわね、ふふふ。")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】（うーん・・・以前に声をかけた女性か？・・・それとも、酔った勢いでやってしまった女か？・・・うーん、うーん。）")
    (wait)
    (text #:color 2 "【女の子】知らなくて当り前よ・・・私はこの会社でＯＬやっている『田町　ひろみ』って言います。")
    (wait)
    (text #:color 7 "【" 0 "】ひろみ・・・さん？")
    (wait)
    (text #:color 2 "【ひろみ】ええ、よくある名前でしょ？・・・あなたは、" 0 "君よね。")
    (wait)
    (text #:color 7 "【" 0 "】どうして俺の名前を？")
    (wait)
    (text
     #:color
     2
     "【ひろみ】だって、有名ですもの・・・女の子のお尻ばかり追いかけている、先負学園の男の子って・・・私の会社の女の子達も知っているわよ。")
    (wait)
    (text #:color 7 "【" 0 "】くっそー・・・誰だよ、変な噂をバラまいているのは。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 183) 0))
        (<>
         (text #:color 2 "【ひろみ】あの・・・よければ、もう少し話をしません？")
         (wait)
         (text #:color 7 "【" 0 "】だったら、お茶でも飲みに行かない？・・・立ち話は女性の足によくないぜ。")
         (wait)
         (text #:color 2 "【ひろみ】ごめんね・・・まだ就業中だから。")
         (wait)))
       ((&& (== N 1) (== (: 183) 1))
        (<>
         (text #:color 2 "【ひろみ】楽しかったわ・・・" 0 "君って、想像していた通りの男の子ね。")
         (wait)
         (text #:color 7 "【" 0 "】あの・・・電話番号を教えてくれないかな？")
         (wait)
         (text
          #:color
          2
          "【ひろみ】簡単に教えると、誰にでも教えているみたいだから・・・今度また会えたら、その時に教えてあげる・・・じゃあね。")
         (wait)
         (set-var N 4)
         (set-reg: 175 1)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2) (<> (text #:color 2 "【ひろみ】だめよ・・・関係者以外は、中には入れないわよ。") (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・もう少し話をしていたい。")
         (wait)
         (text #:color 7 "【" 0 "】うまくいけば・・・ひっひっひっ。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text
       #:color
       2
       "【ひろみ】いつも元気に走って行く姿を、何度か見かけた事があるの・・・偶然すれちがった事もあるし、会社の窓から見た事もあったわ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・あれは遅刻しそうだったから。")
      (wait)
      (text #:color 2 "【ひろみ】じゃないかと思った。")
      (wait)
      (text #:color 7 "【" 0 "】あの・・・俺の事を知っているって、いったい誰から聞いたの？")
      (wait)
      (text
       #:color
       2
       "【ひろみ】私の同僚に、"
       0
       "君が通っている学校の卒業生がいて・・・"
       0
       "君って、一年生の時からそうだったって言ってたわ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・ようするに、進歩がない訳だ。")
      (wait)
      (text
       #:color
       2
       "【ひろみ】ふふふ、それでどんな男の子なのかなーって思ってて・・・でも、毎朝見かけるあなたが、その"
       0
       "君だって知ったのはつい最近なのよ。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】よく見かける俺様が俺様だって事も、その卒業生から聞いたんだな・・・ある事ない事を言いやがって、とんでもない女だぜ。")
      (wait)
      (text #:color 2 "【ひろみ】女じゃなくて、男よ。")
      (wait)
      (text #:color 7 "【" 0 "】ちっ、ますますとんでもないぜ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】ここで何をしてるのって・・・当然、仕事をしてるんだよね？")
      (wait)
      (text #:color 2 "【ひろみ】ええ、係長に買物を頼まれて・・・その帰りに偶然あたなを見かけたってわけ。")
      (wait)
      (text #:color 7 "【" 0 "】もしかして、俺の事をナンパしようとか？")
      (wait)
      (text #:color 2 "【ひろみ】ふふふ、" 0 "君じゃあるまいし・・・それに、私はちゃんと彼氏がいるのよ。")
      (wait)
      (text #:color 7 "【" 0 "】彼氏？・・・俺は平気だぜ、彼氏がいようが、夫がいようが。")
      (wait)
      (text #:color 2 "【ひろみ】私は真面目なＯＬなのよ・・・歳下の男の子をたぶらかそうなんて、思ってもいないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ、どうして声をかけたの？・・・ははあ、口ではそんな事を言っちゃって、本当は・・・。")
      (wait)
      (text #:color 2 "【ひろみ】まあ、興味がある事は認めるわよ・・・こうやって話をしてても、本当に『変な男の子』って感じだもの。")
      (wait)
      (text #:color 7 "【" 0 "】変？・・・俺が？")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君って、いつも元気が一杯って感じよね・・・見ているだけで、こっちまで元気になりそう。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ、歩く強壮剤って言われているから。")
      (wait)
      (text #:color 2 "【ひろみ】いつもそんな事ばかり言ってるの？・・・" 0 "君ってどんな男の子なのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】そうだな、俺は・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "単なるバカ") (text "単なるスケベ") (text "変質者")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】単なるバカです。")
         (wait)
         (text #:color 2 "【ひろみ】ふふふ・・・自分でバカって言う人に限って、そうじゃないのよ。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】単なるスケベかな？")
         (wait)
         (text #:color 2 "【ひろみ】それじゃ、噂通りよね・・・でも、ただのスケベじゃないような気もするけど。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】実は・・・変質者なんだ。")
         (wait)
         (text #:color 2 "【ひろみ】変質者！？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】そう・・・女の人からオシッコをかけられたり、ハイヒールで踏まれたりするのが、３度のメシよりも好きなんだ。")
         (wait)
         (text #:color 2 "【ひろみ】そ、そうなの？・・・さすがに、そこまでする男の子だとは思わなかったわね。")
         (wait)
         (set-reg: 103 (- (: 103) 1))))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 183) 0))
     (<>
      (text #:color 7 "【" 0 "】ひろみさん、俺がどんな男の子かを本当に知りたければ・・・俺とデートをすればいいんだよ。")
      (wait)
      (text #:color 2 "【ひろみ】さっそくきたわね・・・だめよ、私にはちゃんと彼氏がいるんだから。")
      (wait)
      (text #:color 7 "【" 0 "】そんな彼氏なんか埋めちゃってさ・・・俺とデートしたほうが、絶対に幸せになれるぜ。")
      (wait)
      (text #:color 2 "【ひろみ】ふふふ、ずいぶんと強気ね・・・そんな言葉は、同級生に言いなさい。")
      (wait)
      (text #:color 2 "【ひろみ】だいたい私の事、いくつだと思っているの？")
      (wait)
      (text #:color 7 "【" 0 "】歳？・・・えーと。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (text "１９歳")
        (text "２０歳")
        (text "２１歳")
        (text "２２歳")
        (text "実は死んでいる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】１９歳・・・くらいかな？")
         (wait)
         (text #:color 2 "【ひろみ】やっぱり歳下に見られちゃうのよね・・・私って童顔だから。")
         (wait)
         (text #:color 7 "【" 0 "】って事は、もっと歳上？")
         (wait)
         (text #:color 2 "【ひろみ】もっとじゃないけど・・・私は２０歳よ。")
         (wait)
         (text #:color 7 "【" 0 "】ふーん、２０歳かあ・・・。")
         (wait)
         (set-reg: 103 (- (: 103) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】２０歳・・・くらいかな？")
         (wait)
         (text #:color 2 "【ひろみ】へえ、よくわかったわね・・・噂通り、女の子にかけては鋭いのね。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】２１歳くらい・・・かな？")
         (wait)
         (text #:color 2 "【ひろみ】へえ・・・歳上に見られるなんて、めったにないのに。")
         (wait)
         (text #:color 2 "【ひろみ】私って、顔が童顔でしょ？・・・だからだいたい歳下に見られちゃうのよ。")
         (wait)
         (text #:color 7 "【" 0 "】て事は、もう少し歳下って事か。")
         (wait)
         (text #:color 2 "【ひろみ】そうよ、私は２０歳ぴったりなの。")
         (wait)
         (text #:color 7 "【" 0 "】ふーん、２０歳かあ・・・。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・２２歳くらいかな？")
         (wait)
         (text #:color 2 "【ひろみ】へえ・・・歳上に見られるなんて、めったにないのに。")
         (wait)
         (text #:color 2 "【ひろみ】私って、顔が童顔でしょ？・・・だからだいたい歳下に見られちゃうのよ。")
         (wait)
         (text #:color 7 "【" 0 "】て事は、もう少し歳下って事か。")
         (wait)
         (text #:color 2 "【ひろみ】そうよ、私は２０歳ぴったりなの。")
         (wait)
         (text #:color 7 "【" 0 "】ふーん、２０歳かあ・・・。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】実は・・・。")
         (wait)
         (text #:color 2 "【ひろみ】実は・・・？")
         (wait)
         (text #:color 7 "【" 0 "】もう死んでいるとか？")
         (wait)
         (text #:color 2 "【ひろみ】ははははははははははっ！！")
         (wait)
         (text #:color 2 "【ひろみ】本当にひょうきんな男の子ね・・・私は２０歳よ。")
         (wait)
         (text #:color 7 "【" 0 "】２０歳はいいけど、その男の子って言うのはやめてくれよう。")
         (wait)
         (set-reg: 103 (+ (: 103) 2))))
       (else (<>)))
      (text #:color 2 "【ひろみ】あ、もうこんな時間だわ・・・そろそろ会社に戻らないと、係長に怒られちゃう。")
      (wait)
      (text #:color 7 "【" 0 "】社会人って大変だなー。")
      (wait)
      (text #:color 2 "【ひろみ】そうよー、学生の時の夏休みなんて・・・社会に出たら二度とこないからね。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、今年で最後だと思うと・・・悲しくなってくるな。")
      (wait)
      (text #:color 2 "【ひろみ】大丈夫、みんなそうやって大人になっていくんだから。")
      (wait)
      (set-reg: 183 1)))
    ((&& (== V 2) (== N 1) (== (: 183) 1))
     (<> (text #:color 2 "【ひろみ】ずいぶんと長く話込んじゃたわ・・・ごめんね、いきなり声をかけて。") (wait)))
    ((&& (== V 1) (== N 2) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】ショートカットか・・・でも似合っているよな。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 2) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】ひろみさんの髪の毛だ・・・。") (wait)))
    ((&& (== V 1) (== N 3) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】かわいい顔をしているよな・・・ぽっちゃりしてて、俺好みだぜ。")
      (wait)
      (text #:color 2 "【ひろみ】何か言った？")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 3) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】ひろみさんは、俺の事を見ている・・・。") (wait)))
    ((&& (== V 1) (== N 4) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】女性の歳は首でわかるんだ・・・いくら化粧を厚くしても、首のシワを隠す事はできない。")
      (wait)
      (text #:color 2 "【ひろみ】さすが" 0 "君ね・・・女性週刊誌も読んでいるの？")
      (wait)
      (text #:color 7 "【" 0 "】おかげさんで。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 4) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】なめていい？")
      (wait)
      (text #:color 2 "【ひろみ】あのね・・・ここは天下の公道よ。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・大きそうだな。")
      (wait)
      (text #:color 2 "【ひろみ】胸の事？・・・子供でも胸には興味があるのね。")
      (wait)
      (text #:color 7 "【" 0 "】ばかにすんなよ・・・身体はりっぱな大人だぞ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 6) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】でかい・・・それともパット入りか？")
      (wait)
      (text #:color 2 "【ひろみ】それは私の彼氏だけが知っているわ・・・ふふふ。")
      (wait)
      (text #:color 7 "【" 0 "】ちぇっ。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】ブレザーか・・・まるで学生みたいな格好だな。")
      (wait)
      (text
       #:color
       2
       "【ひろみ】仕方がないじゃない、これが会社の制服なんだから・・・社長がロリコンだから、こんな制服なのよ、きっと。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 7) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】ブレザーか・・・先負学園と同じだな。")
      (wait)
      (text #:color 2 "【ひろみ】先負学園は、紺色のブレザーでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】よく知っているな・・・もしかして制服マニアとか？")
      (wait)))
    ((&& (== V 6) (== N 5) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえ、これを取ると・・・どうなるのかな？")
      (wait)
      (text #:color 2 "【ひろみ】別に・・・どうにもならないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】つまんないな。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 6) (== N 5) (== (: 16) 1))
     (<>
      (text #:color 2 "【ひろみ】だから、それを取っても何も起こらないわよ・・・服がスッポリ脱げるとでも思ったの？")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))