(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\ろ
  #\。
  #\っ
  #\な
  #\ひ
  #\て
  #\み
  #\に
  #\、
  #\う
  #\だ
  #\の
  #\ん
  #\？
  #\で
  #\た
  #\あ
  #\と
  #\れ
  #\か
  #\し
  #\よ
  #\も
  #\る
  #\は
  #\ら
  #\！
  #\が
  #\を
  #\わ
  #\え
  #\こ
  #\さ
  #\く
  #\そ
  #\言
  #\一
  #\俺
  #\ゃ
  #\じ
  #\会
  #\ね
  #\ま
  #\事
  #\緒
  #\ど
  #\り
  #\け
  #\行
  #\喫
  #\茶
  #\店
  #\ぜ
  #\間
  #\ち
  #\や
  #\ふ
  #\子
  #\ば
  #\す
  #\社
  #\暇
  #\お
  #\時
  #\前
  #\つ
  #\冗
  #\談
  #\君
  #\き
  #\戻
  #\客
  #\待)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "28.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "o.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "oan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "o.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 18)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "hiromi.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 264) 0)
   (<>
    (text #:color 2 "【ひろみ】こんにちは・・・また会っちゃったわね。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ひ、ひろみさん！！・・・いやあ、会えてうれしいなあ。")
    (wait)
    (text #:color 2 "【ひろみ】よく言うわね、その調子のよさはどこからくるのかしら？")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】ひどいなあ、本当にひろみさんに会いたかったんだぜ・・・朝も昼も夜も、ずっとひろみさんの事ばかり考えていたんだ。")
    (wait)
    (text
     #:color
     2
     "【ひろみ】他の女の子の事も一緒に考えていたんでしょ？・・・だいたい私の顔を見て、すぐに名前を思い出さない人が、そこまで言えるのかしら？")
    (wait)
    (text #:color 7 "【" 0 "】ド忘れだよ・・・それに、こう見えても俺は一途なんだぜ。")
    (wait)
    (text #:color 2 "【ひろみ】そうかしら？・・・もしそうだとしたら、" 0 "君の先輩から聞いた噂話とは全然違うわね。")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】ちっちっちっ、噂なんて信じちゃいけないぜ・・・目の前にいる俺自身から、感じる事だけを真実として受け止めてくれ。")
    (wait)
    (text #:color 2 "【ひろみ】・・・。")
    (wait)
    (text #:color 2 "【ひろみ】・・・。")
    (wait)
    (text #:color 2 "【ひろみ】目つきが危ないわね・・・獣のような目をしてるわ。")
    (wait)
    (text #:color 7 "【" 0 "】ひ、ひどい・・・。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (text "他の場所に行く")
        (text "中に入る")
        (if (== (: 265) 1) (text "喫茶店に行く"))
        (text "やめる")))
      (cond
       ((== N 1)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】いーやっ！！前と同じようにここでバイバイしたら、ナンパ魔王と呼ばれてる"
          0
          "様の名がすたるぜ。")
         (wait)
         (text #:color 2 "【ひろみ】誰が『ナンパ魔王』なの？")
         (wait)
         (text #:color 7 "【" 0 "】こっちの話です。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 2 "【ひろみ】会社に戻るって・・・私の事？")
         (wait)
         (text #:color 7 "【" 0 "】いいや、俺だよ。")
         (wait)
         (text #:color 2 "【ひろみ】" 0 "君いつ就職したの？・・・会社の中に入っても、面白くないわよ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 2 "【ひろみ】駅に近い喫茶店がいいな。")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっ、じゃあ『ＯＴＩＭＴＩＭ』に行こうぜ。")
         (wait)
         (set-reg: 266 1)
         (set-var N 4)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・そうするか。")
         (wait)
         (text #:color 2 "【ひろみ】" 0 "君って、独り言が多いのよね。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】今日は平日だから・・・仕事だよね？")
      (wait)
      (text #:color 2 "【ひろみ】うん・・・でも、今は暇なのよ。")
      (wait)
      (text #:color 7 "【" 0 "】どうして？")
      (wait)
      (text #:color 2 "【ひろみ】係長に頼まれて、お客さんを駅まで迎えに行ったんだけど・・・３０分待っても来なかったの。")
      (wait)
      (text #:color 2 "【ひろみ】それで会社に電話をしたら、お客さんの都合で遅れる事になったんですって・・・勝手だと思わない？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "勝手だ！！") (text "ひろみが悪い")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】仕事の事はよくわからないけど・・・勝手だな。")
         (wait)
         (text #:color 2 "【ひろみ】でしょう？・・・もっと早く電話をくれればいいのにね。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ひろみが悪い。")
         (wait)
         (text #:color 2 "【ひろみ】え？")
         (wait)
         (text #:color 7 "【" 0 "】相手はお客さんなんだから、たとえ１時間遅れようが文句を言うべきではないっ！！")
         (wait)
         (text #:color 2 "【ひろみ】え？")
         (wait)
         (text #:color 7 "【" 0 "】雨が降ろうが、雪が降ろうが・・・たとえ２４時間でもお客さんを待つべきだぜっ！！")
         (wait)
         (text #:color 2 "【ひろみ】ふふふっ、ギャグで言ってるのね・・・本当に面白い男の子だわ。")
         (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text
       #:color
       2
       "【ひろみ】お客さんが来るまで時間があるから、会社に一度戻ろうと思って・・・そうしたら、"
       0
       "君と偶然会ったってわけ。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・俺とひろみさんは、見えないロープでつながっているに違いないぜ。")
      (wait)
      (text
       #:color
       2
       "【ひろみ】係長は、そのまま喫茶店で時間をつぶして待ってろっ・・・て言うんだけど、一人で喫茶店にいても退屈だし。")
      (wait)
      (text #:color 7 "【" 0 "】（こりゃあチャンスだぜ・・・。）")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 265) 0))
     (<>
      (cond
       ((== (: 12) 0)
        (<>
         (text #:color 7 "【" 0 "】偶然だなあ、なんて偶然なんだ・・・実は俺も暇でさあ。")
         (wait)
         (text #:color 2 "【ひろみ】" 0 "君も暇なの？")
         (wait)
         (text #:color 7 "【" 0 "】暇も暇！！・・・暇が服を着て歩いているようなもんだ。")
         (wait)
         (text #:color 2 "【ひろみ】ははははっ！！")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】ひろみさん、喫茶店で待ってろって言われたくらいだから・・・会社に戻らなくてもいいんでしょ？")
         (wait)
         (text #:color 2 "【ひろみ】まあ・・・ね。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ俺と一緒に・・・。")
         (wait)))
       ((== (: 12) 1) (<> (text #:color 7 "【" 0 "】だからあ、俺と一緒に・・・。") (wait)))
       (else (<>)))
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "喫茶店に行こう") (text "ホテルに行こう") (text "自殺しよう")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺と一緒に喫茶店に行こうぜ・・・それだったら退屈じゃないだろう？")
         (wait)
         (text #:color 2 "【ひろみ】でも・・・。")
         (wait)
         (text #:color 7 "【" 0 "】そのハゲの係長だって、喫茶店で待ってろって言ったんじゃないか・・・ね？")
         (wait)
         (text #:color 2 "【ひろみ】別にハゲだなんで言ってないわよ。")
         (wait)
         (text #:color 7 "【" 0 "】そんな事はどうでもいいや・・・いにかく一緒に喫茶店に行こうよう、もちろん俺のおごりでさ。")
         (wait)
         (text #:color 2 "【ひろみ】ふふふ、なんだかだだっ子みたい。")
         (wait)
         (text #:color 2 "【ひろみ】・・・。")
         (wait)
         (text #:color 2 "【ひろみ】いいわ・・・じゃあ、私と一緒に時間をつぶしてくれる？")
         (wait)
         (text #:color 7 "【" 0 "】いいともっ！！")
         (wait)
         (set-reg: 265 1)))
       ((&& (== N 2) (== (: 13) 0))
        (<>
         (text #:color 7 "【" 0 "】俺と一緒に・・・ホテルに行こう。")
         (wait)
         (text #:color 2 "【ひろみ】え！？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】いいじゃないか、どうせ暇なんだろ？・・・一緒にこってりと愛し合えば、時間なんてあっという間に過ぎる。")
         (wait)
         (text #:color 2 "【ひろみ】冗談で言ってるんでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】冗談！？・・・ふくらんだ股間を見ろよ、これでも冗談か？")
         (wait)
         (text #:color 2 "【ひろみ】あーあ・・・やっぱり会社に戻ろうっと。")
         (wait)
         (text #:color 7 "【" 0 "】あ、嘘・・・冗談だってば。")
         (wait)
         (set-reg: 13 1)
         (set-reg: 103 (- (: 103) 1))))
       ((&& (== N 2) (== (: 13) 1))
        (<>
         (text #:color 7 "【" 0 "】だから・・・ホテル。")
         (wait)
         (text #:color 2 "【ひろみ】冗談よね？")
         (wait)
         (text #:color 7 "【" 0 "】はい。")))
       ((&& (== N 3) (== (: 14) 0))
        (<>
         (text #:color 7 "【" 0 "】俺と一緒に自殺しよう・・・って、俺はいったい何を言ってるんだ。")
         (wait)
         (text #:color 2 "【ひろみ】ばかな事を言わないでよ・・・また結婚もしてないし、お母さんにもなってないのに。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ俺と結婚して、とっとと子供を作って、それからすぐに死のう。")
         (wait)
         (text #:color 2 "【ひろみ】一人で死んで。")
         (wait)
         (set-reg: 14 1)))
       ((&& (== N 3) (== (: 14) 1))
        (<>
         (text #:color 7 "【" 0 "】だからさあ・・・一緒に死のう。")
         (wait)
         (text #:color 2 "【ひろみ】いや。")
         (wait)
         (text #:color 7 "【" 0 "】だろうなあ。")
         (wait)))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 265) 1))
     (<>
      (text #:color 2 "【ひろみ】喫茶店に行かないの？")
      (wait)
      (text #:color 7 "【" 0 "】あれ？・・・ホテルじゃなかったっけ？")
      (wait)
      (text #:color 2 "【ひろみ】会社に戻るわよ。")
      (wait)
      (text #:color 7 "【" 0 "】冗談だってばあ。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】あれれ！？・・・髪型を変えたかな？")
      (wait)
      (text #:color 2 "【ひろみ】他の女の子と間違えているんじゃない？")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】あれれ！？・・・顔を取り替えた？")
      (wait)
      (text #:color 2 "【ひろみ】バカな事を言わないで。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】あれれ！？・・・首の雰囲気が、以前と違うような？")
      (wait)
      (text #:color 2 "【ひろみ】取り替えてないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】そうか、シワが増えてるだけだ。")
      (wait)
      (text #:color 2 "【ひろみ】・・・。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】あれれ！？・・・胸が前よりも大きくなってない？")
      (wait)
      (text #:color 2 "【ひろみ】変わってません。")
      (wait)
      (text #:color 7 "【" 0 "】きっと、彼氏にもまれたんだ・・・いやらしいなあ。")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】あれれ！？・・・前に会った時より、太ってなあい？")
      (wait)
      (text #:color 2 "【ひろみ】あのね、そういう言葉は女の子には禁句なの。")
      (wait)))
    ((&& (== V 6) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】取ってもいい？")
      (wait)
      (text #:color 2 "【ひろみ】だめ、ふざけないで。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ・・・俺にくれよ。")
      (wait)
      (text #:color 2 "【ひろみ】こんな物、貰ってどうするのよ・・・何に使うの？")
      (wait)
      (text #:color 7 "【" 0 "】内緒。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))