(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\の
  #\い
  #\っ
  #\て
  #\子
  #\夏
  #\、
  #\な
  #\し
  #\る
  #\は
  #\た
  #\ん
  #\君
  #\う
  #\か
  #\こ
  #\に
  #\だ
  #\も
  #\と
  #\わ
  #\？
  #\で
  #\が
  #\を
  #\そ
  #\一
  #\よ
  #\く
  #\あ
  #\ら
  #\哉
  #\ね
  #\れ
  #\さ
  #\ゃ
  #\け
  #\話
  #\ち
  #\ま
  #\り
  #\事
  #\や
  #\（
  #\）
  #\み
  #\俺
  #\ラ
  #\ょ
  #\じ
  #\私
  #\何
  #\ば
  #\す
  #\ー
  #\目)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "28.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "j11.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "j11an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "j11.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 30)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "j11.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 490) 0)
   (<>
    (text #:color 7 "【" 0 "】あれれ・・・夏子さん。")
    (wait)
    (text #:color 2 "【夏子】こんにちは、" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】夏子さん、この会社に就職したの？")
    (wait)
    (text #:color 2 "【夏子】まさか、前を通りかかっただけよ・・・" 0 "君こそ、ここで何をしてるのかしら？")
    (wait)
    (text #:color 7 "【" 0 "】俺は・・・家がこの近所だし、ブラブラしてるだけさ。")
    (wait)
    (text #:color 2 "【夏子】そう言えば、" 0 "君って一人暮しなんですってね・・・一哉君から聞いたわ。")
    (wait)
    (text #:color 7 "【" 0 "】気楽でいいもんさ、ははは。")
    (wait)
    (text #:color 2 "【夏子】でも偉いと思うわよ・・・炊事洗濯もやってるんでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】あ・・・そういえば全然やってない、どうりで着る服が少ないと思った。")
    (wait)
    (text #:color 2 "【夏子】あはははっ・・・やだ、" 0 "君ったら。")
    (wait)
    (set-reg: 490 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（せっかくだから・・・もう少しここにいるか。）") (wait)))
       ((== N 1)
        (<>
         (text #:color 2 "【夏子】また話をしちゃったわね・・・" 0 "君と話をしてると楽しいのよね。")
         (wait)
         (text #:color 7 "【" 0 "】そうかな・・・別に笑わせてるつもりはないけど。")
         (wait)
         (text #:color 2 "【夏子】変な魅力がある男の子って感じね。")
         (wait)
         (text #:color 7 "【" 0 "】変なだけ余計だ・・・。")
         (wait)
         (text #:color 2 "【夏子】これからどこに行くの？")
         (wait)
         (text #:color 7 "【" 0 "】さあね・・・脚に聞いてくれ。")
         (wait)
         (text #:color 2 "【夏子】じゃあね、" 0 "君・・・ばいばい。")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "28.pd8")
         (proc 15)
         (set-arr~ @ 7 0)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】はっ！！・・・ぼーっとしてしまった。")
         (wait)
         (text #:color 7 "【" 0 "】俺も他の場所に行こう・・・ここに立ってても仕方がないぜ。")
         (wait)
         (set-var N 4)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 2 "【夏子】" 0 "君こそ、この会社に就職でもしたの？")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・してない。")
         (wait)))
       ((== N 3)
        (<> (text #:color 7 "【" 0 "】（ここにいるって事は・・・夏子さんと話をするって事だ。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君は、夏休みの宿題があるんでしょう？")
      (wait)
      (text #:color 7 "【" 0 "】あるけど・・・まだ何もしてないぜ。")
      (wait)
      (text #:color 2 "【夏子】一哉君も同じ事を言ってたわ・・・みんな夏休みの最後までとっておくのよね。")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんは・・・えーと、何だっけ、ほら。")
      (wait)
      (text #:color 2 "【夏子】専門学校の課題でしょう？・・・がんばってるわよ、その為にアルバイトをやめたんだからね。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【夏子】一哉君から聞いたわよ・・・" 0 "君って、先負学園のスターなんですって？")
      (wait)
      (text #:color 7 "【" 0 "】スター？・・・俺はまだお星様にはなりたくない。")
      (wait)
      (text #:color 2 "【夏子】あははは・・・違うわよ、有名人って事。")
      (wait)
      (text #:color 7 "【" 0 "】一哉のやつ・・・いったい何を言ったんだ？")
      (wait)
      (text #:color 2 "【夏子】ほら、体育祭のリレーの話とか、お祭の時の話とか・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ロクなもんじゃないな・・・ちくしょう。")
      (wait)
      (text #:color 2 "【夏子】そう？・・・一哉君が" 0 "君の事を話す時って、本当に楽しそうに話すのよ。")
      (wait)
      (text #:color 7 "【" 0 "】そりゃそうさ、俺の馬鹿が目立って一哉の馬鹿が目立たないもんな。")
      (wait)
      (text #:color 2 "【夏子】でも・・・私は" 0 "君みたいな男の子っていいと思うわ。")
      (wait)
      (text #:color 7 "【" 0 "】（じゃあ・・・やらせてくれ。）")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】私ね、割り切って考える事にしたの・・・一哉君は友達、その友達の彼女がくるみちゃん。")
      (wait)
      (text #:color 7 "【" 0 "】うんうん。")
      (wait)
      (text
       #:color
       2
       "【夏子】一哉君とくるみちゃんが別れたとしても・・・それは一人の友達が彼女と別れただけの話・・・だからと言って私が一哉君の彼女になるわけじゃないの。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【夏子】一哉君もわかってくれるわ・・・私の気持ち。")
      (wait)
      (text #:color 7 "【" 0 "】（あいつ・・・わかるかなあ。）")
      (wait)
      (set-reg: 12 1)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 2 "【夏子】" 0 "君って・・・。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 2 "【夏子】ふふふ・・・何でもないわ。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 2 "【夏子】いいでしょう？・・・私の名前にぴったりの帽子なのよ。") (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 2 "【夏子】私の髪って黒いでしょ？・・・子供の頃、よくカラス、カラスってからかわれたわ。") (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 2 "【夏子】" 0 "君って・・・ふしぎな目をしてるのね。")
      (wait)
      (text #:color 7 "【" 0 "】（違うぜ・・・俺が女性を見る時の目は、獣のような目をしてるんだ。）")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<> (text #:color 2 "【夏子】一哉君もね・・・この服を着てると、ここをチラチラ見るのよ。") (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 2 "【夏子】" 0 "君の・・・エッチ。")
      (wait)
      (text #:color 7 "【" 0 "】そうだよ・・・今ごろわかったの？")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんといい、くるみちゃんといい・・・一哉にはもったいないな。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（そうだ・・・両方とも、俺がいただいてしまおう。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))