(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\と
  #\さ
  #\い
  #\み
  #\な
  #\っ
  #\て
  #\だ
  #\の
  #\か
  #\ん
  #\る
  #\、
  #\に
  #\う
  #\？
  #\た
  #\が
  #\よ
  #\は
  #\事
  #\あ
  #\し
  #\で
  #\を
  #\ら
  #\け
  #\（
  #\）
  #\く
  #\れ
  #\わ
  #\ど
  #\こ
  #\そ
  #\え
  #\ろ
  #\も
  #\ち
  #\言
  #\人
  #\ぜ
  #\ね
  #\ま
  #\ゃ
  #\何
  #\！
  #\行
  #\り
  #\気
  #\つ
  #\体
  #\河
  #\ー
  #\せ
  #\ょ
  #\方
  #\私
  #\悪
  #\学
  #\チ
  #\き
  #\見)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "16.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "p11.pd8")
 (proc 16)
 (set-arr~ @ 7 0)
 (slot 1 8)
 (set-arr~ @ 7 0)
 (load "p13.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 413) 0)
   (<>
    (text #:color 7 "【" 0 "】あそこに座ってるのは・・・さとみじゃないか？")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】河原で何をしてるんだろう・・・声をかけてみるか。")
    (wait)
    (text #:color 7 "【" 0 "】おーいっ！！さとみっ！！")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】なんだよ、人違いか？")
    (wait)
    (text #:color 7 "【" 0 "】側に行ってみればわかる事だな・・・河原に降りよう。")
    (wait)
    (slot 1 8)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "p13.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "p13an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "p13.s4" (~ @ 2))
    (set-arr~ @ 7 0)
    (animate 0 8 0)
    (animate 1 8)
    (text #:color 7 "【" 0 "】やっぱりさとみじゃないか・・・なんだよ、呼んだのに無視しやがって。")
    (wait)
    (text #:color 6 "【さとみ】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】（あれれ！？・・・なんだか様子がおかしいぞ。）")
    (wait)
    (set-reg: 413 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "他の場所に行く")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（さとみの様子が変だ・・・もう少し話をしてみよう。）") (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】さとみ・・・俺はもう行くぜ。")
         (wait)
         (text #:color 6 "【さとみ】うん・・・。")
         (wait)
         (text #:color 7 "【" 0 "】元気出せよ・・・な？")
         (wait)
         (text #:color 6 "【さとみ】うん・・・。")
         (wait)
         (set-var N 23)
         (slot 1 2)
         (mes-jump "town1.mes")))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】よう、真面目な顔をして・・・どうしたんだよ。")
      (wait)
      (text #:color 6 "【さとみ】" 0 "・・・いつからここにいたの？")
      (wait)
      (text #:color 7 "【" 0 "】ちょっと前だけど・・・。")
      (wait)
      (text #:color 6 "【さとみ】そう・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ、元気がないなあ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 6 "【さとみ】ねえ・・・男の人ってさあ。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 6 "【さとみ】まあ・・・" 0 "は特殊だから、聞いても仕方がないわね。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ、その特殊って言うのは。")
      (wait)
      (text #:color 6 "【さとみ】つまり・・・人とは違うって事。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】なんだか・・・落ち込んでいるな。")
      (wait)
      (text #:color 6 "【さとみ】誰が？")
      (wait)
      (text #:color 7 "【" 0 "】さとみだよ。")
      (wait)
      (text #:color 6 "【さとみ】私は平気よ・・・いつも元気だから。")
      (wait)
      (text #:color 7 "【" 0 "】『ＯＴＩＭＴＩＭ』のマスターが言ってたぜ、具合が悪いから休んでいるって。")
      (wait)
      (text #:color 6 "【さとみ】具合なんて悪くないわよ・・・たださぼってるだけ。")
      (wait)
      (text #:color 7 "【" 0 "】具合が悪そうだぜ・・・ほら、前よりこんなに胸がはれている。")
      (wait)
      (text #:color 6 "【さとみ】私の胸は中学の時から８０センチキープよ・・・悪かったわね。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】さとみさあ・・・。")
      (wait)
      (text #:color 6 "【さとみ】・・・なに？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "笑わせる") (text "何も言わない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】この間、ぼーっとしててさあ・・・。")
         (wait)
         (text #:color 6 "【さとみ】うん。")
         (wait)
         (text #:color 7 "【" 0 "】パンツを下ろさないで、用を足しちゃったんだ。")
         (wait)
         (text #:color 6 "【さとみ】え！？・・・まさか、大きい方？")
         (wait)
         (text #:color 7 "【" 0 "】そう・・・大きい方。")
         (wait)
         (text #:color 6 "【さとみ】あははははっ・・・馬鹿みたい。")
         (wait)
         (text #:color 6 "【さとみ】・・・。")
         (wait)
         (text #:color 6 "【さとみ】" 0 "・・・いいってば、気を使わなくて。")
         (wait)
         (text #:color 7 "【" 0 "】おいおい、誰が気を使ってるんだ？")
         (wait)
         (text #:color 6 "【さとみ】" 0 "って・・・性格はメチャクチャなんだけど、妙に優しい所があるんだよね。")
         (wait)
         (set-reg: 105 (+ (: 105) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 6 "【さとみ】" 0 "・・・何か言いたい事があるんでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】別にない。")
         (wait)
         (text #:color 6 "【さとみ】何よ・・もう。")
         (wait)
         (set-reg: 105 (- (: 105) 1))))
       (else (<>)))
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】ちょっと変だぜ、さとみ。")
      (wait)
      (text #:color 6 "【さとみ】私は大丈夫・・・ちょっとだけ考えたい事があるの、それだけの事よ。")
      (wait)
      (text #:color 7 "【" 0 "】考えたい事って言うと・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (text "食べ物の事")
        (text "体重の事")
        (text "男の事")
        (text "肉体の欠陥の事")
        (text "進学の事")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・食べ物の事だろう？")
         (wait)
         (text #:color 6 "【さとみ】食べ物？")
         (wait)
         (text #:color 7 "【" 0 "】だから、今日は何を食べようかとか・・・その事をあれこれ考えてるんだ。")
         (wait)
         (text #:color 6 "【さとみ】はあ・・・そんな事だったら、どんなに楽か。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・体重の事だろう？")
         (wait)
         (text #:color 6 "【さとみ】体重の事？")
         (wait)
         (text #:color 7 "【" 0 "】最近、太りすぎだなって思って・・・このままブクブク太っちゃったら、どうしようって。")
         (wait)
         (text #:color 6 "【さとみ】失礼ね、私は太ってません。")
         (wait)
         (set-reg: 105 (- (: 105) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】最近、様子が変だと思ってたんだ・・・男の事だろう？")
         (wait)
         (text #:color 6 "【さとみ】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】何か俺で相談できる事があったら・・・遠慮なく言ってくれよ。")
         (wait)
         (text #:color 6 "【さとみ】うん・・・ありがとう。")
         (wait)
         (set-reg: 105 (+ (: 105) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・肉体の欠陥の事で悩んでいるんだろ？")
         (wait)
         (text #:color 6 "【さとみ】肉体の欠陥？")
         (wait)
         (text #:color 7 "【" 0 "】ああ・・・乳首が４つあるとか、実はポコチンがついているとか。")
         (wait)
         (text #:color 6 "【さとみ】" 0 "・・・人が真剣に悩んでいるのに、ずいぶんな事を言うわね。")
         (wait)
         (text #:color 7 "【" 0 "】あれ・・・違ったの？")
         (wait)
         (set-reg: 105 (- (: 105) 1))))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・進学の事で悩んでいるんだろ？")
         (wait)
         (text #:color 6 "【さとみ】進学？")
         (wait)
         (text #:color 7 "【" 0 "】ああ、大学に行きたいけど・・・馬鹿だから行けないとか？")
         (wait)
         (text #:color 6 "【さとみ】" 0 "・・・ひどい事を言わないでよ。")
         (wait)
         (text #:color 7 "【" 0 "】あれ・・・違ったの？")
         (wait)
         (text
          #:color
          6
          "【さとみ】私は来年卒業したら、喫茶店のチイママになるの・・・昔から、自分で喫茶店をやってみたかったのよ。")
         (wait)
         (text #:color 7 "【" 0 "】ふーん・・・そうなんだ。")
         (wait)))
       (else (<>)))
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 0))
     (<>
      (text #:color 6 "【さとみ】" 0 "・・・悪いけど、一人にしてくれないかな？")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・わかった。")
      (wait)
      (text #:color 6 "【さとみ】ごめんね、せっかく心配してくれたのに。")
      (wait)
      (text #:color 7 "【" 0 "】心配なんかしてないよ・・・からかいに来ただけさ。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 6 "【さとみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（さとみを一人にしてやるか・・・。）")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 7 "【" 0 "】（さとみの髪って・・・近くで見ると奇麗だな。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（さとみの事は昔から知ってるけど・・・こんなに近くで顔を見たのは初めてだ。）")
      (wait)
      (text #:color 7 "【" 0 "】（さとみって・・・もしかして美形なんじゃないか？）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 3) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（空の色が反射してるせいなのか・・・妙にさとみの顔が奇麗に見えるぜ。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（喫茶店で働いているけど・・・手は荒れてない。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 4) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（奇麗な手だよな・・・ちょっと男っぽいけど。）") (wait)))
    ((&& (== V 1) (== N 5))
     (<> (text #:color 7 "【" 0 "】（さとみだ・・・こんな所に一人でいるなんて、絶対に変だぜ。）") (wait)))
    ((&& (== V 1) (== N 6))
     (<> (text #:color 7 "【" 0 "】（河原だ・・・夏だから、雑草が生えまくってるぜ。）") (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】（この河の名前はなんていうんだろ？・・・どちらにしろ、泳げるほど奇麗な河じゃない。）")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<> (text #:color 7 "【" 0 "】（俺はいつも、この上を通ってるんだ・・・ようするに遊歩道だな。）") (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】（遠くの方に陸橋が見える・・・あそこを通る電車に乗ると、矢吹町に行く事ができる。）")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<> (text #:color 7 "【" 0 "】（遠くの方にビルが見える・・・。）") (wait)))
    ((&& (== V 1) (== N 11))
     (<> (text #:color 7 "【" 0 "】空がオレンジ色をしている・・・朝焼けか、昼焼けか、それとも夕焼けか？") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))