(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\。
  #\な
  #\の
  #\子
  #\亜
  #\っ
  #\ん
  #\、
  #\だ
  #\て
  #\う
  #\か
  #\た
  #\？
  #\よ
  #\し
  #\ら
  #\に
  #\あ
  #\る
  #\で
  #\き
  #\が
  #\は
  #\と
  #\ゃ
  #\ど
  #\わ
  #\そ
  #\君
  #\さ
  #\も
  #\を
  #\じ
  #\好
  #\え
  #\事
  #\ね
  #\れ
  #\俺
  #\く
  #\ち
  #\私
  #\け
  #\言
  #\や
  #\り
  #\こ
  #\ー
  #\ま
  #\す
  #\！
  #\ろ
  #\方
  #\気
  #\ぜ
  #\見
  #\お
  #\何
  #\つ
  #\人
  #\顔
  #\帰
  #\一
  #\聞
  #\ょ
  #\ス
  #\ほ
  #\め
  #\（
  #\）
  #\せ
  #\嫌
  #\ば
  #\本
  #\学
  #\性
  #\誰
  #\知
  #\姉
  #\当
  #\キ
  #\女
  #\校
  #\緒
  #\悩
  #\思
  #\真
  #\生
  #\者
  #\違
  #\『
  #\』
  #\ッ
  #\格)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "16.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "t09.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 664) 1)
   (<>
    (text #:color 7 "【" 0 "】なんだよ・・・誰もいないじゃないか。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】待てよ、亜子さんの事だ・・・どこか見えない、すみっこの方にいるんじゃないか？")
    (wait)
    (set-reg: 101 1)
    (set-arr~ @ 7 0)
    (proc 18)
    (menu-show (<.> (text "名前を呼ぶ") (text "帰る")))
    (if (== N 1)
      (<>
       (text #:color 7 "【" 0 "】おーいっ！！亜子さんっ！！")
       (wait)
       (text #:color 7 "【" 0 "】・・・。")
       (wait)
       (text #:color 2 "【亜子】・・・誰？")
       (wait)
       (text #:color 7 "【" 0 "】ほーら、ね。")
       (wait)))
    (if (== N 2)
      (<>
       (text #:color 7 "【" 0 "】そうだな・・・亜子さんはいないんだ。")
       (wait)
       (text #:color 7 "【" 0 "】あきらめて、帰ろっと・・・。")
       (wait)
       (set-var N 23)
       (slot 1 2)
       (mes-jump "town1.mes")))
    (slot 1 5)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "t09.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 6 1)
    (image "t09an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "t09.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 3)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】亜子さん・・・一人で何してるの？")
    (wait)
    (text #:color 2 "【亜子】" 0 "君・・・。")
    (wait)
    (text #:color 7 "【" 0 "】そんな寂しそうな顔をしちゃって・・・ほーら、俺の顔を見たら元気になっただろ？")
    (wait)
    (text #:color 2 "【亜子】もう・・・その元気な顔の、" 0 "君の事で悩んでいるんじゃない。")
    (wait)
    (text #:color 7 "【" 0 "】へ？")
    (wait)
    (text #:color 2 "【亜子】へ、じゃないわよ・・・人の気持ちも知らないで。")
    (wait)
    (set-reg: 667 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "他の場所に行く")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 2 "【亜子】せっかく会えたのに・・・もう帰るの？")
         (wait)
         (text #:color 7 "【" 0 "】いーや、俺は帰らないぜ。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】じゃあ・・・俺は行くぜ。")
         (wait)
         (text #:color 2 "【亜子】うん・・・。")
         (wait)
         (set-var A 1)
         (proc 13)
         (proc 11)
         (set-var N 23)
         (slot 1 2)
         (mes-jump "town1.mes")))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【亜子】" 0 "君・・・。")
      (wait)
      (text #:color 7 "【" 0 "】はあ？")
      (wait)
      (text #:color 2 "【亜子】その返事だけで、聞きたくなくなったわ。")
      (wait)
      (text #:color 7 "【" 0 "】ちゃんと答えます、はい。")
      (wait)
      (text #:color 2 "【亜子】あのね・・・" 0 "君は、私の事をどう思っているの？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "好き") (text "嫌い") (text "どちらでもない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ、好きだよ・・・決まってるじゃないか。")
         (wait)
         (text #:color 2 "【亜子】そう言ってくれるとは思ったけど・・・。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】嫌いだな・・・亜子さんなんて。")
         (wait)
         (text #:color 2 "【亜子】ど、どうして！？")
         (wait)
         (text #:color 7 "【" 0 "】だって、俺の事を全然かまってくれないんだもん・・・うっうっうっ。")
         (wait)
         (text #:color 2 "【亜子】それは私のセリフだわ・・・。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】どちらでもないな・・・。")
         (wait)
         (text #:color 2 "【亜子】どういう事？")
         (wait)
         (text #:color 7 "【" 0 "】好きと聞かれれば、そうかなと思うし・・・嫌いと聞かれれば、そうではないと思うし。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】嫌いではないけど、好きでもないのかもしれないし・・・でも、やっぱり好きかもしれないけど嫌い。")
         (wait)
         (text #:color 2 "【亜子】" 0 "君・・・わざとわかりにくく言ってない？")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ・・・好き。")
         (wait)
         (set-reg: 106 (- (: 106) 1))))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 10) 1))
     (<>
      (text #:color 2 "【亜子】" 0 "君は私に好意を持ってくれてるとして・・・いったい誰と比べて好きなのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】誰と比べてって・・・いったい何が言いたいの？")
      (wait)
      (text #:color 2 "【亜子】例えば・・・真子姉さんと私と、どっちが好き？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "真子") (text "亜子") (text "どっちも嫌い") (text "両方好き")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ・・・真子先生の方が好きだな。")
         (wait)
         (text #:color 2 "【亜子】やっぱり・・・そうなんだ。")
         (wait)
         (text #:color 7 "【" 0 "】あ、がっかりした？・・・じゃあ亜子さんでいいや。")
         (wait)
         (text #:color 2 "【亜子】最低だわ。")
         (wait)
         (set-reg: 106 (- (: 106) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ・・・亜子さんの方が好きだよ。")
         (wait)
         (text #:color 2 "【亜子】本当に？")
         (wait)
         (text #:color 7 "【" 0 "】本当に本当。")
         (wait)
         (text #:color 2 "【亜子】うれしい・・・。")
         (wait)
         (set-reg: 106 (+ (: 106) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】どっちも嫌いだな・・・会っただけでヘドが出るぜ。")
         (wait)
         (text #:color 2 "【亜子】じゃあ、どうして声をかけたのよ・・・。")
         (wait)
         (text #:color 7 "【" 0 "】恐い者見たさだよ。")
         (wait)
         (text #:color 2 "【亜子】ひ、ひどい・・・。")
         (wait)
         (text #:color 7 "【" 0 "】やだなあ、冗談だよ・・・信じた？")
         (wait)
         (set-reg: 106 (- (: 106) 2))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】両方好きだよ・・・。")
         (wait)
         (text #:color 2 "【亜子】両方好きって・・・好きでも、多少は違うでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】ううん、１ミリも違わず同じくらい好きなんだ。")
         (wait)
         (text #:color 2 "【亜子】・・・はあ。")
         (wait)
         (text #:color 7 "【" 0 "】あ、がっかりしたでしょ？・・・じゃあ亜子さんの方が好きでいいや。")
         (wait)
         (text #:color 2 "【亜子】最低だわ・・・。")
         (wait)
         (set-reg: 106 (- (: 106) 1))))
       (else (<>)))
      (set-reg: 10 2)))
    ((&& (== V 2) (== N 1) (== (: 10) 2))
     (<>
      (text #:color 2 "【亜子】" 0 "君・・・真面目に答えてる？")
      (wait)
      (text #:color 7 "【" 0 "】ふあああ・・・まじゃめにゃこたへてるほ。")
      (wait)
      (text #:color 2 "【亜子】あくびをしながら返事をしないで・・・。")
      (wait)
      (set-reg: 10 3)))
    ((&& (== V 2) (== N 1) (== (: 10) 3))
     (<>
      (text #:color 2 "【亜子】" 0 "君にはわからないのよ・・・私がどんな気持ちか。")
      (wait)
      (text #:color 7 "【" 0 "】わかってるさ、俺の事が死ぬほど好きなんだろ？")
      (wait)
      (text #:color 2 "【亜子】そうよ・・・死ぬほど好き。")
      (wait)
      (text #:color 7 "【" 0 "】いいんだよ、正直に好きって言えば・・・え！？")
      (wait)
      (text #:color 7 "【" 0 "】今・・・死ぬほど好きって言わなかった？")
      (wait)
      (text #:color 2 "【亜子】言ったわ・・・本当だもの。")
      (wait)
      (text #:color 7 "【" 0 "】ま、またあ・・・そんな事を言って、あとで『嘘だよーん』とか言うんでしょ？")
      (wait)
      (text #:color 2 "【亜子】言わない。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】ははあ、どこかに黄色いヘルメットをかぶったオヤジが隠れてて・・・プラカードを持って出て来るとか？")
      (wait)
      (text #:color 2 "【亜子】ドッキリカメラじゃないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】こりゃ驚いた、ほい。")
      (wait)
      (text #:color 2 "【亜子】ふざけないでよ・・・もう。")
      (wait)
      (set-reg: 10 4)))
    ((&& (== V 2) (== N 1) (== (: 10) 4))
     (<>
      (text #:color 2 "【亜子】真子姉さんに、" 0 "君の事を色々と聞いたの・・・" 0 "君って女の子に人気があるんですってね。")
      (wait)
      (text #:color 7 "【" 0 "】そう？")
      (wait)
      (text #:color 2 "【亜子】笑わないで聞いてね・・・私、嫉妬してるの。")
      (wait)
      (text #:color 7 "【" 0 "】何に？")
      (wait)
      (text #:color 2 "【亜子】" 0 "君の学校の女の子達に・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ど、どうして！？（ま、まさか、何を知ってるわけじゃあ・・・。）")
      (wait)
      (text #:color 2 "【亜子】だって・・・学校が始まったら、" 0 "君と一緒にいる時間が私より長いじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】な、なんだ・・・そんな事か。")
      (wait)
      (text #:color 2 "【亜子】そんな事って・・・私にとっては大事な事なの！！")
      (wait)
      (text #:color 7 "【" 0 "】そんなに怒るなよう・・・シワが増えるぜ。")
      (wait)
      (text #:color 2 "【亜子】どーせ私は、" 0 "君より歳上ですよっ！！")
      (wait)
      (set-reg: 10 5)))
    ((&& (== V 2) (== N 1) (== (: 10) 5))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ・・・いつから俺の事が好きになったの？")
      (wait)
      (text #:color 2 "【亜子】知らない。")
      (wait)
      (text #:color 7 "【" 0 "】そうか・・・わかったぞ。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (text "太さと長さ")
        (text "キスをしたから")
        (text "顔がいい")
        (text "声がすてき")
        (text "性格が好き")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】太さと長さだな・・・うんうん、わかるよ。")
         (wait)
         (text #:color 2 "【亜子】" 0 "君、何の話？")
         (wait)
         (text #:color 7 "【" 0 "】あれ、違ったの？・・・なんだ、ちくしょう。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】キスをしたからでしょ？")
         (wait)
         (text #:color 2 "【亜子】違うわ・・・確かにキスがきっかけだったけど。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】顔がいいからだろ・・・ん？")
         (wait)
         (text #:color 2 "【亜子】信じられない事を言うわね・・・私が顔だけで男性を選ぶと思う？")
         (wait)
         (set-reg: 106 (- (: 106) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】俺のこの、渋い声がいいんだろ・・・何だったら一曲、唄おうか？")
         (wait)
         (text #:color 2 "【亜子】" 0 "君って・・・普通の声じゃない？")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そう。")
         (wait)))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・俺の性格が好きなんだろ？")
         (wait)
         (text #:color 2 "【亜子】よくわかったわね・・・どうしてわかったの？")
         (wait)
         (text #:color 2 "【亜子】やっぱり、" 0 "君と私って・・・何かでつながってるんだわ。")
         (wait)
         (text #:color 7 "【" 0 "】え！？・・・本当に俺の性格が好きなの！？")
         (wait)
         (set-reg: 106 (+ (: 106) 1))))
       (else (<>)))
      (text #:color 2 "【亜子】私は" 0 "君の性格が好き・・・一緒にいると、どきどきするんですもの。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ、どきどきするって・・・恐い性格って事か？")
      (wait)
      (text #:color 2 "【亜子】違うの・・・" 0 "君って、人を優しくさせる魅力があるのよ。")
      (wait)
      (set-reg: 10 6)))
    ((&& (== V 2) (== N 1) (== (: 10) 6))
     (<>
      (text #:color 7 "【" 0 "】あのさあ・・・俺の事をからかってない？")
      (wait)
      (text #:color 2 "【亜子】ひどい・・・私、本気で言ってるのに。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "キスしよう") (text "セックスしよう") (text "愛を語ろう")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】キスしようぜ・・・俺の事が好きなんだろ？")
         (wait)
         (text #:color 2 "【亜子】いや・・・まだおつき合いしてないもの。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】セックスしようぜ・・・俺の事が好きなんだろ？")
         (wait)
         (text #:color 2 "【亜子】いや・・・いきなりセックスだなんて、絶対にいや。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】愛を語ろうじゃないか・・・ん？")
         (wait)
         (text #:color 2 "【亜子】似合わないわよ、" 0 "君。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】じゃあ、じゃあ・・・俺はいったいどうしたらいいんだあ！？")
      (wait)
      (text #:color 2 "【亜子】私が聞きたいわ・・・どうしたらいいの？")
      (wait)
      (set-reg: 10 7)))
    ((&& (== V 2) (== N 1) (== (: 10) 7))
     (<>
      (text #:color 7 "【" 0 "】俺とデートして、いっぱい話をして・・・そうしたらやらせてくれる？")
      (wait)
      (text #:color 2 "【亜子】いやな言い方・・・確かに" 0 "君の事は大好きだけど、今の" 0 "君じゃ駄目なの。")
      (wait)
      (text #:color 7 "【" 0 "】はあ？")
      (wait)
      (text #:color 2 "【亜子】今の" 0 "君でよかったら、こんなに悩まないわよ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】俺のどこがいけないんだよう。")
      (wait)
      (text #:color 2 "【亜子】だって・・・" 0 "君って、浮気者ですもの。")
      (wait)
      (text #:color 7 "【" 0 "】ど、どうしてえ！？・・・お、俺は、う、浮気者なんかじゃあないぜえ。")
      (wait)
      (text #:color 2 "【亜子】やたらにどもってるわよ。")
      (wait)
      (set-reg: 10 8)))
    ((&& (== V 2) (== N 1) (== (: 10) 8))
     (<>
      (text #:color 2 "【亜子】私ね、見たんだから・・・" 0 "君が他の女の子と一緒のところを。")
      (wait)
      (text #:color 7 "【" 0 "】い、いつ、誰と、何時何分だよう。")
      (wait)
      (text #:color 2 "【亜子】小学生みたいな聞き方をしないで・・・誰と歩いてたなんて、私が知ってるはずがないでしょう？")
      (wait)
      (text #:color 7 "【" 0 "】なんだ・・・亜子さんが知らない人か。")
      (wait)
      (text #:color 2 "【亜子】ほら、知らない人かって事は・・・自分で認めた事になるわね。")
      (wait)
      (text #:color 7 "【" 0 "】やだなあ、あの女性は・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "母親") (text "姉") (text "妹")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺のかあちゃんだよ。")
         (wait)
         (text #:color 2 "【亜子】よくある言い訳の仕方ね・・・" 0 "君のお母さんって、あんなに若い人だったの。")
         (wait)
         (text #:color 7 "【" 0 "】うん、５歳の時の子供なんだ・・・俺って。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】あれは俺のねーちゃんだよ・・・うんうん。")
         (wait)
         (text #:color 2 "【亜子】へえ・・・" 0 "君ってお姉さんがいたのね、いったいいつ生まれたのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】え、えーと・・・最近。")
         (wait)
         (text #:color 2 "【亜子】ふーん、最近生まれたお姉さんねえ・・・そう。")
         (wait)
         (text #:color 7 "【" 0 "】そ、そう・・・歳下のお姉さんなんだ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】あれは俺のいもうとだよ・・・うんうん。")
         (wait)
         (text #:color 2 "【亜子】よくある言い訳の仕方ね・・・" 0 "君って、妹さんと腕を組んで歩くの？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】彼女、手が長いから腕を組んでるように見えただけだよ・・・腕を伸ばすと地面についちゃうから。")
         (wait)))
       (else (<>)))
      (text #:color 2 "【亜子】めちゃくちゃな事を言わないで・・・とにかく" 0 "君は浮気者よ。")
      (wait)
      (set-reg: 10 9)))
    ((&& (== V 2) (== N 1) (== (: 10) 9))
     (<>
      (text #:color 2 "【亜子】なんだかすっきりしちゃった・・・言いたい事を言ったから。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ・・・自分だけすっきりしちゃって。")
      (wait)
      (text #:color 2 "【亜子】いいの、私は" 0 "君の何倍も悩んでいるんだから・・・" 0 "君は私の事で悩んでないもの。")
      (wait)
      (text #:color 7 "【" 0 "】俺だって悩んでるのに・・・。")
      (wait)
      (text #:color 2 "【亜子】嘘つき。")
      (wait)
      (text #:color 7 "【" 0 "】傷つくなあ・・・その言い方。")
      (wait)
      (set-reg: 10 10)))
    ((&& (== V 2) (== N 1) (== (: 10) 10) (== (: 50) 0))
     (<>
      (text #:color 2 "【亜子】浮気者の" 0 "君・・・帰らないの？")
      (wait)
      (text #:color 7 "【" 0 "】一緒に帰ろうか？")
      (wait)
      (text #:color 2 "【亜子】いや・・・" 0 "君と一緒にに歩いて、他の女の子とばったりなんて絶対にいや。")
      (wait)
      (text #:color 7 "【" 0 "】あのねえ・・・。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、先に帰って・・・私もすぐ帰るから。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 2 "【亜子】早く帰りなさいよ。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよう・・・その言い方は。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】なんだよ・・・その不満そうな顔は。")
      (wait)
      (text #:color 2 "【亜子】生まれつきこんな顔よ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】嘘つけ・・・亜子さんは、もっと愛らしい顔をしてるぜ。")
      (wait)
      (text #:color 2 "【亜子】もう・・・けなしながら、誉めないでよ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 2) (== (: 11) 1))
     (<> (text #:color 7 "【" 0 "】（ちょっと怒ったような顔も・・・それなりにかわいいな。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】亜子さんの髪って柔らかいよね・・・そよ風なのに、ゆらゆら揺れてるぜ。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君の髪って、ワイルドよね・・・ぼさぼさのようで、ぼさぼさじゃないもの。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよう・・・俺は誉めたんだぜ。")
      (wait)
      (text #:color 2 "【亜子】私だって誉めたわよ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 3) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】（本当に柔らかそうな髪だな・・・。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】おいおい、なんだよ・・・そのイジけたポーズは。")
      (wait)
      (text #:color 2 "【亜子】だって・・・こうしないと、また下着が見えちゃうもの。")
      (wait)
      (text #:color 7 "【" 0 "】一度見せたんだから、二度も同じだ・・・見せろ。")
      (wait)
      (text #:color 2 "【亜子】言っておきますけどね、私は『見せた』わけじゃないですから。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 4) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】（ちっ・・・確かにこのポーズじゃ見えないよ。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】にゃーん。")
      (wait)
      (text #:color 2 "【亜子】え？")
      (wait)
      (text #:color 7 "【" 0 "】それ、『ネコじゃらし』でしょ？")
      (wait)
      (text #:color 2 "【亜子】あはは・・・。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君のそういう所が・・・好きなの。")
      (wait)
      (set-reg: 106 (+ (: 106) 1))
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 5) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】にゃーん。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・もうウケないの？")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ・・・そのままのポーズで俺が押したら、ゴロゴロって河の中に落ちそうだな。")
      (wait)
      (text #:color 2 "【亜子】やってみなさいよ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・ごめん。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 6) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（なんか・・・寂しそうなポーズだな。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（ネコじゃらしだな・・・別名、『大人の玩具としても使える小道具』だ。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 7) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（手で握って、フニフニすると・・・手から抜け出るんだぜ。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】ここは・・・河原だぜ。")
      (wait)
      (text #:color 2 "【亜子】河の音を聞いてると・・・心が安らぐわ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 8) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（河原だ・・・俺と亜子さん以外、人影は見えない。）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】ねえねえ・・・あの水銀灯に登ったら、何かくれる？")
      (wait)
      (text #:color 2 "【亜子】あの水銀灯をあげるわ。")
      (wait)
      (text #:color 7 "【" 0 "】いらない。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 9) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】水銀灯だな・・・もちろん今の時間でついてるはずがない。") (wait)))
    ((&& (== V 1) (== N 10) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】緑色をした植物だ・・・簡単に言えば『木』かな？")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 10) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】亜子さんって・・・盆栽とかやる？")
      (wait)
      (text #:color 2 "【亜子】やらないわよ・・・変な事を聞くのね。")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】学校の回りには、フェンスがはられてる・・・。")
      (wait)
      (text #:color 2 "【亜子】私も・・・" 0 "君と一緒の学校に行きたかったな。")
      (wait)
      (text #:color 7 "【" 0 "】はあ？")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 11) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん、いったいどこの学校なんだ？")
      (wait)
      (text #:color 2 "【亜子】あのね・・・" 0 "君が通ってる学校でしょ？")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・これがそうか。")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】いい天気だ・・・俺の心のように、さわやかな空だな。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なんで黙ってるんだよう。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 12) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】いい天気だね・・・。")
      (wait)
      (text #:color 2 "【亜子】こんな日に・・二人でどこかに行きたいわ。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))