(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\の
  #\舞
  #\い
  #\な
  #\、
  #\っ
  #\て
  #\ん
  #\は
  #\う
  #\る
  #\か
  #\し
  #\に
  #\だ
  #\で
  #\た
  #\？
  #\ち
  #\を
  #\ら
  #\ゃ
  #\あ
  #\が
  #\こ
  #\そ
  #\く
  #\も
  #\れ
  #\君
  #\と
  #\！
  #\ま
  #\俺
  #\ど
  #\り
  #\よ
  #\え
  #\わ
  #\お
  #\め
  #\（
  #\）
  #\す
  #\ー
  #\さ
  #\き
  #\女
  #\子
  #\事
  #\稽
  #\古
  #\私
  #\じ
  #\ね
  #\ン
  #\合
  #\つ
  #\出)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "35.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "v.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "van.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "v.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 24)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "v.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 306) 0)
   (<>
    (text #:color 7 "【" 0 "】舞ちゃん！！")
    (wait)
    (text #:color 3 "【舞】あ・・・" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】こんな所で何をしてるの？・・・まさか、俺が住んでる場所を探してるとか？")
    (wait)
    (if (> T 1900)
      (<>
       (text #:color 7 "【" 0 "】（こんな時間に来るって事は、それなりの覚悟があるって事だぜ・・・ひっひっひっ。）")
       (wait)))
    (text #:color 3 "【舞】ううん・・・これからお茶のお稽古なの、ここが通り道なのよ。")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・舞ちゃんが俺の家を探す訳がないか、ちょっと考えすぎだったぜ。")
    (wait)
    (set-reg: 306 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 3 "【舞】私・・・まだ時間があるんだけどな。")
         (wait)
         (text #:color 7 "【" 0 "】でしょう？・・・俺もそう思ったんだ。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 3 "【舞】じゃあね、" 0 "君・・・。")
         (wait)
         (text #:color 7 "【" 0 "】ああ・・・レスリングのお稽古がんばってね。")
         (wait)
         (text #:color 3 "【舞】やだ・・・お茶のお稽古だってば。")
         (wait)
         (set-var N 5)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】舞ちゃん、公園の中に入ろうか？")
         (wait)
         (text #:color 3 "【舞】ううん・・・ここで" 0 "君と話がしたい。")
         (wait)
         (text #:color 7 "【" 0 "】でしょう？・・・俺もそう思ってたんだ。")
         (wait)))
       ((== N 3)
        (<> (text #:color 7 "【" 0 "】舞ちゃんがいなくなるまで、俺はここを動かないぞ。") (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 7 "【" 0 "】（舞ちゃんの髪が風にそよいでいる・・・すごく柔らかそうだ。）") (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 7 "【" 0 "】（舞ちゃが俺を見てるぞ・・・あの目に弱いんだ、俺は。）") (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん、そのリボンの色・・・すっごく似合ってるぜ。")
      (wait)
      (text #:color 3 "【舞】本当に？・・・うれしい。")
      (wait)))
    ((&& (== V 10) (== N 5) (== (: 10) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】"
       0
       "は、いきなり舞の首にむしゃぶりついた・・・驚いた表情をする舞、しかしすぐに目を閉じ、めくるめく快感に身体をゆだねる。")
      (wait)
      (text #:color 3 "【舞】あっ・・・。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】舞の薄いくちびるから、かわいい声がたまらず出る・・・"
       0
       "は舌をさらに這わせ、やがて舌先は舞の胸の谷間に・・・。")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・一人でぶつぶつ、どうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】えっ！？・・・あ、ああ・・・何でもないさ、ははは。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 10) (== N 5) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんの首筋をなめたい・・・でも、なめられない・・・でもなめたい・・・でも、なめられない。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・かわいいなあ、舞ちゃんの性格をよく現してる服装だぜ。")
      (wait)
      (text #:color 3 "【舞】ママが選んでくれる服って、ちょっとハデなの・・・だからこの服は自分で選んだのよ。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】・・・ごっくん。")
      (wait)
      (text #:color 3 "【舞】どうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】（でかいよな・・・絶対にでかい。）")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 7) (== (: 11) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・このふくらみは、誰の為に存在してるんだろう。）") (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんだ・・・もし二人きりでいたら、自分の欲情を押える事ができるだろうか？）")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (cond
       ((== (: 13) 0)
        (<>
         (text #:color 3 "【舞】" 0 "君こそ、公園で何をしてるの？")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】もしかして・・・女の子と待ち合わせ？")
         (wait)))
       ((== (: 13) 1)
        (<> (text #:color 3 "【舞】もう一度聞くけど・・・女の子と待ち合わせしているの？") (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "その通り") (text "絶対に違う")))
      (cond
       ((&& (== N 1) (== (: 13) 0))
        (<>
         (text #:color 7 "【" 0 "】そうだよ・・・舞ちゃんが相手にしてくれないから。")
         (wait)
         (text #:color 3 "【舞】私は・・・" 0 "君を相手にしてない訳じゃないわ。")
         (wait)
         (text #:color 7 "【" 0 "】だって・・・デートに誘っても、首を縦に振ってくれない。")
         (wait)
         (text #:color 3 "【舞】私がそうだから、他の女の子とつき合うの？・・・そういうのって、あまり好きじゃない。")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・嫌われたかな？")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】ねえ、どんな女の子？・・・私の知ってる女の子かしら？")
         (wait)
         (text #:color 7 "【" 0 "】えーと・・・教えない。")
         (wait)
         (text #:color 3 "【舞】教えてくれるまで、ここを動かないから。")
         (wait)
         (set-reg: 13 1)
         (set-reg: 111 (- (: 111) 1))))
       ((&& (== N 1) (== (: 13) 1))
        (<>
         (text #:color 7 "【" 0 "】その通り・・・って、ああ、俺は嘘つきだあ！！")
         (wait)
         (text #:color 3 "【舞】誰？")
         (wait)
         (text #:color 7 "【" 0 "】お、教えない。")
         (wait)
         (text #:color 3 "【舞】お稽古に遅刻しても・・・教えてくれるまで、ここを動かないから。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】違うよ・・・待ち合わせする女の子なんていないさ。")
         (wait)
         (text #:color 3 "【舞】本当？")
         (wait)
         (text #:color 7 "【" 0 "】舞ちゃん以外にいない。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】（うーん・・・今のはポイント高いな。）")
         (wait)
         (set-reg: 12 1)
         (set-reg: 111 (+ (: 111) 1))))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 3 "【舞】ぷっ！！")
      (wait)
      (text #:color 7 "【" 0 "】ど、どうしたの！？")
      (wait)
      (text #:color 3 "【舞】ごめんなさい・・・" 0 "君の顔を見てたら、ほら、去年の体育祭の事を思い出しちゃった。")
      (wait)
      (text #:color 7 "【" 0 "】去年の体育祭？・・・ああ、リレーの事か。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、脚が早いからアンカーで・・・でも、バトンをもらったら逆に走り出しちゃって。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・単なるウケ狙いだったんだけど。")
      (wait)
      (text #:color 3 "【舞】先生が怒って・・・" 0 "君、それでも逆に走って。")
      (wait)
      (text #:color 7 "【" 0 "】そうそう、そうしたらリレーなんかぶっ飛んじゃって、俺と先生の追っかけっこになっちまったんだ。")
      (wait)
      (text #:color 3 "【舞】はははははっ！！・・・面白かったわよね、先生達は赤鬼みたいな顔してて、" 0 "君は必死で逃げてるし。")
      (wait)
      (text #:color 7 "【" 0 "】最後はそのまま校門を出ちゃったんだよな。")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】どうしたの？")
      (wait)
      (text #:color 3 "【舞】ううん・・・いい思い出になるなって。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 1))
     (<>
      (text #:color 3 "【舞】さてと・・・私はお稽古に行かないと。")
      (wait)
      (text #:color 7 "【" 0 "】俺は・・・どこに行くんだ？")
      (wait)
      (text #:color 3 "【舞】変な" 0 "君。")
      (wait)
      (set-reg: 50 1)))
    (else (<>)))))
 (set-arr~ @ 7 1))