(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\る
  #\【
  #\】
  #\く
  #\ん
  #\な
  #\み
  #\。
  #\て
  #\っ
  #\の
  #\う
  #\、
  #\か
  #\し
  #\さ
  #\だ
  #\た
  #\ゃ
  #\を
  #\ち
  #\と
  #\に
  #\が
  #\？
  #\も
  #\あ
  #\は
  #\そ
  #\ら
  #\一
  #\哉
  #\話
  #\け
  #\事
  #\で
  #\き
  #\ど
  #\や
  #\よ
  #\お
  #\れ
  #\君
  #\ま
  #\り
  #\こ
  #\わ
  #\ー
  #\何
  #\聞
  #\め
  #\（
  #\）
  #\ね
  #\ぜ
  #\大
  #\言)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "35.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "q.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "qan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "q.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 23)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "q.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 501) 0)
   (<>
    (text #:color 6 "【くるみ】あ・・・" 0 "さんだ。")
    (wait)
    (text #:color 7 "【" 0 "】どうしたの、くるみちゃん・・・セーラー服なんか着ちゃって。")
    (wait)
    (text #:color 6 "【くるみ】うん・・・ちょっと、ね。")
    (wait)
    (text #:color 6 "【くるみ】・・・。")
    (wait)
    (text #:color 6 "【くるみ】" 0 "さん・・・最近一哉君と話ししてる？")
    (wait)
    (text #:color 7 "【" 0 "】たまに会うぜ・・・大した話はしないけど。")
    (wait)
    (text #:color 6 "【くるみ】何か聞いてない？")
    (wait)
    (text #:color 7 "【" 0 "】何を？")
    (wait)
    (text #:color 6 "【くるみ】う、うん・・・。")
    (wait)
    (set-reg: 501 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 6 "【くるみ】" 0 "さん・・・もう少し、話をしてもいい？")
         (wait)
         (text #:color 7 "【" 0 "】別にいいけど・・・暇だし。")
         (wait)
         (text #:color 6 "【くるみ】・・・ありがとう。")
         (wait)))
       ((== N 1)
        (<>
         (text #:color 6 "【くるみ】" 0 "さん、ありがとう・・・話を聞いてくれて。")
         (wait)
         (text #:color 7 "【" 0 "】いいって事よ・・・くるみちゃんは、一哉の大事な彼女だからな。")
         (wait)
         (text #:color 6 "【くるみ】だといいんだけど・・・。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあな、くるみちゃん・・・あんまり悩むとお肌に悪いぜ。")
         (wait)
         (text #:color 6 "【くるみ】うん・・・ばいばい。")
         (wait)
         (set-var N 5)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 6 "【くるみ】" 0 "さん、公園の中で話をするの？")
         (wait)
         (text #:color 7 "【" 0 "】いや・・・やっぱりここでいいや。")
         (wait)))
       ((== N 3)
        (<> (text #:color 7 "【" 0 "】（うーん・・・もう少し、くるみちゃんの話を聞くか。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 6 "【くるみ】あのね・・・最近、一哉君ったら・・・電話にも出てくれないの。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【くるみ】たまに一哉君本人が電話に出る事があって・・・そのときはお喋りしてくれるんだけど。")
      (wait)
      (text #:color 6 "【くるみ】なんか変なの・・・よそよそしいって言うか、私の話を以前ほど聞いてくれないって言うか。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん・・・一哉君って、好きな人ができたのかな？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "できた") (text "できない") (text "知らない")))
      (cond
       ((== N 1)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】一哉から話を聞いた訳じゃないけど・・・その様子から考えると、新しい彼女ができたんじゃないか？")
         (wait)
         (text #:color 6 "【くるみ】" 0 "さんも、やっぱりそう思う？")
         (wait)
         (text #:color 7 "【" 0 "】仕方がないさ・・・恋愛関係なんて、いつ壊れるかわからないものだからね。")
         (wait)
         (text #:color 6 "【くるみ】いや・・・一哉君と別れたくない。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】大丈夫さ・・・たまたま一哉の機嫌が悪かっただけだ。")
         (wait)
         (text #:color 6 "【くるみ】そうだといいけど・・・。")
         (wait)
         (text #:color 7 "【" 0 "】そうに決まってるさ・・・うん。")
         (wait)
         (text #:color 6 "【くるみ】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】（なんだか・・・くるみちゃんがかわいそうになってきたな。）")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】知らないよ・・・一哉の事は、俺よりくるみちゃんの方が知ってるはずだろ？")
         (wait)
         (text
          #:color
          6
          "【くるみ】だって、"
          0
          "さんって一哉君と仲がいいから・・・私に話せない事でも、"
          0
          "さんには話してると思って。")
         (wait)
         (text #:color 7 "【" 0 "】いいや、俺は何も聞いてないぜ。")
         (wait)
         (text #:color 6 "【くるみ】そう・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 6 "【くるみ】私・・・何か悪い事をしたのかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】あのね、くるみちゃん・・・男っていうものは、好きな女性に対して全てを求めちゃうんだぜ。")
      (wait)
      (text #:color 6 "【くるみ】全てって・・・いやらしい事を言ってるの？")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃんが、いやらしいと思ってる事も含めてさ。")
      (wait)
      (text #:color 6 "【くるみ】それをしないと、嫌われちゃうの？")
      (wait)
      (text #:color 7 "【" 0 "】い、いや・・・そうとも限らないけど。")
      (wait)
      (text #:color 6 "【くるみ】でしょ？")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 6 "【くるみ】一哉君・・・今ごろ何をしてるのかなあ？")
      (wait)
      (set-reg: 50 1)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 1))
     (<>
      (text #:color 6 "【くるみ】ごめんなさい、" 0 "さん・・・呼び止めちゃって。")
      (wait)
      (text #:color 7 "【" 0 "】そんな事はかまわないけどさ・・・とにかく元気を出せよ、な？")
      (wait)
      (text #:color 6 "【くるみ】うん・・・。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（この髪型を見てると・・・一哉がこの子に身体を求めるっていうのは、ちょっと無理があるような気がしてきたぞ。）")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃんはかわいいんだから・・・もっと自分に自信を持てばいいんだよ。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】リボンを取って、ロングヘアにしたら・・・きっと大人っぽく見えるぜ。")
      (wait)
      (text #:color 6 "【くるみ】駄目なの・・・お父さんが、学生は変な髪型をしちゃいけないって。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、そうだった・・・くるみちゃんには、お父さんっていう障害もあったんだ。）")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】もったいないなあ。")
      (wait)
      (text #:color 6 "【くるみ】何が？")
      (wait)
      (text #:color 7 "【" 0 "】その肌が自分だけの為に存在してるなんて・・・ああもったいない。")
      (wait)
      (text #:color 6 "【くるみ】この肌は私の為だけじゃなくて・・・未来のお婿さんの為にも存在してるわよ。")
      (wait)
      (text #:color 7 "【" 0 "】お婿さんねえ・・・。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<> (text #:color 7 "【" 0 "】（こういうポーズを取る女の子は、警戒心が強いんだ・・・。）") (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃん、おっぱい大きくなった？")
      (wait)
      (text #:color 6 "【くるみ】もう・・・お父さんみたいな事を言わないで。")
      (wait)
      (text #:color 7 "【" 0 "】げっ・・・そんな事を言うのか、くるみちゃんのお父さんって！？")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】（くるみちゃんだ・・・こんな小さい身体で、一生懸命悩んでるんだろなあ。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))