(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\い
  #\。
  #\美
  #\だ
  #\沙
  #\ん
  #\っ
  #\て
  #\か
  #\、
  #\の
  #\に
  #\る
  #\は
  #\た
  #\ら
  #\？
  #\よ
  #\し
  #\う
  #\と
  #\あ
  #\を
  #\れ
  #\も
  #\そ
  #\が
  #\け
  #\ー
  #\で
  #\さ
  #\ど
  #\じ
  #\親
  #\事
  #\ま
  #\ゃ
  #\言
  #\り
  #\大
  #\一
  #\人
  #\く
  #\め
  #\ち
  #\ば
  #\ろ
  #\こ
  #\行
  #\す
  #\思
  #\ぞ
  #\や
  #\俺
  #\自
  #\学
  #\き
  #\み)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "35.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "a.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "aan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "a.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 28)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "a.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 279) 0)
   (<>
    (text #:color 3 "【美沙】あれ？")
    (wait)
    (text #:color 7 "【" 0 "】なんだよ美沙・・・公園で一人遊びか？")
    (wait)
    (text #:color 3 "【美沙】そんな寂しい事をするかよ・・・ただ、前を通りかかっただけさ。")
    (wait)
    (if (> T 1900)
      (<>
       (text #:color 7 "【" 0 "】こんな時間に散歩かよ・・・まあ、美沙だったら誰も襲わないと思うけど。")
       (wait)
       (text #:color 6 "【美穂】蹴るぞ。")
       (wait)))
    (set-reg: 279 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】美沙が寂しそうだから、まだここにいてやるよ。")
         (wait)
         (text #:color 3 "【美沙】しっしっ・・・あっちに行け。")
         (wait)
         (text #:color 7 "【" 0 "】遠慮するなよう。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】じゃあな・・・暗くなると、このあたりは物騒だぜ。")
         (wait)
         (text #:color 3 "【美沙】大丈夫だよ、私の脚力があればチカンなんて目じゃないさ。")
         (wait)
         (set-var N 5)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【美沙】" 0 "こそ、一人遊びするのか？")
         (wait)
         (text #:color 7 "【" 0 "】誰が公園に入るって言ったよ。")
         (wait)
         (text #:color 3 "【美沙】あれ？・・・入ろうとしなかったか？")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】まあ・・・もうちょっといてもいいかな。")
         (wait)
         (text #:color 3 "【美沙】公園に用があるのか？")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっ・・・ない。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 3 "【美沙】そういえば・・・" 0 "のアパートは、この公園の裏だったな。")
      (wait)
      (text #:color 7 "【" 0 "】美沙、素直になった方がいいぞ・・・俺の部屋に来たいんだろ？")
      (wait)
      (text #:color 3 "【美沙】冗談じゃないよ・・・ロープで縛られて、押入れにしまわれたくない。")
      (wait)
      (text #:color 7 "【" 0 "】おいおい、俺は犯罪者か？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】美沙、俺が住んでる建物はアパートじゃないぞ・・・マンションだ。")
      (wait)
      (text #:color 3 "【美沙】どっちでもいいよ・・・。")
      (wait)
      (text #:color 3 "【美沙】・・・。")
      (wait)
      (text #:color 3 "【美沙】" 0 "は、親元から離れて一人で生活してるんだよな・・・。")
      (wait)
      (text #:color 7 "【" 0 "】同情はいらないから、たまには御飯の一つも作りに来てくれ・・・もっとも作れたらだけど。")
      (wait)
      (text #:color 3 "【美沙】同情？・・・その逆だよ、自由でいいなって思ってさ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】確かに自由だけど、一人暮らしってのは大変なんだぜ。")
      (wait)
      (text #:color 3 "【美沙】親と一緒に暮らしてれば、色々と言われるんだ・・・そっちの方が大変だよ。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ・・・親ともめてんのか？")
      (wait)
      (text #:color 3 "【美沙】もめてるって訳じゃないけどさ・・・学校を卒業して、私は体育系の大学に行きたいんだけど。")
      (wait)
      (text #:color 3 "【美沙】親がね、もう陸上はやめて・・・普通の大学に行けって。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 3 "【美沙】" 0 "さあ・・・やっぱり普通の大学に行った方がいいのかなあ？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "もちろん") (text "そんな事はない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・きっと美沙の親は、陸上をやってるから男っぽいと思ってるんじゃないか？")
         (wait)
         (text #:color 3 "【美沙】関係ないと思うけどなあ・・・。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】親の言う事はきいとくもんだぜ・・・普通の大学に行けば、親だって文句は言わない、美沙は女らしくなる。")
         (wait)
         (text #:color 3 "【美沙】だから、女らしさと陸上は関係ないって。")
         (wait)
         (set-reg: 113 (- (: 113) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】俺だったら・・・自分の好きな道を進むな。")
         (wait)
         (text #:color 3 "【美沙】でも・・・それじゃあ、親が納得しないんだ。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】親なんて文句を言う為に存在してるんだぜ・・・それに親の言う事をきいて後から後悔したら、いったい誰を責めればいいんだ？")
         (wait)
         (text #:color 3 "【美沙】まあ・・・そうだけどさあ。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】自分で選んだ道で失敗しても、自分を責めれば済む事さ・・・人のせいにするより、俺はその方がいいと思うけど。")
         (wait)
         (text #:color 3 "【美沙】うん・・・そうだよな。")
         (wait)
         (set-reg: 113 (+ (: 113) 1))))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 3 "【美沙】お前・・・たまには役に立つな。")
      (wait)
      (text #:color 7 "【" 0 "】だてに一人暮しをしてないだろ？")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 2) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】なんだか馬のシッポみたいだな。")
      (wait)
      (text #:color 3 "【美沙】だからポニーテールって言うんだろ？")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 2) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】美沙の髪は、人の首を絞められるくらい長い。") (wait)))
    ((&& (== V 1) (== N 3) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】ちょっと落ち込んでるな？")
      (wait)
      (text #:color 3 "【美沙】そうか？")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 3) (== (: 14) 1))
     (<>
      (text #:color 3 "【美沙】なんだよ・・・あんまり見ると、金を取るぞ。")
      (wait)
      (text #:color 7 "【" 0 "】さとみみたいな事を言うな。")
      (wait)
      (text #:color 3 "【美沙】さとみか・・・喫茶店でアルバイトしてるんだってな。")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 15) 0))
     (<>
      (text #:color 3 "【美沙】首に何かついてるか？")
      (wait)
      (text #:color 7 "【" 0 "】キスマーク。")
      (wait)
      (text #:color 3 "【美沙】ははは・・・蚊に刺されたんじゃないか？")
      (wait)
      (text #:color 7 "【" 0 "】お前・・・色気がないなあ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 4) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】たまにはキスマークぐらいつけてみろ。")
      (wait)
      (text #:color 3 "【美沙】いいんだよ・・・そんな事より、９月の大会をがんばらないと。")
      (wait)))
    ((&& (== V 12) (== N 5) (== (: 16) 0))
     (<>
      (text #:color 3 "【美沙】どうしてジッパーを下ろすんだよ。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 12) (== N 5) (== (: 16) 1))
     (<>
      (text #:color 3 "【美沙】変な事をしたら、承知しないからな。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、気配を感じたのか？")
      (wait)
      (text #:color 3 "【美沙】ニオイだよ。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】へえ・・・美沙でも私服を着る事があるんだ。")
      (wait)
      (text #:color 3 "【美沙】当り前だよ・・・スカートだって持ってるんだぞ。")
      (wait)
      (text #:color 7 "【" 0 "】セーラー服意外のか？")
      (wait)
      (text #:color 3 "【美沙】ふん・・・いいよ、" 0 "に見せる為に買ったんじゃないからな。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 6) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】美沙はゼンマイ仕掛なんだ。")
      (wait)
      (text #:color 3 "【美沙】何か言ったか？")
      (wait)
      (text #:color 7 "【" 0 "】なにも。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))