(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\な
  #\。
  #\っ
  #\子
  #\夏
  #\の
  #\て
  #\、
  #\に
  #\ん
  #\た
  #\う
  #\だ
  #\か
  #\し
  #\？
  #\は
  #\と
  #\よ
  #\一
  #\が
  #\君
  #\を
  #\も
  #\ら
  #\く
  #\あ
  #\で
  #\わ
  #\ゃ
  #\れ
  #\さ
  #\る
  #\そ
  #\哉
  #\じ
  #\ど
  #\け
  #\言
  #\ち
  #\！
  #\ま
  #\り
  #\行
  #\事
  #\目
  #\ー
  #\ね
  #\友
  #\達
  #\お
  #\き
  #\え
  #\ろ
  #\俺
  #\め
  #\私
  #\つ
  #\ば
  #\駄
  #\デ
  #\ト
  #\や
  #\す
  #\ぜ
  #\こ
  #\礼
  #\回
  #\ス
  #\チ
  #\彼
  #\女
  #\ょ
  #\（
  #\）
  #\方
  #\気
  #\み
  #\何
  #\見
  #\部
  #\屋
  #\遊
  #\び)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "31.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "j11.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "j11an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "j11.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 30)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "j11.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 491) 0)
   (<>
    (text #:color 2 "【夏子】あれえ・・・" 0 "君じゃない。")
    (wait)
    (text #:color 7 "【" 0 "】夏子さん・・・一哉とデートかい？")
    (wait)
    (text #:color 2 "【夏子】違うでしょ" 0 "君・・・一哉君とは友達なんだから、デートとは言わないわよ。")
    (wait)
    (text #:color 7 "【" 0 "】じゃあ、じゃあ・・・一哉と待ち合わせ？")
    (wait)
    (text #:color 2 "【夏子】違うわよ、友達を待ってるの・・・ちょっと渡したい物があって。")
    (wait)
    (text #:color 7 "【" 0 "】ふーん・・・そうなんだ。")
    (wait)
    (set-reg: 491 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 2 "【夏子】" 0 "君、もしよかったら・・・友達が来るまでお話をしない？")
         (wait)
         (text #:color 7 "【" 0 "】え？・・・別にいいけど。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 2 "【夏子】" 0 "君、一人で公園に入るの？")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ、夏子さんも一緒に入ろう。")
         (wait)
         (text #:color 2 "【夏子】だめよ・・・私は約束があるから。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】（夏子さんと話をするのはいいけど・・・いつも話ばかりでつまらないなあ。）")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【夏子】一哉君にね、友達でいようって・・・はっきり言ったのよ。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君・・・よかったのよね、はっきり言った方が。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "よくない") (text "よかった") (text "どうでもいい")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】よくないよ、あれじゃあ一哉がかわいそうだ。")
         (wait)
         (text #:color 2 "【夏子】え？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】一哉は夏子さんが好きなんだぜ・・・友達でいようって事は、あなたとは友達以上にはなれないって事だろ？")
         (wait)
         (text #:color 2 "【夏子】そうよ・・・私は友達以上になるつもりはないもの。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・一哉にとっては、はっきり言われた方がよかったのかもしれない。")
         (wait)
         (text
          #:color
          2
          "【夏子】なんだかモヤモヤしてた気分がすっきりしたわ・・・これで一哉君と会っても、変に意識しなくて済みそう。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】どうでもいいさ・・・。")
         (wait)
         (text #:color 2 "【夏子】え？")
         (wait)
         (text #:color 7 "【" 0 "】夏子さんと一哉の間の話さ・・・俺がとやかく言う事じゃない。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君ってクールなのね・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【夏子】一哉君・・・くるみちゃんとうまくいくといいわね。")
      (wait)
      (text #:color 7 "【" 0 "】なんだか、完全に第三者として言ってるなあ・・・一哉が夏子さんの事を好きなのは変わらないんだぜ。")
      (wait)
      (text #:color 2 "【夏子】大丈夫よ、一哉君だって時間がたてば・・・やっぱりくるみちゃんがいいって思うわよ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】色々と" 0 "君には迷惑をかけちゃったわね・・・今度、お礼をしたいんだけど。")
      (wait)
      (text #:color 7 "【" 0 "】いいよ、そんなの・・・一哉は俺の友達だし。")
      (wait)
      (text #:color 2 "【夏子】それじゃあ私の気が済まないの・・・ね、お礼をさせて？")
      (wait)
      (text #:color 7 "【" 0 "】（お礼って言われても・・・俺が夏子さんに望んでいる事と言えば・・・。）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (cond
       ((== (: 21) 0)
        (<> (text #:color 2 "【夏子】" 0 "君にお礼って・・・何をすればいいのかしら？") (wait)))
       ((== (: 21) 1)
        (<>
         (text #:color 2 "【夏子】もう一度聞くけど・・・今度は真面目に答えてね。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君にお礼って、何をすればいいのかしら？")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】そりゃあ・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 14) 0) (text "セックスしたい"))
        (if (== (: 15) 0) (text "掃除一回"))
        (if (== (: 13) 0) (text "デートしてくれ"))
        (if (== (: 16) 0) (text "ポコチンなめろ"))
        (if (== (: 17) 0) (text "下着をください"))
        (if (== (: 18) 0) (text "裸を見せろ"))
        (if (== (: 19) 0) (text "洗濯一回"))
        (if (== (: 20) 0) (text "何もいらない"))))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】夏子さんとセックスがしたいっ！！")
         (wait)
         (text #:color 2 "【夏子】え！？")
         (wait)
         (text #:color 7 "【" 0 "】セックスしたいっ！！")
         (wait)
         (text #:color 2 "【夏子】もう・・・馬鹿な事を言わないで。")
         (wait)
         (text #:color 7 "【" 0 "】ちぇっ・・・やっぱり駄目か。")
         (wait)
         (set-reg: 14 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】じゃあ・・・俺の部屋の掃除を一回ってのはどう？")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、男の人の部屋に行くなんて・・・だいたい" 0 "君の彼女に怒られちゃうわよ。")
         (wait)
         (text #:color 7 "【" 0 "】だから彼女なんていないってば。")
         (wait)
         (text #:color 2 "【夏子】駄目・・・部屋には行けないわ。")
         (wait)
         (set-reg: 15 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】じゃあ・・・デート一回でどう？")
         (wait)
         (text #:color 2 "【夏子】デート一回？")
         (wait)
         (text #:color 7 "【" 0 "】そうか・・・デートって言っちゃいけないんだな、つまり一緒に遊びに行くって事さ。")
         (wait)
         (text #:color 2 "【夏子】一緒に遊びに行くって・・・どこに行くの？")
         (wait)
         (text #:color 7 "【" 0 "】さあ。")
         (wait)
         (text #:color 2 "【夏子】いいわよ・・・遊びに行くぐらいだったら。")
         (wait)
         (text #:color 7 "【" 0 "】本当に？")
         (wait)
         (text #:color 2 "【夏子】でも・・・一哉君はいいの？")
         (wait)
         (text #:color 7 "【" 0 "】何が？")
         (wait)
         (text #:color 2 "【夏子】だって・・・" 0 "君と私が一緒に遊びに行ったら、彼はなんて思うかしら？")
         (wait)
         (text #:color 7 "【" 0 "】平気だよ、遊びに行くだけだろ？")
         (wait)
         (text #:color 2 "【夏子】まあ・・・そうだけど。")
         (wait)
         (text #:color 7 "【" 0 "】いつにしようかな？")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、今すぐに決めないと駄目かしら？")
         (wait)
         (text #:color 7 "【" 0 "】そんな事はないけどさ・・・。")
         (wait)
         (text #:color 2 "【夏子】じゃあ・・・場所と日時は次の機会って事でどう？")
         (wait)
         (text #:color 7 "【" 0 "】いやだ。")
         (wait)
         (text #:color 2 "【夏子】そんな事を言わないで・・・私も学校の課題が少し進まないと、スケジュールとか決められないのよ。")
         (wait)
         (text #:color 7 "【" 0 "】わかった・・・でも約束したぜ。")
         (wait)
         (set-reg: 13 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】じゃあ・・・ポコチンをなめてくれっ！！")
         (wait)
         (text #:color 2 "【夏子】はあ？")
         (wait)
         (text #:color 7 "【" 0 "】俺様のポコチンをなめろって言ってるんだようっ！！")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、冗談として聞いておくわね・・・。")
         (wait)
         (text #:color 7 "【" 0 "】ちぇっ・・・駄目か、残念だな。")
         (wait)
         (set-reg: 16 1)))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】じゃあ・・・夏子さんの下着をくれ。")
         (wait)
         (text #:color 2 "【夏子】え！？")
         (wait)
         (text #:color 7 "【" 0 "】それも洗濯したやつじゃ駄目だ・・・洗濯する前、できれば１週間ぐらいはき続けたのがいい。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君って・・・そういう趣味があったの？")
         (wait)
         (text #:color 7 "【" 0 "】いいや、ない。")
         (wait)
         (text #:color 2 "【夏子】だったら、そんな事を言うのはよしなさい。")
         (wait)
         (set-reg: 17 1)))
       ((== N 6)
        (<>
         (text #:color 7 "【" 0 "】一回でいいから、裸を見せてくれないか？")
         (wait)
         (text #:color 2 "【夏子】裸って・・・誰のかしら？")
         (wait)
         (text #:color 7 "【" 0 "】もちろん、一哉の。")
         (wait)
         (text #:color 2 "【夏子】私に頼んでも仕方がないでしょう？")
         (wait)
         (text #:color 7 "【" 0 "】間違えた、夏子さんの裸が見たい。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君・・・暑さで頭が変になっちゃたのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】ちぇっ・・・駄目か。")
         (wait)
         (set-reg: 18 1)))
       ((== N 7)
        (<>
         (text #:color 7 "【" 0 "】じゃあ・・・俺のたまりにたまった洗濯を一回ってのはどう？")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、男の人の部屋に行くなんて・・・だいたい" 0 "君の彼女に怒られちゃうわよ。")
         (wait)
         (text #:color 7 "【" 0 "】だから彼女なんていないってば。")
         (wait)
         (text #:color 2 "【夏子】駄目・・・部屋には行けないわ。")
         (wait)
         (set-reg: 19 1)))
       ((== N 8)
        (<>
         (text #:color 7 "【" 0 "】いいよ、お礼なんて・・・。")
         (wait)
         (text #:color 2 "【夏子】駄目・・・何かしないと気が済まないのよ。")
         (wait)
         (set-reg: 20 1)))
       (else (<>)))
      (set-reg: 21 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 2 "【夏子】約束したけど・・・本当にいいの？")
      (wait)
      (text #:color 7 "【" 0 "】一哉の事だろ・・・だってあいつは友達なんだぜ、文句を言う立場じゃないはずだ。")
      (wait)
      (text #:color 2 "【夏子】そうだけど・・・。")
      (wait)
      (text #:color 7 "【" 0 "】それとも、一哉を彼氏と認めるなら・・・俺は我慢してもいいぜ。")
      (wait)
      (text #:color 2 "【夏子】それはできないわ・・・それに、" 0 "君にお礼をしないと、本当に気が済まないんですもの。")
      (wait)
      (text #:color 7 "【" 0 "】だったら決まりだな、うん。")
      (wait)
      (text #:color 6 "【女の声】夏子ーっ！！")
      (wait)
      (text #:color 2 "【夏子】あ、友達が来たみたい・・・じゃあね、" 0 "君！！")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "31.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ひっひっひっ、夏子さんとデートができるぜ・・・もっとも、いつになるかわからないけど。")
      (wait)
      (text #:color 7 "【" 0 "】さてと、夏子さんがいなくなった以上、ここにいても仕方がないな・・・他の場所に行くか。")
      (wait)
      (mouse 4 49152)
      (mouse 0)
      (set-var N 14)
      (slot 1 3)
      (mes-jump "town1.mes")))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 2 "【夏子】いいでしょう？・・・私の名前にぴったりの帽子なのよ。") (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 2 "【夏子】私の髪って黒いでしょ？・・・子供の頃、よくカラス、カラスってからかわれたわ。") (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 2 "【夏子】" 0 "君って・・・ふしぎな目をしてるのね。")
      (wait)
      (text #:color 7 "【" 0 "】（違うぜ・・・俺が女性を見る時の目は、獣のような目をしてるんだ。）")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<> (text #:color 2 "【夏子】一哉君もね・・・この服を着てると、ここをチラチラ見るのよ。") (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 2 "【夏子】" 0 "君の・・・エッチ。")
      (wait)
      (text #:color 7 "【" 0 "】そうだよ・・・今ごろわかったの？")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんといい、くるみちゃんといい・・・一哉にはもったいないな。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（そうだ・・・両方とも、俺がいただいてしまおう。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))