(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\だ
  #\い
  #\美
  #\、
  #\の
  #\沙
  #\か
  #\て
  #\ん
  #\。
  #\に
  #\る
  #\っ
  #\？
  #\は
  #\し
  #\た
  #\ら
  #\よ
  #\ゃ
  #\く
  #\れ
  #\も
  #\あ
  #\が
  #\う
  #\と
  #\を
  #\け
  #\女
  #\で
  #\言
  #\じ
  #\子
  #\そ
  #\ー
  #\見
  #\！
  #\こ
  #\え
  #\ち
  #\ど
  #\ま
  #\ろ
  #\ル
  #\校
  #\部
  #\ば
  #\す
  #\行
  #\わ
  #\ぜ
  #\プ
  #\何
  #\時
  #\穂
  #\前
  #\出
  #\入
  #\め
  #\分
  #\お
  #\ヤ
  #\さ
  #\や
  #\悪
  #\中
  #\つ
  #\午
  #\ツ
  #\事)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (if (== (: 403) 1) (<> (set-reg: 404 1)))
 (if (== (: 692) 1) (<> (set-reg: 693 1)))
 (if (== (: 785) 1) (<> (set-reg: 786 1)))
 (if (== (: 793) 1) (<> (set-reg: 794 1)))
 (if (== (: 799) 1) (<> (set-reg: 800 1)))
 (if (== (: 805) 1) (<> (set-reg: 806 1)))
 (if (== (: 811) 1) (<> (set-reg: 812 1)))
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "36.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "l.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "lan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "l.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 28)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "l.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 271) 0)
   (<>
    (text #:color 3 "【美沙】" 0 "じゃないか・・・何してるんだ？")
    (wait)
    (text #:color 7 "【" 0 "】何してるんだって、ここは俺が通ってる学校だぜ・・・いてもおかしくはないだろう？")
    (wait)
    (text #:color 3 "【美沙】" 0 "が校庭にいる条件は、陸上部の『女の子』が練習してる時だけだろ？")
    (wait)
    (text #:color 7 "【" 0 "】そういえば陸上部の練習はないのかい？・・・廃部になったとか？")
    (wait)
    (text #:color 3 "【美沙】殴るぞ・・・２、３日、練習は休みなんだよ。")
    (wait)
    (text #:color 7 "【" 0 "】じゃあ美沙は、ここで何をしてるんだ？")
    (wait)
    (text #:color 3 "【美沙】ヤボ用だよ・・・美穂と一緒に学校に来たんだ。")
    (wait)
    (text #:color 7 "【" 0 "】美穂ちゃんも学校にいるんだ・・・何をしに来たんだろ？")
    (wait)
    (text #:color 3 "【美沙】さあな・・・彼女、放送部員だから、放送室に用があるって言ってたぜ・・・忘れ物でもしたんじゃないか？")
    (wait)
    (text #:color 7 "【" 0 "】美沙と美穂ちゃんって、仲がいいんだよな・・・レズじゃないか？")
    (wait)
    (text
     #:color
     3
     "【美沙】ばっかやろ、お前と一哉だって、気味が悪いくらい仲がいいじゃないか・・・もっとも私達は腐れ縁じゃないけどな。")
    (wait)
    (text #:color 7 "【" 0 "】しかし、正反対の二人だよ・・・美沙は男っぽいし、美穂ちゃんは女の子って感じだし。")
    (wait)
    (text #:color 3 "【美沙】" 0 "・・・美穂にちょっかい出すなよ、彼女は本当に純真なんだからな。")
    (wait)
    (set-reg: 271 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.> (text "外に出る") (text "中に入る") (text "プールに行く") (text "やめる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 3 "【美沙】変なやつだな、校庭を見に来ただけなのか？")
         (wait)
         (set-var N 1)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (> T 1801))
        (<> (text #:color 7 "【" 0 "】あれれ・・・校舎の門が閉まっていて、中に入れないぞ。") (wait)))
       ((&& (== N 2) (< T 829))
        (<> (text #:color 7 "【" 0 "】ちぇっ・・・確か校舎の門が開くのは、午前８時３０分からだったな。") (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】さてと・・・校舎の中に入るかな。")
         (wait)
         (text #:color 3 "【美沙】何を目的に行動してるのかわからないヤツだな・・・不気味だぜ。")
         (wait)
         (set-var N 0)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((&& (== N 3) (< T 829))
        (<>
         (text #:color 7 "【" 0 "】だめだぜ・・・プールに入れるのは、午前８時３０分から午後６時までだ。")
         (wait)))
       ((&& (== N 3) (> T 1801))
        (<>
         (text #:color 7 "【" 0 "】だめだぜ・・・プールに入れるのは、午前８時３０分から午後６時までだ。")
         (wait)))
       ((&& (== N 3) (== (: 247) 0))
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・プールに行けば、水泳部の連中がいるはずだ。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】そう言えば、あこがれの舞ちゃんも水泳部だったな・・・舞ちゃんのスクール水着を想像しただけで、ぴゅぴゅっと出ちゃいそうだ。")
         (wait)
         (text #:color 3 "【美沙】" 0 "、女の子の前で下品な事を言うな。")
         (wait)
         (text #:color 7 "【" 0 "】え！？・・・どこに女の子がいるの！？")
         (wait)
         (text #:color 3 "【美沙】とっとと行っちゃえっ！！")
         (wait)
         (slot 1 3)
         (mes-jump "pool.mes")))
       ((&& (== N 3) (== (: 247) 1) (== (: 248) 0))
        (<>
         (text #:color 7 "【" 0 "】またプールに行くのか？")
         (wait)
         (text #:color 3 "【美沙】" 0 "、いつから水泳部に入ったんだ？")
         (wait)
         (slot 1 3)
         (mes-jump "pool1.mes")))
       ((&& (== N 3) (== (: 247) 1))
        (<>
         (text #:color 7 "【" 0 "】プールに行くか・・・目の保養になるからな。")
         (wait)
         (text #:color 3 "【美沙】" 0 "の頭の中は、女の子の裸だらけだ・・・どうしてこんなヤツの事を・・・。")
         (wait)
         (text #:color 7 "【" 0 "】？？？")
         (wait)
         (text #:color 3 "【美沙】な、なんでもないよ・・・プールに行くんだろ？")
         (wait)
         (slot 1 3)
         (mes-jump "pool.mes")))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】え！？・・・まだここにいるつもりか？")
         (wait)
         (text #:color 3 "【美沙】誰に言ってんだ？")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 7) (== (: 20) 0))
     (<>
      (text #:color 3 "【美沙】何度も言うけど、美穂には手を出すなよ。")
      (wait)
      (text #:color 7 "【" 0 "】手を出すなって・・・どうして美沙に、そんな事を言われなきゃいけないんだ？")
      (wait)
      (text #:color 3 "【美沙】" 0 "・・・日頃の行動を考えてみれば、聞くまでもないだろ？")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 2) (== N 7) (== (: 20) 1))
     (<>
      (text #:color 3 "【美沙】" 0 "から『女好きでスケベ』って部分を除けば、そんなに悪いヤツじゃないんだけどな。")
      (wait)
      (text #:color 7 "【" 0 "】含めても悪いヤツじゃないぞ。")
      (wait)
      (text #:color 3 "【美沙】・・・はあ。")
      (wait)
      (text #:color 7 "【" 0 "】ため息をつくな、ため息を。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】なあ・・・リボンを解いたら、どんな髪型になるんだ？")
      (wait)
      (text #:color 3 "【美沙】それは未来の彼氏だけに見せるんだ・・・だから" 0 "は一生見れないな。")
      (wait)
      (text #:color 7 "【" 0 "】ちくしょう。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 8) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】髪だけは奇麗だな・・・サラダオイルでも塗ってるのか？")
      (wait)
      (text #:color 3 "【美沙】髪だけって言い方はよせよ・・・自分でも、ちょっとはかわいいと思ってるんだから。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】美沙はさ、顔も悪くないんだから・・・もう少し俺に優しくしたらどうだ？")
      (wait)
      (text #:color 3 "【美沙】あのねえ・・・顔が悪くないなんて屈曲した言い方をしないで、素直にかわいいって言えよ。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 9) (== (: 22) 1))
     (<>
      (text #:color 7 "【" 0 "】なんだよ・・・。")
      (wait)
      (text #:color 3 "【美沙】別に・・・ただ見てるだけじゃないか。")
      (wait)
      (text #:color 7 "【" 0 "】恐いんだよ。")
      (wait)
      (text #:color 3 "【美沙】それは、" 0 "にやましい事があるからさ・・・私の澄んだ目で見られると、心苦しくなるんだろ？")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】首だけは女の子してるよな。")
      (wait)
      (text #:color 3 "【美沙】ケンカ売ってるか？")
      (wait)
      (text #:color 7 "【" 0 "】売ってない。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 10) (== (: 23) 1))
     (<> (text #:color 3 "【美沙】なんだよ・・・ジロジロ見るなよ。") (wait)))
    ((&& (== V 1) (== N 11) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】なんだか、胸の谷間が見えそうだぜ。")
      (wait)
      (text #:color 3 "【美沙】" 0 "だから気づくんだよ・・・他の男の子はそんなにジロジロ見ないぜ。")
      (wait)
      (text #:color 7 "【" 0 "】本当は俺に見てもらいたいんだろう？")
      (wait)
      (text #:color 3 "【美沙】本当は、" 0 "以外の男の子に見てもらいたいんだ。")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・そう。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 11) (== (: 24) 1))
     (<>
      (text #:color 3 "【美沙】" 0 "・・・いつもそんな所ばかり見てるのか？")
      (wait)
      (text #:color 7 "【" 0 "】まあね。")
      (wait)
      (text #:color 3 "【美沙】いやらしいな・・・って、今さら言う言葉じゃないか。")
      (wait)))
    ((&& (== V 9) (== N 12) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】美沙・・・どうすれば、こんなに胸が腫れるんだ？")
      (wait)
      (text #:color 3 "【美沙】きゃああああああっ！！")
      (wait)
      (text #:color 7 "【" 0 "】美沙・・・女の子みたいな声を出すなよ。")
      (wait)
      (text #:color 3 "【美沙】お、お前・・・自分のしてる事がわかってるか！？")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 9) (== N 12) (== (: 25) 1))
     (<>
      (text #:color 3 "【美沙】よ、よせっ！！")
      (wait)
      (text #:color 7 "【" 0 "】よせと言われると、ますます触りたくなるんだ・・・わかるか？")
      (wait)
      (text #:color 3 "【美沙】じゃあ触ってくれ。")
      (wait)
      (text #:color 7 "【" 0 "】触ってくれと言われて、拒む男はいないだろう。")
      (wait)
      (text #:color 3 "【美沙】とにかく触るなっ！！")
      (wait)
      (set-reg: 25 2)))
    ((&& (== V 9) (== N 12) (== (: 25) 2))
     (<>
      (text #:color 3 "【美沙】・・・刺すぞ。")
      (wait)
      (text #:color 7 "【" 0 "】おー、恐い。")
      (wait)))
    ((&& (== V 1) (== N 13) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】セーラー服を着てると、フツーの女の子に見えるんだけどな。")
      (wait)
      (text #:color 3 "【美沙】着てなくても、普通の女の子だよ。")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 13) (== (: 26) 1))
     (<>
      (text #:color 7 "【" 0 "】美沙だな・・・全身筋肉の、バッタみたいな女の子だ。")
      (wait)
      (text #:color 3 "【美沙】誰がバッタだって？")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・聞こえた？")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))