(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\だ
  #\。
  #\の
  #\い
  #\に
  #\る
  #\う
  #\、
  #\校
  #\は
  #\か
  #\ー
  #\っ
  #\も
  #\ル
  #\こ
  #\あ
  #\ん
  #\て
  #\プ
  #\た
  #\が
  #\ゃ
  #\く
  #\れ
  #\？
  #\ち
  #\ら
  #\入
  #\行
  #\０
  #\り
  #\学
  #\中
  #\そ
  #\と
  #\で
  #\ま
  #\時
  #\ト
  #\庭
  #\ぞ
  #\美
  #\穂
  #\舎
  #\午)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (if (== (: 403) 1) (<> (set-reg: 404 1)))
 (if (== (: 692) 1) (<> (set-reg: 693 1)))
 (if (== (: 785) 1) (<> (set-reg: 786 1)))
 (if (== (: 793) 1) (<> (set-reg: 794 1)))
 (if (== (: 799) 1) (<> (set-reg: 800 1)))
 (if (== (: 805) 1) (<> (set-reg: 806 1)))
 (if (== (: 811) 1) (<> (set-reg: 812 1)))
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "36.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (if (== (: 835) 0)
   (<> (sound 1) (set-var I 50) (proc 26) (set-reg: 835 1) (set-reg: 836 0)))
 (set-arr~ @ 7 0)
 (load "36.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 272) 0)
   (<> (text #:color 7 "【" 0 "】誰もいない校庭か・・・シュールだなあ。") (wait) (set-reg: 272 1)))
  ((== (: 272) 1)
   (<> (text #:color 7 "【" 0 "】誰もいない・・・なんだか寂しい気分になってきちゃうぞ。") (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.> (text "外に出る") (text "中に入る") (text "プールに行く") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 274) 1) (== (: 277) 0))
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・外に出よう。")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "18.pd8")
         (proc 15)
         (set-arr~ @ 6 1)
         (image "m.pd8")
         (proc 16)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "man.pd8")
         (set-arr~ @ 6 0)
         (set-arr~ @ 7 0)
         (load "m.s4" (~ @ 2))
         (animate 0 0 0)
         (animate 1 0)
         (set-arr~ @ 7 0)
         (sound 1)
         (set-var I 27)
         (proc 26)
         (set-reg: 835 0)
         (text #:color 7 "【" 0 "】あれれ！？・・・美穂ちゃんも帰るの？")
         (wait)
         (text #:color 6 "【美穂】あのね・・・ちょっと言いたい事があって、ここで" 0 "君を待ってたの。")
         (wait)
         (text #:color 7 "【" 0 "】俺を？")
         (wait)
         (text #:color 6 "【美穂】えーと・・・。")
         (wait)
         (text #:color 7 "【" 0 "】へ？")
         (wait)
         (text #:color 6 "【美穂】あの・・・。")
         (wait)
         (text #:color 7 "【" 0 "】なに？")
         (wait)
         (text #:color 6 "【美穂】ううん、もういいの・・・さよなら。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・。")
         (wait)
         (set-reg: 277 1)
         (set-reg: 278 1)
         (set-reg: 309 0)
         (set-var N 1)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&&
         (== N 1)
         (== (: 292) 1)
         (== (: 288) 1)
         (> T 900)
         (< T 1800)
         (== (: 293) 0))
        (<>
         (text #:color 7 "【" 0 "】帰ろうかな・・・。")
         (wait)
         (set-reg: 309 0)
         (slot 1 3)
         (mes-jump "gate2.mes")))
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】退屈だな・・・他の場所に行こうぜ。")
         (wait)
         (set-reg: 309 0)
         (set-var N 1)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (> T 1801))
        (<> (text #:color 7 "【" 0 "】あれれ・・・校舎の門が閉まっていて、中に入れないぞ。") (wait)))
       ((&& (== N 2) (< T 829))
        (<> (text #:color 7 "【" 0 "】ちぇっ・・・確か校舎の門が開くのは、午前８時３０分からだったな。") (wait)))
       ((&& (== N 2) (== (: 223) 1))
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・校舎の中に入るか。")
         (wait)
         (set-var N 0)
         (slot 1 3)
         (mes-jump "gakko1.mes")))
       ((&& (== N 3) (< T 829))
        (<>
         (text #:color 7 "【" 0 "】だめだぜ・・・プールに入れるのは、午前８時３０分から午後６時までだ。")
         (wait)))
       ((&& (== N 3) (> T 1801))
        (<>
         (text #:color 7 "【" 0 "】だめだぜ・・・プールに入れるのは、午前８時３０分から午後６時までだ。")
         (wait)))
       ((&& (== N 3) (== (: 247) 0))
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・プールに行けば、水泳部の連中がいるはずだ。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】そう言えば、あこがれの舞ちゃんも水泳部だったな・・・舞ちゃんのスクール水着を想像しただけで、ぴゅぴゅっと出ちゃいそうだ。")
         (wait)
         (slot 1 3)
         (mes-jump "pool.mes")))
       ((&& (== N 3) (== (: 247) 1) (== (: 248) 0))
        (<>
         (text #:color 7 "【" 0 "】またプールに行くのか？")
         (wait)
         (slot 1 3)
         (mes-jump "pool1.mes")))
       ((&& (== N 3) (== (: 248) 1) (> H 811) (== (: 305) 0) (== (: 309) 0))
        (<>
         (text #:color 7 "【" 0 "】プールに行くんだな・・・そうだ、俺はプールに行きたかったんだ。")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (set-arr~ @ 9 (&& (~ @ 9) 65534))
         (image "51.pd8")
         (set-arr~ @ 9 (// (~ @ 9) 1))
         (proc 9)
         (set-arr~ @ 7 0)
         (text #:color 7 "【" 0 "】舞ちゃんは・・・いないのかな？")
         (wait)
         (text #:color 3 "【舞】" 0 "君！！")
         (wait)
         (slot 1 3)
         (mes-jump "pool2.mes")))
       ((&& (== N 3) (== (: 247) 1))
        (<>
         (text #:color 7 "【" 0 "】プールに行くか・・・目の保養になるからな。")
         (wait)
         (slot 1 3)
         (mes-jump "pool.mes")))
       ((== N 4) (<> (text #:color 7 "【" 0 "】え！？・・・まだここにいるつもりか？") (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】ほほう・・・これはベットの代わりになるな。")
      (wait)
      (text #:color 7 "【" 0 "】学校の校庭で、かわいい女の子と・・・こりゃあ、興奮するぜ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 1) (== N 1) (== (: 10) 1))
     (<> (text #:color 7 "【" 0 "】マットだな・・・中にはスポンジが入っているんだ。") (wait)))
    ((&& (== V 1) (== N 2) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】ハイ・ジャンプのポールだな・・・鉄棒じゃないぞ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 2) (== (: 11) 1))
     (<> (text #:color 7 "【" 0 "】ハイ・ジャンプのポールだ。") (wait)))
    ((&& (== V 1) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】校庭のトラックだ・・・２００メートルはあるな。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 3) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】２００メートルのトラックだ。") (wait)))
    ((&& (== V 1) (== N 4) (== (: 13) 0))
     (<> (text #:color 7 "【" 0 "】学校の正面玄関だな・・・。") (wait) (set-reg: 13 1)))
    ((&& (== V 1) (== N 4) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】だから、学校の正面玄関だってば。") (wait)))
    ((&& (== V 1) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】俺が通っている学校だ・・・男女共学だし、校則も厳しいほうじゃない。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 5) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】４階建ての校舎だ・・・生徒数のあまり多くない。") (wait)))
    ((&& (== V 1) (== N 6) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】金網の柵の向こうには、住宅地だ・・・このあたりは夜になると、物騒な雰囲気なんだよなあ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 6) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】学校の周りには、家並が続いている・・・。") (wait)))
    ((&& (== V 1) (== N 7) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】屋上だな・・・校舎の中に入らないと、ここにたどり着く事はできないぞ。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 7) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】学校の屋上だ・・・今は誰もいないだろう。") (wait)))
    ((&& (== V 1) (== N 8) (> T 1900))
     (<> (text #:color 7 "【" 0 "】空はもう暗くなっている・・・夜だもんな。") (wait)))
    ((&& (== V 1) (== N 8) (< T 600))
     (<> (text #:color 7 "【" 0 "】空はもう暗くなっている・・・夜だもんな。") (wait)))
    ((&& (== V 1) (== N 8))
     (<> (text #:color 7 "【" 0 "】空だな・・・今日も天気がいい。") (wait)))
    ((&& (== V 1) (== N 9) (== (: 17) 0))
     (<> (text #:color 7 "【" 0 "】校庭だな・・・誰もいないぞ。") (wait) (set-reg: 17 1)))
    ((&& (== V 1) (== N 9) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】校庭だ・・・俺がここを利用するのは、体育の授業の時ぐらいだ。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))