(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\だ
  #\な
  #\。
  #\い
  #\っ
  #\の
  #\、
  #\！
  #\て
  #\ん
  #\た
  #\し
  #\る
  #\は
  #\か
  #\う
  #\に
  #\美
  #\が
  #\ら
  #\も
  #\ど
  #\？
  #\と
  #\ぜ
  #\よ
  #\を
  #\沙
  #\教
  #\そ
  #\く
  #\穂
  #\れ
  #\で
  #\俺
  #\ー
  #\み
  #\室
  #\学
  #\こ
  #\ち
  #\何
  #\あ
  #\ま
  #\３
  #\年
  #\え
  #\ゃ
  #\や
  #\言
  #\机
  #\夏
  #\休)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "37.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "37.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 244) 0) (<> (text #:color 7 "【" 0 "】ここは３年Ｄ組だ・・・俺様の教室だぜ。") (wait)))
  ((&& (== (: 324) 1) (== (: 685) 0))
   (<>
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】そうだよ・・・俺は本を取りに来たんだったな。")
    (wait)
    (text #:color 7 "【" 0 "】えーと、無修正ぱくぱくの本は・・・本は・・・本は？")
    (wait)
    (text #:color 7 "【" 0 "】な、ないっ！？")
    (wait)
    (text #:color 7 "【" 0 "】ちっくしょうっ・・・誰だよ、勝手に持って行ったのは！？")
    (wait)
    (text #:color 6 "どたどたどたどたっ！！")
    (wait)
    (text #:color 7 "【" 0 "】な、なんだ！？")
    (wait)
    (text #:color 3 "【美沙】" 0 "っ！！")
    (wait)
    (text #:color 7 "【" 0 "】み、美沙！？")
    (wait)
    (slot 1 8)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "l03.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "l03an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "l03.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 28)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 3 "【美沙】おいっ！！美穂に何したんだよっ！！")
    (wait)
    (text #:color 7 "【" 0 "】え！？")
    (wait)
    (text #:color 3 "【美沙】え！？じゃないぜっ・・・美穂に何をしたって聞いてるんだ！！")
    (wait)
    (text #:color 7 "【" 0 "】（げげっ！？・・・美穂ちゃん、映画館の事を美沙に話したのか！？）")
    (wait)
    (text #:color 3 "【美沙】美穂のやつ、様子が変なんだよっ・・・泣きながら電話をかけてくるし、理由を聞いても何も言わないしっ！！")
    (wait)
    (text #:color 7 "【" 0 "】（ほっ・・・美穂ちゃんは何も言ってないようだぞ。）")
    (wait)
    (text #:color 3 "【美沙】美穂があんなになるのは、" 0 "が原因としか考えられないぜっ！？")
    (wait)
    (text #:color 7 "【" 0 "】お、おい・・・どうして俺が原因だってわかるんだ！？")
    (wait)
    (text #:color 3 "【美沙】そ、それは・・・その・・・。")
    (wait)
    (text #:color 7 "【" 0 "】なんだよ。")
    (wait)
    (text #:color 3 "【美沙】だから、それは・・・美穂が・・・。")
    (wait)
    (text #:color 7 "【" 0 "】美穂ちゃんが・・・なんだ？")
    (wait)
    (text #:color 3 "【美沙】う、うるさいっ！！・・・とにかく美穂を悲しませたら、私が承知しなんいんだからっ！！")
    (wait)
    (slot 1 3)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "37.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 19)
    (proc 26)
    (set-reg: 836 1)
    (text #:color 6 "どたどたどたどたどたっ！！")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】うーん・・・嵐は去ったようだな。")
    (wait)
    (set-reg: 685 1)))
  ((== (: 244) 1)
   (<> (text #:color 7 "【" 0 "】３年Ｄ組だな・・・教室の中は静まり返ってる。") (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "やめる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・一人で教室にいてもつまらないや。")
         (wait)
         (text #:color 7 "【" 0 "】他の場所に行こうぜ・・・と言っても、誰もいないかもしれないけど。")
         (wait)
         (set-reg: 244 1)
         (set-var N 2)
         (slot 1 3)
         (mes-jump "gakko4.mes")))
       ((== N 2)
        (<> (text #:color 7 "【" 0 "】そうだな・・・誰もいない教室ってのも、いいもんだぜ。") (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】俺の机だよ・・・机の上はいたずら書きだらけだ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 1) (== N 1) (== (: 10) 1))
     (<> (text #:color 7 "【" 0 "】だから俺の机だって・・・。") (wait)))
    ((&& (== V 1) (== N 2) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】机がたくさん並んでいる・・・ちょうど、男女が半分づつのクラスだ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 2) (== (: 11) 1))
     (<> (text #:color 7 "【" 0 "】机が並んでいる・・・みんな最後の夏休みをエンジョイしてるかな？") (wait)))
    ((&& (== V 1) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】教壇だぜ・・・ちなみに俺達のクラスの担任は、芹沢先生だ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 3) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】教壇だな・・・。") (wait)))
    ((&& (== V 1) (== N 4) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】黒板消しだ・・・夏休みの間は、誰も使う事はないだろう。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 4) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】黒板消しだな・・・。") (wait)))
    ((&& (== V 1) (== N 5) (== (: 14) 0))
     (<> (text #:color 7 "【" 0 "】黒板だな・・・当然、何も書かれてない。") (wait) (set-reg: 14 1)))
    ((&& (== V 1) (== N 5) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】黒板にいたずら書きをするほど、子供じゃない・・・。") (wait)))
    ((&& (== V 1) (== N 6) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】夏休みの過ごし方・・・と書いてある貼紙だ。")
      (wait)
      (text #:color 7 "【" 0 "】学校という所は、どうして全てをマニュアルにしたがるんだろう？")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 6) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】夏休みの過ごし方か・・・それぞれが勝手に決める事だ。") (wait)))
    ((&& (== V 1) (== N 7) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】２学期以降の予定表だ・・・見る気もしないな。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 7) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】２学期以降の予定表だ・・・体育祭、修学旅行、色々とあるぜ。")
      (wait)
      (text #:color 7 "【" 0 "】そして・・・来年の３月には卒業かあ。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 17) 0))
     (<> (text #:color 7 "【" 0 "】フェルトが貼ってあるボードだぜ・・・。") (wait) (set-reg: 17 1)))
    ((&& (== V 1) (== N 8) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】ボードだな・・・ずっとこのままだから、もう見飽きたぜ。") (wait)))
    ((&& (== V 1) (== N 9) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】時間割が貼ってある・・・月曜から土曜までびっしりだ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 9) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】時間割だぜ・・・夏休みの時ぐらい忘れたい。") (wait)))
    ((&& (== V 1) (== N 10) (== (: 19) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】いかにも、学校御用達って感じのスピーカーだな・・・どうせだったら『ＢＯＳＥ』ぐらいつければいいのに。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 10) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】スピーカーだ・・・死んでもハイファイでサラウンドなんて言えない。") (wait)))
    ((&& (== V 1) (== N 11) (== (: 20) 0))
     (<> (text #:color 7 "【" 0 "】蛍光灯が天井からぶら下がってる・・・。") (wait) (set-reg: 20 1)))
    ((&& (== V 1) (== N 11) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】蛍光灯をぼんやり見ていると・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】別に何も思い浮かばないな・・・ははは。")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】俺が学業に励んでる教室だよ・・・と、自分で言ってておかしくなってくる。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】この教室・・・いや、この学校とも、来年の３月でさよならか。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 12) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】３年Ｄ組・・・俺達の教室だ。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))