(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\。
  #\美
  #\穂
  #\【
  #\】
  #\い
  #\っ
  #\の
  #\あ
  #\ん
  #\し
  #\な
  #\、
  #\に
  #\る
  #\て
  #\が
  #\う
  #\か
  #\を
  #\は
  #\た
  #\！
  #\き
  #\俺
  #\だ
  #\ら
  #\く
  #\君
  #\と
  #\そ
  #\よ
  #\も
  #\ろ
  #\ぺ
  #\れ
  #\り
  #\で
  #\や
  #\ま
  #\め
  #\す
  #\好
  #\ゃ
  #\彼
  #\女
  #\こ
  #\分
  #\ち
  #\わ
  #\さ
  #\え
  #\部
  #\私
  #\体
  #\け
  #\乳
  #\首
  #\事
  #\出
  #\ン
  #\身
  #\大
  #\み
  #\じ
  #\腰
  #\つ
  #\中
  #\持
  #\ぐ
  #\ピ
  #\ク
  #\上
  #\お
  #\（
  #\）
  #\物)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "m02.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "m02an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "m02.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 56)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "m01.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (set-reg: 331 0)
 (if (== (: 710) 1)
   (<>
    (text #:color 6 "【美穂】だめ・・・恥ずかしい。")
    (wait)
    (text #:color 7 "美穂の全てがあらわになった・・・俺は興奮を押さえながら、さらに愛撫を続ける。")
    (wait)
    (text #:color 6 "【美穂】んん・・・。")
    (wait)
    (text #:color 7 "俺は胸に手を触れ、乳首を指でつまむ。美穂のかわいい乳首を、指の中で持て遊ぶ。")
    (wait)
    (text #:color 6 "【美穂】あ・・・。")
    (wait)
    (text #:color 7 "乳首が少し大きくなる。俺は唇で乳首をくわえ、わざと音がするように吸ってみる。")
    (wait)
    (text #:color 6 "【美穂】あん・・・" 0 "君・・・。")
    (wait)
    (text #:color 6 "【美穂】け、健二君の事なんか・・・本当は好きじゃないの。")
    (wait)
    (text
     #:color
     7
     "舌先で乳首をころがしながら、俺の手は美穂の大事な部分をまさぐる。濡れたその部分は誰かに触られるのを待っていたかのように、ぴくぴくと脈打っている。")
    (wait)
    (text #:color 6 "【美穂】あんっ・・・いやあ。")
    (wait)
    (text #:color 6 "【美穂】私が・・・好きなのは・・・あんっ・・・" 0 "君だけ。")
    (wait)
    (text #:color 7 "乳首から口を離し、俺は美穂のその部分を観察する事にした。")
    (wait)
    (text #:color 7 "・・・。")
    (wait)
    (text #:color 7 "うーん・・・ピンク色だ。")
    (wait)
    (text
     #:color
     7
     "かわいらしい感じすらするその部分は、ピンク色に染まっている。かげりは薄く、その部分を覆い隠すものは何もない感じだ。")
    (wait)
    (text #:color 6 "【美穂】いや・・・。")
    (wait)
    (text #:color 7 "ピンクの谷間の両側が、もっこりと盛り上がっている・・・そのアンバランスさが妙にいやらしい。")
    (wait)
    (text #:color 6 "【美穂】見ないで・・・。")
    (wait)
    (text #:color 7 "そっと指を触れてみる・・・美穂の身体がびくっと震えた。")
    (wait)
    (text #:color 6 "【美穂】" 0 "君・・・この格好、なんだか・・・恥ずかしい。")
    (wait)
    (text #:color 7 "俺は軽くうなずくと、彼女の身体を軽々と抱き上げる。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "kuro.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (text #:color 6 "【美穂】きゃっ・・・。")
    (wait)
    (text #:color 7 "そして、少しだけ乱暴にベットの上に仰向けに降ろした。そして、美穂の手を持ち彼女自身のふとももを持たせる。")
    (wait)
    (text #:color 6 "【美穂】いやあ・・・見えちゃう。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "m01.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "m01an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "m01.s4" (~ @ 2))
    (set-arr~ @ 7 0)
    (animate 0 8 1)
    (animate 4 8)
    (text #:color 7 "電気は消してない・・・彼女の秘められた部分は、おしげもなく見せられている。")
    (wait)
    (text #:color 6 "【美穂】さっきより・・・もっと恥ずかしい。")
    (wait)
    (text #:color 7 "俺はその言葉を無視して、彼女の身体を再び愛撫し始めた。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (set-reg: 331 (+ (: 331) 1))
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "おなにいする")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】（しこしこしこしこ・・・。）")
         (wait)
         (text #:color 7 "【" 0 "】（なんだかむなしいぞ・・・よそうぜ。）")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<> (text #:color 7 "【" 0 "】（あのなあ・・・目の前に美穂ちゃんがいるんだぞ！？）") (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 1) (== (: 11) 0))
     (<> (text #:color 6 "【美穂】ん・・・んんっ。") (wait) (set-reg: 11 1)))
    ((&& (== V 7) (== N 1) (== (: 11) 1))
     (<> (text #:color 6 "【美穂】ん・・・。") (wait) (set-reg: 11 2)))
    ((&& (== V 7) (== N 1) (== (: 11) 2))
     (<> (text #:color 6 "【美穂】・・・好き。") (wait)))
    ((&& (== V 7) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 6 "【美穂】あ・・・。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君って・・・優しい。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 7) (== N 3) (== (: 12) 1))
     (<> (text #:color 6 "【美穂】" 0 "君・・・美穂の事、嫌いにならないでね。") (wait)))
    ((&& (== V 10) (== N 2) (== (: 13) 0))
     (<> (text #:color 6 "【美穂】いやいやっ・・・か、感じちゃう。") (wait) (set-reg: 13 1)))
    ((&& (== V 10) (== N 2) (== (: 13) 1))
     (<> (text #:color 6 "【美穂】ああん・・・。") (wait) (set-reg: 13 2)))
    ((&& (== V 10) (== N 2) (== (: 13) 2))
     (<> (text #:color 6 "【美穂】んっ・・・んっ・・・。") (wait)))
    ((&& (== V 8) (== N 4) (== (: 14) 0))
     (<> (text #:color 6 "【美穂】" 0 "君・・・大好きなの。") (wait) (set-reg: 14 1)))
    ((&& (== V 8) (== N 4) (== (: 14) 1))
     (<> (text #:color 6 "【美穂】あ・・・んんっ。") (wait)))
    ((&& (== V 11) (== N 5) (== (: 15) 0))
     (<> (text #:color 6 "【美穂】きゃっ・・・やだあ。") (wait) (set-reg: 15 1)))
    ((&& (== V 11) (== N 5) (== (: 15) 1))
     (<>
      (text #:color 6 "【美穂】いやあ・・・んっ・・・。")
      (wait)
      (text #:color 6 "【美穂】乳首を・・・噛まないでえ。")
      (wait)
      (set-reg: 15 2)))
    ((&& (== V 11) (== N 5) (== (: 15) 2))
     (<> (text #:color 6 "【美穂】あんん・・・。") (wait) (set-reg: 15 3)))
    ((&& (== V 11) (== N 5) (== (: 15) 3))
     (<> (text #:color 6 "【美穂】へ、変な気持ち・・・なの。") (wait) (set-reg: 15 4)))
    ((&& (== V 11) (== N 5) (== (: 15) 4))
     (<> (text #:color 6 "【美穂】" 0 "君・・・いや・・・。") (wait)))
    ((&& (== V 9) (== N 6) (== (: 16) 0))
     (<> (text #:color 6 "【美穂】ああんっ・・・私の胸って・・・小さいの。") (wait) (set-reg: 16 1)))
    ((&& (== V 9) (== N 6) (== (: 16) 1))
     (<> (text #:color 6 "【美穂】" 0 "君に・・・大きくして欲しい。") (wait) (set-reg: 16 2)))
    ((&& (== V 9) (== N 6) (== (: 16) 2))
     (<> (text #:color 6 "【美穂】あは・・・んん。") (wait) (set-reg: 16 3)))
    ((&& (== V 9) (== N 6) (== (: 16) 3))
     (<> (text #:color 6 "【美穂】んんっ・・・ん・・・。") (wait)))
    ((&& (== V 10) (== N 7) (> (: 331) 14))
     (<>
      (text #:color 6 "【美穂】ああっ・・・いやっ・・・もうぐじょぐじょなのお！！")
      (wait)
      (text #:color 7 "【" 0 "】ぺろぺろぺろぺろっ！！")
      (wait)
      (text #:color 6 "【美穂】あ、あんっ・・・そ、そこばっかり・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ぺろぺろぺろぺろっ！！")
      (wait)
      (text #:color 6 "【美穂】" 0 "君っ・・・もう・・・いやあっ！！")
      (wait)
      (text #:color 7 "【" 0 "】ぺろぺろぺろぺろっ！！")
      (wait)
      (text #:color 6 "【美穂】きてえ・・・私と一緒になってえ。")
      (wait)
      (set-arr~ @ 7 0)
      (load "m01a.a6" 47104)))
    ((&& (== V 10) (== N 7) (== (: 17) 0))
     (<>
      (text #:color 6 "【美穂】ああっ！！")
      (wait)
      (text #:color 6 "【美穂】だ、だめえ・・・汚いわ・・・" 0 "君。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 10) (== N 7) (== (: 17) 1))
     (<>
      (text #:color 6 "【美穂】いやっ・・・そんな事しちゃ。")
      (wait)
      (text #:color 6 "【美穂】だめだった・・・ら・・・んんんっ！！")
      (wait)
      (set-reg: 17 2)))
    ((&& (== V 10) (== N 7) (== (: 17) 2))
     (<>
      (text #:color 6 "【美穂】あんんっ・・・" 0 "君の舌が・・・私の・・・ああんっ！！")
      (wait)
      (set-reg: 17 3)))
    ((&& (== V 10) (== N 7) (== (: 17) 3))
     (<>
      (text #:color 6 "【美穂】んんんっ・・・も、もう・・・。")
      (wait)
      (text #:color 6 "【美穂】いやいやあっ・・・ああ・・・あ・・・。")
      (wait)))
    ((&& (== V 12) (== N 7))
     (<>
      (text #:color 6 "【美穂】あっ・・・。")
      (wait)
      (text #:color 7 "俺は美穂の右脚をまたぐようにして座り、彼女のその部分に自分の物を押し当てる。")
      (wait)
      (text #:color 6 "【美穂】は、初めてだから・・・優しく・・・して。")
      (wait)
      (text #:color 7 "ピンク色の丘の間に俺の塊が割って入る。谷間はさらに広がり、俺の固くなった塊を飲み込んでいく。")
      (wait)
      (text #:color 6 "【美穂】い・・・痛い・・・。")
      (wait)
      (text
       #:color
       7
       "美穂が俺にしがみついてくる。俺は美穂の唇にキスをしながら、自分の腰を彼女の股に密着するようにした。なま暖かい感触が、俺の固くなった物全体を包み込む。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君のが・・・私の中に・・・うれしい。")
      (wait)
      (text #:color 7 "彼女の目には、うっすらと涙が浮かんでいる。俺は美穂をしっかりと抱きしめながら、ゆっくりと腰を動かし始めた。")
      (wait)
      (text #:color 6 "【美穂】うっ・・・あっ・・・。")
      (wait)
      (text #:color 7 "俺の腰が動くたびに彼女の顎が上がる・・・まだ痛いのだろうか？")
      (wait)
      (text #:color 6 "【美穂】い、いいの・・・" 0 "君・・・もっと・・・。")
      (wait)
      (text
       #:color
       7
       "俺は続けて腰を動かす・・・奥深く入るたびに、彼女の身体が弓なりにそる。乳首は突起し、頬がピンク色に染まっている。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・好き・・・好きよ。")
      (wait)
      (text #:color 7 "彼女の中から、熱い蜜があふれ出ているのがわかる。きゃしゃな身体に比例して、美穂のその部分は小さいようだ。")
      (wait)
      (text #:color 6 "【美穂】あ・・・あっ・・・ん・・・あっ・・・。")
      (wait)
      (text #:color 7 "彼女の口からは、うわごとのような声がもれ始めた。俺にしがみつき、背中に爪を立てる。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・" 0 "君・・・。")
      (wait)
      (text #:color 7 "俺は身体を起こし、さらに奥深く入るような体位をとる。先の方が、何かに当たっているようだ。")
      (wait)
      (text #:color 6 "【美穂】あっ・・・そこは・・・いいっ・・・。")
      (wait)
      (text
       #:color
       7
       "俺はだんだんと興奮してきた・・・彼女の内側が俺の固い物をしめつける。まるで、俺の物を外に追い出すようにうごめいてる。")
      (wait)
      (text #:color 7 "【" 0 "】うっ・・・。")
      (wait)
      (text #:color 7 "ふ、不覚にも俺は声を出してしまった。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君も気持ちいいの？・・・美穂、うれしい。")
      (wait)
      (text #:color 7 "い、いかん・・・また声が出そうだ。")
      (wait)
      (text #:color 6 "【美穂】いいの、" 0 "君・・・我慢しないで・・・もう一緒になれたから・・・美穂は満足なの。")
      (wait)
      (text
       #:color
       7
       "『満足』という言葉を聞いたとたん、俺の腰のあたりは急激に熱くなり・・・あふれ出そうになる物を止める事ができない。")
      (wait)
      (text #:color 7 "俺の腰の動きが早くなる・・・部屋の中に肉体がぶつかり合う音が響きわたる。")
      (wait)
      (text #:color 6 "【美穂】ああっ・・・うあっ・・・" 0 "君・・・出して・・・いっぱい・・・出してえっ！！")
      (wait)
      (text #:color 7 "い、言われなくても・・・いっぱい出そうだっ！！")
      (wait)
      (text #:color 6 "【美穂】あああああんっ・・・あっ！！")
      (wait)
      (text #:color 6 "【美穂】すごい・・・あんっ・・・あああっ！！")
      (wait)
      (text #:color 7 "も、もう・・・我慢できないっ！！")
      (wait)
      (text #:color 6 "どっぴゅうっ！！")
      (wait)
      (text #:color 7 "俺は美穂のお腹の上に、たっぷりとぶちまけてしまった。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "kuro.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (sound 1)
      (set-var I 29)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 6 "【美穂】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・何か言って。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "好きだよ") (text "よかったよ") (text "愛してるよ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】美穂ちゃん・・・好きだよ。")
         (wait)
         (text #:color 6 "【美穂】・・・。")
         (wait)
         (text #:color 6 "【美穂】私も・・・大好き。")
         (wait)
         (set-reg: 102 (+ (: 102) 5))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】美穂ちゃん・・・よかったよ。")
         (wait)
         (text #:color 6 "【美穂】・・・。")
         (wait)
         (text #:color 6 "【美穂】うん・・・ありがと。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】美穂ちゃん・・・愛してるよ。")
         (wait)
         (text #:color 6 "【美穂】・・・。")
         (wait)
         (text #:color 6 "【美穂】うれしい・・・私も" 0 "君が大好き。")
         (wait)
         (set-reg: 102 (+ (: 102) 5))))
       (else (<>)))
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【美穂】私・・・今夜の事は一生忘れない。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 6 "【美穂】好きな人に抱かれると、こんなに幸せな気分になれるなんて・・・知らなかった。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【美穂】" 0 "君・・・私の事、嫌いにならないでね。")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・。")
      (wait)
      (text #:color 6 "【美穂】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】そろそろ・・・帰ろうか？")
      (wait)
      (text #:color 6 "【美穂】うん・・・。")
      (wait)
      (field 14 1 1)
      (field 13 0 0)
      (field 13 1 1)
      (set-reg: 1001 0)
      (set-var A 1)
      (proc 13)
      (proc 11)
      (set-var N 11)
      (set-reg: 732 1)
      (slot 1 2)
      (mes-jump "town1.mes")))
    ((&& (== V 8) (== N 8) (== (: 19) 0))
     (<> (text #:color 6 "【美穂】あ・・・あ・・・。") (wait) (set-reg: 19 1)))
    ((&& (== V 8) (== N 8) (== (: 19) 1))
     (<> (text #:color 6 "【美穂】い・・・いい。") (wait) (set-reg: 19 2)))
    ((&& (== V 8) (== N 8) (== (: 19) 2))
     (<> (text #:color 6 "【美穂】くすぐったい・・・。") (wait) (set-reg: 19 3)))
    ((&& (== V 8) (== N 8) (== (: 19) 3))
     (<> (text #:color 6 "【美穂】んんっ・・・。。") (wait) (set-reg: 19 0)))
    ((&& (== V 10) (== N 9) (== (: 20) 0))
     (<> (text #:color 7 "【" 0 "】（ぺっぺっぺっぺーっ！！）") (wait) (set-reg: 20 1)))
    ((&& (== V 10) (== N 9) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】（ぺっぺっぺっ！！・・・いいかかげんにしろよ、おい。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))