(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\い
  #\。
  #\子
  #\、
  #\て
  #\の
  #\真
  #\っ
  #\し
  #\た
  #\が
  #\だ
  #\か
  #\に
  #\る
  #\う
  #\も
  #\ん
  #\は
  #\と
  #\よ
  #\く
  #\ら
  #\わ
  #\？
  #\あ
  #\れ
  #\そ
  #\君
  #\で
  #\を
  #\何
  #\ち
  #\す
  #\ゃ
  #\！
  #\け
  #\ス
  #\事
  #\生
  #\ー
  #\ど
  #\亜
  #\先
  #\さ
  #\こ
  #\ね
  #\ま
  #\言
  #\じ
  #\ろ
  #\見
  #\行
  #\え
  #\店
  #\き
  #\ク
  #\り
  #\（
  #\や
  #\）
  #\気
  #\め
  #\ょ
  #\私
  #\キ
  #\人
  #\薬
  #\お
  #\方
  #\俺
  #\ッ
  #\時
  #\ン
  #\度
  #\ホ
  #\ル
  #\思
  #\み
  #\大
  #\ト
  #\タ
  #\一
  #\部
  #\ば
  #\園
  #\テ
  #\セ
  #\ジ
  #\イ
  #\ご
  #\ム
  #\ケ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "19.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "g.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "tan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "t.s4" (~ @ 2))
 (animate 0 0 1)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 25)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "19c.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 399) 0)
   (<>
    (text #:color 7 "【" 0 "】亜子さんは・・・いるかな？")
    (wait)
    (text #:color 3 "【真子】" 0 "君、亜子と何かあったの？")
    (wait)
    (text #:color 7 "【" 0 "】へ？")
    (wait)
    (text
     #:color
     3
     "【真子】"
     0
     "君と一緒に喫茶店に行ってから、様子がおかしいのよ・・・店に出たくないって言って、奥の部屋から出てこないの。")
    (wait)
    (text #:color 7 "【" 0 "】（や、やばい・・・。）")
    (wait)
    (text #:color 3 "【真子】困るわ、亜子が店にいてくれないと、学校に行く事ができないのよ・・・。")
    (wait)))
  ((== (: 399) 1)
   (<>
    (text #:color 7 "【" 0 "】真子先生、亜子さんは？")
    (wait)
    (text #:color 3 "【真子】元気がないわね・・・気分がよくないって言ってるわ。")
    (wait)
    (text #:color 7 "【" 0 "】ふーん・・・。")
    (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0) (== (: 399) 0))
        (<>
         (text #:color 3 "【真子】ちょっと待って" 0 "君・・・私に何か話す事があるんじゃない？")
         (wait)
         (text #:color 7 "【" 0 "】え！？・・・何もないけど。")
         (wait)))
       ((== N 1)
        (<>
         (text #:color 3 "【真子】亜子の事は気にしなくて平気よ・・・あの子、少しは経験した方がいいくらいなんだから。")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・なんて理解のあるお姉さんなんだ。")
         (wait)
         (set-reg: 399 1)
         (set-var N 8)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (== (: 50) 0) (== (: 399) 0))
        (<>
         (text #:color 3 "【真子】でしょう？・・・私に何か話す事があるのよね。")
         (wait)
         (text #:color 7 "【" 0 "】ないってば。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 3 "【真子】あら・・まだ話してない事があるの？")
         (wait)
         (text #:color 7 "【" 0 "】えーと・・・全部話したような？")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 29) (== (: 20) 0) (== (: 399) 0))
     (<>
      (text #:color 3 "【真子】困っちゃうわ・・・亜子が店をやってくれないと、私もここから動く事ができないのよ。")
      (wait)
      (text #:color 7 "【" 0 "】真子先生、俺が店番をやろうか？")
      (wait)
      (text #:color 3 "【真子】・・・。")
      (wait)
      (text #:color 3 "【真子】・・・。")
      (wait)
      (text #:color 3 "【真子】ううん、遠慮しておくわ。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 2) (== N 29) (== (: 22) 0) (== (: 399) 0))
     (<>
      (cond
       ((== (: 21) 0)
        (<>
         (text #:color 3 "【真子】ねえ・・・亜子に何かしたの？")
         (wait)
         (text #:color 7 "【" 0 "】ど、どうして？")
         (wait)
         (text #:color 3 "【真子】" 0 "君、これでも私は先負学園の校医よ・・・亜子の様子が変な事ぐらいわかるわよ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・は。")
         (wait)
         (text #:color 3 "【真子】" 0 "君、答えなさい。")
         (wait)
         (text #:color 7 "【" 0 "】えーと・・・。")
         (wait)))
       ((== (: 21) 1) (<> (text #:color 3 "【真子】もう一度聞くけど・・・亜子に何かした？") (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "した") (text "しない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】正直に言うと・・・何もしてなくない。")
         (wait)
         (text #:color 3 "【真子】屈折した言い方をしないで・・・ようするに、したって事でしょ？")
         (wait)
         (set-reg: 22 1)))
       ((&& (== N 2) (== (: 23) 0))
        (<>
         (text #:color 7 "【" 0 "】何もしてない。")
         (wait)
         (text #:color 3 "【真子】" 0 "君・・・私の目を見て。")
         (wait)
         (text #:color 7 "【" 0 "】きょろきょろきょろ。")
         (wait)
         (set-reg: 23 1)
         (set-reg: 108 (- (: 108) 1))))
       ((&& (== N 2) (== (: 23) 1))
        (<>
         (text #:color 7 "【" 0 "】何もしてないって。")
         (wait)
         (text #:color 3 "【真子】" 0 "君・・・じいいいいい。")
         (wait)
         (text #:color 7 "【" 0 "】そ、そんな目で俺を見るなあっ！！")
         (wait)))
       (else (<>)))
      (set-reg: 21 1)))
    ((&& (== V 2) (== N 29) (== (: 24) 0) (== (: 399) 0))
     (<>
      (text #:color 3 "【真子】で、喫茶店に行って・・・それから何をしたの？")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "公園に行った") (text "ホテルに行った")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】公園に行って・・・。")
         (wait)
         (text #:color 3 "【真子】公園に行って・・・それから？")
         (wait)
         (set-reg: 25 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ホテルに行って・・・。")
         (wait)
         (text #:color 3 "【真子】ホ、ホテルに行ったの！？・・・それで！？")
         (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "セックスをした") (text "キスをした")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】セックスを・・・した。")
         (wait)
         (text #:color 3 "【真子】セ、セックスしちゃったの！？")
         (wait)
         (text #:color 3 "【真子】・・・。")
         (wait)
         (text #:color 3 "【真子】" 0 "君、あなたの事を見損なったわ・・・やんちゃ坊主だけど、いい子だと思ってたのに。")
         (wait)
         (text #:color 3 "【真子】二度と顔を見たくないわ・・・あなたが学校を辞めなければ、私が辞めます。")
         (wait)
         (text #:color 7 "【" 0 "】ち、違うっ！！・・・もう一度聞いてくれ！！")
         (wait)
         (set-reg: 108 (- (: 108) 2))))
       ((&& (== N 2) (== (: 25) 0))
        (<>
         (text #:color 7 "【" 0 "】キスをしただけだよ。")
         (wait)
         (text #:color 3 "【真子】・・・。")
         (wait)
         (text #:color 3 "【真子】" 0 "君、そんな言い方はないと思うわ・・・あなたはもっと、いい子だと思ってた。")
         (wait)
         (text
          #:color
          3
          "【真子】言葉たくみにホテルに誘ったのね・・・あの子がホテルになんか行くはずがないもの、それがショックだったんだわ。")
         (wait)
         (text #:color 7 "【" 0 "】ち、違うっ！！・・・もう一度聞いてくれ！！")
         (wait)
         (set-reg: 108 (- (: 108) 1))))
       ((&& (== N 2) (== (: 25) 1))
        (<>
         (text #:color 7 "【" 0 "】それで、すべり台にお尻がはさまって・・・。")
         (wait)
         (text #:color 3 "【真子】え？")
         (wait)
         (text #:color 7 "【" 0 "】だから、お尻がすべり台から取れなくなって・・・俺が手を貸して、スポッと抜けて。")
         (wait)
         (text #:color 3 "【真子】ぷっ！！")
         (wait)
         (text #:color 7 "【" 0 "】その時の亜子さんの顔が、あまりにもかわいかったもんで・・・ついつい唇にキスを・・・。")
         (wait)
         (text #:color 3 "【真子】" 0 "君、もういいわ・・・もうわかったから。")
         (wait)
         (text #:color 7 "【" 0 "】真子先生・・・笑わなかった？")
         (wait)
         (text
          #:color
          3
          "【真子】だって、亜子のお尻って大きいでしょ？・・・すべり台にはさまったところを想像したら、妙におかしくて・・・。")
         (wait)
         (set-reg: 24 1)
         (set-reg: 108 (+ (: 108) 1))))
       (else (<>)))
      (set-reg: 25 0)))
    ((&& (== V 2) (== N 29) (== (: 26) 0) (== (: 399) 0))
     (<>
      (text
       #:color
       3
       "【真子】亜子はね、年齢よりもずっと子供なの・・・もしかしたら、"
       0
       "君の方がずっと経験してるかもしれないわ。")
      (wait)
      (text #:color 7 "【" 0 "】公園に行った時、何となくそんな気がした・・・。")
      (wait)
      (text #:color 3 "【真子】私も心配してるの・・・店を手伝ってもらってるから、男の人と知り合う機会もないだろうし。")
      (wait)
      (text #:color 7 "【" 0 "】だいぶフラストレーションが、たまってるみたいだったぜ。")
      (wait)
      (text #:color 3 "【真子】そう・・・そろそろこの店の事を、考えないといけない時期かもしれないわね。")
      (wait)
      (set-reg: 26 1)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 29) (== (: 399) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君と亜子がキスするなんて・・・想像するとかわいいわね。")
      (wait)
      (text #:color 7 "【" 0 "】どうして？")
      (wait)
      (text #:color 3 "【真子】だって、二人とも子供じゃない。")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 399) 1) (== (: 20) 0))
     (<>
      (text #:color 3 "【真子】亜子は大丈夫よ・・・もしかして、ファーストキスだったのかも知れないし。")
      (wait)
      (text #:color 3 "【真子】だとしたら、はしかのようなもんだわ・・・時間がたてば元に戻るから。")
      (wait)
      (text #:color 7 "【" 0 "】（ファーストキスか・・・信じられないけど、そうなのかもしれないな。）")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 2) (== N 29) (== (: 399) 1) (== (: 20) 1))
     (<>
      (text
       #:color
       3
       "【真子】亜子が立ち直るまで、店は私がやる事にしたわ・・・学校の事が気になるけど、何かあったら呼んでもらえるようにしてあるし。")
      (wait)
      (text #:color 7 "【" 0 "】仕方がないよな。")
      (wait)
      (text #:color 3 "【真子】あのね・・・責任の一部は、" 0 "君にもあるのよ。")
      (wait)))
    ((&& (== V 1) (== N 1))
     (<>
      (text #:color 7 "【" 0 "】色々な棚があるなあ・・・俺の部屋に置いたらジャスト・フィットだぜ。")
      (wait)
      (text #:color 3 "【真子】部屋の中が薬臭くなっちゃうわよ。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】この中には・・・何が入ってるのかな？")
      (wait)
      (text #:color 3 "【真子】" 0 "君が見てもわからないわ・・・開けても無駄よ。")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】真子先生・・・これは何？")
      (wait)
      (text #:color 3 "【真子】薬よ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】看板・・・別名『サイン・ボード』だな。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、ちゃんと宿題やってる？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・勝負は８月３１日の夜だな。")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】真子先生、蛍光灯じゃなくてシャンデリアにしたら・・・ゴージャスな薬局になると思うけどなあ。")
      (wait)
      (text #:color 3 "【真子】ゴージャスになっても、商店街の笑い者になるだけだわ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】納得。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 7 "【" 0 "】さすが薬局、薬だらけだ。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、何か買ってくれる？")
      (wait)
      (text #:color 7 "【" 0 "】ううん、俺って健康だから。")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】貼紙だけど・・・読む気がしないな。")
      (wait)
      (text #:color 3 "【真子】" 0 "君は健康なんだから、読む必要がないわね。")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】レジカウンターだな・・・カウンターより、レジが欲しい。")
      (wait)
      (text #:color 3 "【真子】どっちもあげないわよ、仕事ができなくなっちゃうもの。")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】えーと・・・摂氏１００度だな。")
      (wait)
      (text #:color 3 "【真子】そんな気温だったら、頭の中まで沸騰しちゃいそう。")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 7 "【" 0 "】ここが薬剤室だぜ・・・秘密の薬が、秘密に売られてるんだ。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・誤解を生むような言い方はやめてね。")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<>
      (text #:color 3 "【真子】" 0 "君、あげないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】ちくしょう、先に言われちゃった。")
      (wait)))
    ((&& (== V 1) (== N 13))
     (<>
      (text #:color 7 "【" 0 "】ずいぶんと大きい運転免許証だな・・・。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、冗談で言ってると思うけど・・・それは薬剤師の免許です。")
      (wait)))
    ((&& (== V 1) (== N 14))
     (<>
      (text #:color 7 "【" 0 "】俺様が見る程の物じゃない・・・真子先生もそう思うでしょ？")
      (wait)
      (text #:color 3 "【真子】ごめんなさい、何か言ったかしら？")
      (wait)
      (text #:color 7 "【" 0 "】聞いちゃいない・・・。")
      (wait)))
    ((&& (== V 1) (== N 30) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生の髪って、キラキラしてるなあ。")
      (wait)
      (text #:color 3 "【真子】そう？・・・別に何もしてないけど。")
      (wait)
      (text #:color 7 "【" 0 "】何もしてないって、頭も洗ってないの？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 1) (== N 30) (== (: 10) 1))
     (<> (text #:color 7 "【" 0 "】（奇麗な髪だ・・・触れてみたい。）") (wait)))
    ((&& (== V 1) (== N 23) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】（真子先生だ・・・遠くから見ても、近くから見ても美人だな。）")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 23) (== (: 11) 1))
     (<> (text #:color 7 "【" 0 "】（うーん、大人の憂いを含んだこの表情・・・なんて素敵なんだ。）") (wait)))
    ((&& (== V 1) (== N 24) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生、首にキスマークがついてますよ。")
      (wait)
      (text #:color 3 "【真子】そう？")
      (wait)
      (text #:color 7 "【" 0 "】さすが・・・全然、動じない。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 24) (== (: 12) 1))
     (<>
      (text #:color 7 "【" 0 "】この首筋を何人の男がなめた事だろう・・・。")
      (wait)
      (text
       #:color
       3
       "【真子】"
       0
       "君、そんな言い方はよくないわね・・・せめて、何人の男が愛した事だろう・・・って言ってくれる？")
      (wait)))
    ((&& (== V 1) (== N 25) (== (: 400) 0))
     (<>
      (text #:color 7 "【" 0 "】赤いネクタイか・・・まるで俺様のポコチンの裏のようだ。")
      (wait)
      (text #:color 3 "【真子】赤くなるのはね、包茎の人が多いの・・・" 0 "君、ちゃんとムケてる？")
      (wait)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ムケてる") (text "ムケてない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】もちろんズルムケさ・・・自分で見ても、見事なくらいムケてるぜ。")
         (wait)
         (text #:color 3 "【真子】そう、よかったわ。")
         (wait)
         (set-reg: 108 (+ (: 108) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】実は・・・トックリ君なんだ。")
         (wait)
         (text #:color 3 "【真子】だめよ、若い時に何とかしないと・・・亀頭の成長がさまたげられるわよ。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・それは困った。")
         (wait)
         (set-reg: 108 (- (: 108) 1))))
       (else (<>)))
      (set-reg: 400 1)))
    ((&& (== V 1) (== N 25) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生、ネクタイをしてると苦しくない？")
      (wait)
      (text #:color 3 "【真子】ブラと同じで、慣れれば気にならないものよ。")
      (wait)
      (text #:color 7 "【" 0 "】なるほど・・・。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 25) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】来年の卒業式の時、そのネクタイが欲しいなあ・・・。")
      (wait)
      (text #:color 3 "【真子】そう言われたの、" 0 "君で１８人目よ・・・そんなにたくさん、ネクタイは持ってないのよ。")
      (wait)))
    ((&& (== V 1) (== N 26) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】こう見ると・・・あまり大きく見えないけど、たぶん角度のせいだろう。")
      (wait)
      (text #:color 3 "【真子】自慢じゃないけど、大きいわよ・・・８９センチぐらいはあるもの。")
      (wait)
      (text #:color 7 "【" 0 "】（す、すごい・・・すごすぎる！！）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 26) (== (: 14) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君、女の子の胸を触る時はね・・・強くもんじゃだめ。")
      (wait)
      (text #:color 3 "【真子】特に生理の前とか痛くなるのよ・・・優しく全体を包み込むようにね。")
      (wait)
      (text #:color 7 "【" 0 "】ご指導ありがとうございます。")
      (wait)))
    ((&& (== V 1) (== N 27) (== (: 15) 0))
     (<> (text #:color 7 "【" 0 "】（真子先生だ・・・素敵な女性だな。）") (wait) (set-reg: 15 1)))
    ((&& (== V 1) (== N 27) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・真子先生の私生活が知りたい。）") (wait)))
    ((&& (== V 1) (== N 28) (== (: 16) 0))
     (<> (text #:color 7 "【" 0 "】（ああ・・・このしぐさが、たまらなく色っぽい。）") (wait)))
    ((&& (== V 1) (== N 28) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】先生の手って・・・細くて奇麗だな。")
      (wait)
      (text #:color 3 "【真子】" 0 "君の手だって、もみじみたいでかわいいわよ。")
      (wait)
      (text #:color 7 "【" 0 "】それじゃ、赤ちゃんだよ・・・もう。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))