(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\。
  #\な
  #\の
  #\（
  #\）
  #\し
  #\か
  #\る
  #\っ
  #\だ
  #\子
  #\て
  #\あ
  #\こ
  #\亜
  #\に
  #\う
  #\、
  #\ん
  #\た
  #\？
  #\ら
  #\は
  #\も
  #\ま
  #\が
  #\ど
  #\ー
  #\わ
  #\さ
  #\ゃ
  #\見
  #\く
  #\で
  #\お
  #\き
  #\よ
  #\ぜ
  #\す
  #\ち
  #\捜
  #\と
  #\れ
  #\！
  #\薬
  #\け
  #\何
  #\ね
  #\り
  #\一
  #\度
  #\を
  #\部
  #\机)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "19.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (slot 1 5)
 (set-arr~ @ 7 0)
 (load "t06.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 676) 0)
   (<>
    (text #:color 7 "【" 0 "】あれれ・・・誰もいない。")
    (wait)
    (text #:color 2 "【亜子】おかしいわね・・・どこにしまったのかしら？")
    (wait)
    (text #:color 7 "【" 0 "】声はすれども、姿は見えない・・・。")
    (wait)
    (text #:color 2 "【亜子】変ね・・・確か、ここにしまったはずだけど。")
    (wait)
    (text #:color 7 "【" 0 "】亜子さーん・・・どこにいるの？")
    (wait)
    (text #:color 2 "【亜子】あーん、わからなくなっちゃった・・・。")
    (wait)
    (text #:color 7 "【" 0 "】奥の方から声が聞こえてくるな・・・覗いて見るか。")
    (wait)
    (text #:color 2 "【亜子】この間はあったのに・・・今になって、どうしてなくなるのかしら。")
    (wait)
    (text #:color 7 "【" 0 "】亜子さん・・・ぎょっ！？")
    (wait)
    (slot 1 5)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "t06.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 3)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 2 "【亜子】変ねえ・・・真子姉さん、どこにしまったのかしら？")
    (wait)
    (text #:color 7 "【" 0 "】（あっらー・・・まる見え、思わず拝みたくなるようなポーズだな。）")
    (wait)))
  ((== (: 676) 1)
   (<>
    (text #:color 7 "【" 0 "】おいおい・・・まだ捜してるのか？")
    (wait)
    (text #:color 2 "【亜子】おかしいわね・・・どこにしまったのかしら？")
    (wait)
    (text #:color 7 "【" 0 "】まだ捜してる・・・この粘り強さは、ギネスブックもんだぜ。")
    (wait)
    (text #:color 2 "【亜子】変ね・・・確か、ここにしまったはずだけど。")
    (wait)
    (text #:color 7 "【" 0 "】またまた覗いて見るか・・・どうする？")
    (wait)
    (set-reg: 101 1)
    (set-arr~ @ 7 0)
    (proc 18)
    (menu-show (<.> (text "覗く") (text "帰る")))
    (if (== N 1) (<> (text #:color 7 "【" 0 "】そうだな・・・もう一度見せてもらおっと。") (wait)))
    (if (== N 2)
      (<>
       (text #:color 7 "【" 0 "】そうだな・・・一度見たし、時間の無駄だぜ。")
       (wait)
       (text #:color 7 "【" 0 "】・・・。")
       (wait)
       (text #:color 7 "【" 0 "】ちょっと惜しい気もするけど・・・帰ろう。")
       (wait)
       (set-var N 8)
       (slot 1 2)
       (mes-jump "town1.mes")))
    (text #:color 7 "【" 0 "】亜子さん・・・お邪魔しまーす。")
    (wait)
    (slot 1 5)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "t06.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 3)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】（うーん、何度見ても飽きないな・・・白いパンツがまぶしいぜ。）")
    (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "観察する")))
      (cond
       ((&& (== N 1) (== (: 30) 0))
        (<>
         (text #:color 7 "【" 0 "】（うーん・・・何を捜してるのかは知らないけど、かなり夢中のようだな。）")
         (wait)
         (text #:color 7 "【" 0 "】（スカートが上にまくれているのはいいとして、俺がここにいる事に気がついてないようだ。）")
         (wait)
         (set-reg: 30 1)))
       ((&& (== N 1) (== (: 30) 1))
        (<>
         (text #:color 7 "【" 0 "】（白いパンティは亜子さんの為に存在してるんだ・・・。）")
         (wait)
         (text #:color 7 "【" 0 "】（・・・。）")
         (wait)
         (text #:color 7 "【" 0 "】（もう一人、くるみちゃんの為だな。）")
         (wait)
         (text #:color 7 "【" 0 "】（・・・。）")
         (wait)
         (text #:color 7 "【" 0 "】（もう一人、美穂ちゃんの為だな。）")
         (wait)
         (set-reg: 30 2)))
       ((&& (== N 1) (== (: 30) 2))
        (<> (text #:color 7 "【" 0 "】（カツラ・・・じゃないよな？）") (wait)))
       (else (<>)))))
    ((&& (== V 8) (== N 1) (== (: 676) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・見てるだけで、興奮してくるな。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（ちょっと・・・触っちゃおうかな。）")
      (wait)
      (text #:color 2 "【亜子】きゃあああああっ！！")
      (wait)
      (slot 1 5)
      (mes-jump "t04.mes")))
    ((&& (== V 8) (== N 1) (== (: 676) 1))
     (<>
      (text #:color 7 "【" 0 "】（よそうぜ・・・な？）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（かわいいお尻だな・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（白い下着のあの部分がもっこりと・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（だ、駄目だあっ・・・我慢できない。）")
      (wait)
      (text #:color 2 "【亜子】きゃあああああっ！！")
      (wait)
      (slot 1 5)
      (mes-jump "t04.mes")))
    ((&& (== V 1) (== N 2) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】（何かの書類を捜してるのか？）")
      (wait)
      (text #:color 2 "【亜子】わからないわ・・・どこにいったのかしら？")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 1) (== N 2) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】（このファイルケースの中に、捜してる物があるのかな？）")
      (wait)
      (text #:color 2 "【亜子】もう・・・これだけ捜してないなんて、捨てちゃったのかしら。")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】（パイプ椅子ってやつだな・・・学校にもたくさんあるぞ。）")
      (wait)
      (text #:color 2 "【亜子】あーん・・・わからない。")
      (wait)
      (text #:color 7 "【" 0 "】（色っぽい声を出さないくれよ・・・ムラムラしてきちゃうぜ。）")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 3) (== (: 11) 1))
     (<>
      (text #:color 7 "【" 0 "】（亜子さんや真子先生は・・・この椅子に座った事があるのかな？）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（欲しい。）")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】（机だ・・・木でできてるみたいだぞ。）")
      (wait)
      (text #:color 2 "【亜子】絶対に変よ・・・ここにあるはずだもの。")
      (wait)
      (text #:color 7 "【" 0 "】（おーい、俺が後ろにいるんだぜ・・・知ってるかい？）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 4) (== (: 12) 1))
     (<>
      (text #:color 7 "【" 0 "】（この机はアンティークなのかな？）")
      (wait)
      (text #:color 2 "【亜子】もしかしたら・・・机の中なのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】（ぎょっ！？・・・振り向くのか！？）")
      (wait)
      (text #:color 2 "【亜子】ううん、違うわ・・・机の中は、さっき捜したもの。")
      (wait)
      (set-reg: 12 2)))
    ((&& (== V 1) (== N 4) (== (: 12) 2))
     (<> (text #:color 7 "【" 0 "】（木でできた机だ・・・。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】（窓は閉まってる・・・こりゃあいいぜ。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（いったい何がいいんだろ？）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 5) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】（何度も言うが・・・窓は閉まってるんだ。）")
      (wait)
      (text #:color 2 "【亜子】わからない・・・どこにいったのかしら？")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（秤があるな・・・薬を調剤する時に使うのか？）")
      (wait)
      (text #:color 2 "【亜子】やだわあ・・・見つからないと、困ってシマウマ。")
      (wait)
      (text #:color 7 "【" 0 "】（亜子さんって・・・一人でいる時の方が明るいんじゃないか？）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 6) (== (: 14) 1))
     (<>
      (text #:color 7 "【" 0 "】（秤だぜ・・・何度も見る物じゃないぜ。）")
      (wait)
      (text #:color 2 "【亜子】はあ・・・どうしよう。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（さすが薬局・・・色々な薬が並んでる。）")
      (wait)
      (text #:color 2 "【亜子】あと捜す場所といったら・・・どこかしら？")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 7) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】（薬だ・・・奥の部屋にまで、薬がおいてあるのか。）")
      (wait)
      (text #:color 2 "【亜子】あそこにはなかったし・・・ここにもないし。")
      (wait)
      (text #:color 2 "【亜子】困ったわ・・・。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（薬局の奥の部屋だ・・・和室のようだぞ。）")
      (wait)
      (text #:color 2 "【亜子】もしかして、２階にあるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、できれば１階にいて欲しい・・・。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 8) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】（ここは薬局の奥にある部屋だ・・・店からはこの部屋を見る事はできない。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))