(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\。
  #\子
  #\い
  #\真
  #\、
  #\の
  #\て
  #\う
  #\っ
  #\に
  #\だ
  #\る
  #\ら
  #\し
  #\あ
  #\た
  #\が
  #\は
  #\か
  #\？
  #\ん
  #\よ
  #\君
  #\と
  #\も
  #\く
  #\（
  #\）
  #\こ
  #\薬
  #\を
  #\で
  #\わ
  #\先
  #\生
  #\ゃ
  #\け
  #\れ
  #\さ
  #\ど
  #\言
  #\何
  #\ー
  #\ち
  #\す
  #\亜
  #\そ
  #\行
  #\き
  #\事
  #\俺
  #\思
  #\見
  #\ン
  #\じ
  #\買
  #\河
  #\原
  #\り
  #\ね
  #\ま
  #\ジ
  #\ス)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "19.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "g.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "tan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "t.s4" (~ @ 2))
 (animate 0 0 1)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 25)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "19c.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== (: 663) 0)
   (<>
    (text #:color 7 "【" 0 "】あれれ！？")
    (wait)
    (text #:color 3 "【真子】" 0 "君じゃない・・・薬を買いに来たの？")
    (wait)
    (text #:color 7 "【" 0 "】亜子さんは？")
    (wait)
    (text #:color 3 "【真子】亜子は・・・河原に行くって言ってたわよ。")
    (wait)
    (text #:color 7 "【" 0 "】河原に・・・一人で何をしに行くんだろ？")
    (wait)
    (text #:color 3 "【真子】さあ・・・そんなに気になるなら、行ってみたらどう？")
    (wait)
    (set-reg: 663 1)))
  ((== (: 663) 1)
   (<>
    (text #:color 3 "【真子】" 0 "君・・・今日こそ薬を買いに来てくれたの？")
    (wait)
    (text #:color 7 "【" 0 "】（うーん、亜子さんよりチェックが厳しいなあ・・・。）")
    (wait))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 604) 0))
        (<>
         (text #:color 7 "【" 0 "】さてと・・・行こうかな。")
         (wait)
         (text #:color 3 "【真子】" 0 "君、亜子と会ったら店に戻るように言ってね。")
         (wait)
         (set-var N 8)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 1) (== (: 604) 1))
        (<>
         (text #:color 7 "【" 0 "】さてと・・・行こうかな。")
         (wait)
         (text #:color 3 "【真子】" 0 "君・・・内緒よ、特に亜子には。")
         (wait)
         (text #:color 7 "【" 0 "】（真子先生との事を亜子さんに言ったら・・・とんでもない事になっちゃうよ。）")
         (wait)
         (set-var N 8)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【真子】" 0 "君、何の薬がいいのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】い、いや・・・ここにいるからって薬を買うとは限らないだろ？")
         (wait)
         (text #:color 3 "【真子】ここは薬屋よ、薬を買う人が来る場所なの。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 29) (== (: 20) 0) (== (: 604) 0))
     (<>
      (text #:color 3 "【真子】亜子ったら、私が戻った途端に出かけたわよ・・・河原で何をしてるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】俺の方が聞きたいくらいだよ。")
      (wait)
      (text #:color 3 "【真子】" 0 "君の事で悩んでいるのかしら・・・あの子、思い詰めると一途な所があるから。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 2) (== N 29) (== (: 20) 1) (== (: 604) 0))
     (<>
      (text #:color 3 "【真子】" 0 "君、河原で亜子と話をしてきたら？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・どうしようかなあ。")
      (wait)))
    ((&& (== V 2) (== N 29) (== (: 20) 0) (== (: 604) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君・・・河原に行くつもり？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・どうしようかなあ。")
      (wait)
      (text #:color 3 "【真子】忘れろと言いましたけど・・・多少は考えて行動してね。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 2) (== N 29) (== (: 20) 1) (== (: 604) 1))
     (<>
      (text #:color 3 "【真子】" 0 "君・・・私の言っている意味がわかるかしら？")
      (wait)
      (text #:color 7 "【" 0 "】なんとなく・・・わかるような気がする。")
      (wait)))
    ((&& (== V 1) (== N 1))
     (<>
      (text #:color 7 "【" 0 "】色々な棚があるなあ・・・俺の部屋に置いたらジャスト・フィットだぜ。")
      (wait)
      (text #:color 3 "【真子】部屋の中が薬臭くなっちゃうわよ。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】この中には・・・何が入ってるのかな？")
      (wait)
      (text #:color 3 "【真子】" 0 "君が見てもわからないわ・・・開けても無駄よ。")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】真子先生・・・これは何？")
      (wait)
      (text #:color 3 "【真子】薬よ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】看板・・・別名『サイン・ボード』だな。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、ちゃんと宿題やってる？")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・勝負は８月３１日の夜だな。")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】真子先生、蛍光灯じゃなくてシャンデリアにしたら・・・ゴージャスな薬局になると思うけどなあ。")
      (wait)
      (text #:color 3 "【真子】ゴージャスになっても、商店街の笑い者になるだけだわ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】納得。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 7 "【" 0 "】さすが薬局、薬だらけだ。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、何か買ってくれる？")
      (wait)
      (text #:color 7 "【" 0 "】ううん、俺って健康だから。")
      (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】貼紙だけど・・・読む気がしないな。")
      (wait)
      (text #:color 3 "【真子】" 0 "君は健康なんだから、読む必要がないわね。")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】レジカウンターだな・・・カウンターより、レジが欲しい。")
      (wait)
      (text #:color 3 "【真子】どっちもあげないわよ、仕事ができなくなっちゃうもの。")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】えーと・・・摂氏１００度だな。")
      (wait)
      (text #:color 3 "【真子】そんな気温だったら、頭の中まで沸騰しちゃいそう。")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 7 "【" 0 "】ここが薬剤室だぜ・・・秘密の薬が、秘密に売られてるんだ。")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・誤解を生むような言い方はやめてね。")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<>
      (text #:color 3 "【真子】" 0 "君、あげないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】ちくしょう、先に言われちゃった。")
      (wait)))
    ((&& (== V 1) (== N 13))
     (<>
      (text #:color 7 "【" 0 "】ずいぶんと大きい運転免許証だな・・・。")
      (wait)
      (text #:color 3 "【真子】" 0 "君、冗談で言ってると思うけど・・・それは薬剤師の免許です。")
      (wait)))
    ((&& (== V 1) (== N 14))
     (<>
      (text #:color 7 "【" 0 "】俺様が見る程の物じゃない・・・真子先生もそう思うでしょ？")
      (wait)
      (text #:color 3 "【真子】ごめんなさい、何か言ったかしら？")
      (wait)
      (text #:color 7 "【" 0 "】聞いちゃいない・・・。")
      (wait)))
    ((&& (== V 1) (== N 30) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生の髪って、キラキラしてるなあ。")
      (wait)
      (text #:color 3 "【真子】そう？・・・別に何もしてないけど。")
      (wait)
      (text #:color 7 "【" 0 "】何もしてないって、頭も洗ってないの？")
      (wait)))
    ((&& (== V 1) (== N 30) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（この髪に触れたんだ・・・学校の保健室で。）") (wait)))
    ((&& (== V 1) (== N 23) (== (: 604) 0))
     (<> (text #:color 7 "【" 0 "】（真子先生だ・・・遠くから見ても、近くから見ても美人だな。）") (wait)))
    ((&& (== V 1) (== N 23) (== (: 604) 1))
     (<>
      (text #:color 7 "【" 0 "】（真子先生の顔は・・・何事もなかったような顔だ。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（あれは・・・夢だったのかな？）")
      (wait)))
    ((&& (== V 1) (== N 24) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生、首にキスマークがついてますよ。")
      (wait)
      (text #:color 3 "【真子】そう？")
      (wait)
      (text #:color 7 "【" 0 "】さすが・・・全然、動じない。")
      (wait)))
    ((&& (== V 1) (== N 24) (== (: 604) 1))
     (<>
      (text #:color 7 "【" 0 "】（俺は・・・あの首筋にキスをしたんだぜ。）")
      (wait)
      (text #:color 7 "【" 0 "】（なんて事は、誰にも言えないな・・・。）")
      (wait)))
    ((&& (== V 1) (== N 25) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】真子先生って、赤いネクタイが似合うね。")
      (wait)
      (text #:color 3 "【真子】ありがとう、" 0 "君。")
      (wait)))
    ((&& (== V 1) (== N 25) (== (: 604) 1))
     (<>
      (text #:color 7 "【" 0 "】（あのネクタイをはずして・・・胸をはだけて・・・ああ、思い出しちゃうぞ。）")
      (wait)))
    ((&& (== V 1) (== N 26) (== (: 604) 0))
     (<>
      (text #:color 7 "【" 0 "】こう見ると・・・あまり大きく見えないけど、たぶん角度のせいだろう。")
      (wait)
      (text #:color 3 "【真子】自慢じゃないけど、大きいわよ・・・８９センチぐらいはあるもの。")
      (wait)
      (text #:color 7 "【" 0 "】（す、すごい・・・すごすぎる！！）")
      (wait)))
    ((&& (== V 1) (== N 26) (== (: 604) 1))
     (<>
      (text #:color 7 "【" 0 "】（９０センチ近くあったよな・・・あの胸は。）")
      (wait)
      (text #:color 3 "【真子】" 0 "君・・・思い出さないで。")
      (wait)))
    ((&& (== V 1) (== N 27) (== (: 604) 0))
     (<> (text #:color 7 "【" 0 "】（真子先生だ・・・素敵な女性だな。）") (wait)))
    ((&& (== V 1) (== N 27) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（真子先生をもう一度抱きたい・・・。）") (wait)))
    ((&& (== V 1) (== N 28) (== (: 604) 0))
     (<> (text #:color 7 "【" 0 "】（ああ・・・このしぐさが、たまらなく色っぽい。）") (wait)))
    ((&& (== V 1) (== N 28) (== (: 604) 1))
     (<> (text #:color 7 "【" 0 "】（真子先生はこの手で俺のナニを・・・。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))