(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\な
  #\い
  #\だ
  #\の
  #\太
  #\郎
  #\う
  #\っ
  #\ん
  #\て
  #\、
  #\る
  #\か
  #\は
  #\た
  #\し
  #\？
  #\で
  #\あ
  #\が
  #\に
  #\を
  #\ま
  #\こ
  #\も
  #\！
  #\よ
  #\と
  #\ろ
  #\や
  #\事
  #\ゃ
  #\れ
  #\そ
  #\僕
  #\じ
  #\行
  #\ち
  #\ら
  #\ー
  #\人
  #\何
  #\え
  #\け
  #\会
  #\ぜ
  #\一
  #\ど
  #\言
  #\ウ
  #\ロ
  #\く
  #\き
  #\俺
  #\げ
  #\間
  #\す
  #\カ
  #\『
  #\』
  #\手)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "12.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "s.pd8")
 (proc 16)
 (set-arr~ @ 6 1)
 (image "fan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "f.s4" (~ @ 2))
 (animate 0 0 1)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 2)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "s.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 257) 0)
   (<>
    (text #:color 7 "【" 0 "】げっ！？")
    (wait)
    (text #:color 5 "【太郎】やあ、" 0 "君・・・また会ったね。")
    (wait)
    (text #:color 7 "【" 0 "】また会ったねって・・・こんな所で何をしてるんだよ。")
    (wait)
    (text #:color 5 "【太郎】ここは公道だ、僕がここにいても何の不思議もないだろう。")
    (wait)
    (if (> T 2000)
      (<> (text #:color 7 "【" 0 "】こんな時間にウロウロしてるなんて・・・気味の悪いやつだぜ。") (wait)))
    (set-reg: 257 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "中に入る") (text "他の場所に行く") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 5 "【太郎】待ちたまえ、せっかく会ったんだ・・・何か話す事ぐらいあるだろう、ん？") (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 5 "【太郎】冷たい男だな・・・友達と話もできないのか。")
         (wait)
         (text #:color 7 "【" 0 "】しっしっしーーっ！！俺は自分の部屋に戻るんだよ。")
         (wait)
         (text #:color 5 "【太郎】俺も一緒に行こうじゃないか。")
         (wait)
         (text #:color 7 "【" 0 "】断るっ！！")
         (wait)
         (slot 1 2)
         (mes-jump "myroom.mes")))
       ((&& (== N 2) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】戻って来たけど・・・他の場所に行こっと。")
         (wait)
         (text #:color 5 "【太郎】まあ待ちたまえ、こうやって出会ったのも何かの縁だろう？")
         (wait)
         (text #:color 7 "【" 0 "】出会ったって・・・待ち伏せしてたんじゃないか？")
         (wait)
         (text #:color 5 "【太郎】失礼な事を言うな。")
         (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】他の場所に行こう・・・このままマタロウにとりつかれたら大変だ。")
         (wait)
         (text #:color 5 "【太郎】僕も一緒に行こうじゃないか。")
         (wait)
         (text #:color 7 "【" 0 "】一人で行くのっ！！")
         (wait)
         (set-var N 0)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 3)
        (<>
         (text #:color 5 "【太郎】そうしてくれ。")
         (wait)
         (text #:color 7 "【" 0 "】うっうっうっ・・・いやだよう。")
         (wait)))
       (else (<>)))))
    ((&& (== V 3) (== N 8) (== (: 20) 0))
     (<>
      (sound 1)
      (set-var I 37)
      (proc 26)
      (text #:color 5 "【太郎】乱暴はよせ。")
      (wait)
      (sound 1)
      (set-var I 2)
      (proc 26)
      (text #:color 7 "【" 0 "】顔色一つ変えずに・・・マタロウは結構、ケンカが強いんじゃないか？")
      (wait)
      (text #:color 5 "【太郎】少しチビってしまった。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 3) (== N 8) (== (: 20) 1))
     (<>
      (sound 1)
      (set-var I 37)
      (proc 26)
      (text #:color 5 "【太郎】僕が何をしたと言うのだ・・・こうして、偶然出会っただけではないか。")
      (wait)
      (sound 1)
      (set-var I 2)
      (proc 26)
      (text #:color 7 "【" 0 "】それだけで、十分なんだよ。")
      (wait)
      (text #:color 5 "【太郎】暴力が生み出す物は、怪我だけだ・・・バカげた事はやめろ。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】マタロウ、その髪型をなんとかしろ。")
      (wait)
      (text #:color 5 "【太郎】何を言う、これぞ『学生の鏡髪型』だ・・・君も理髪店に行って僕と同じようにしたまえ。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 9) (== (: 21) 1))
     (<>
      (text #:color 5 "【太郎】髪型で人間の価値が決まるものではない・・・人間の価値は学力で決まるのだ。")
      (wait)
      (text #:color 7 "【" 0 "】歪んでいるなあ。")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】そのメガネは、スカートの中身が見えるメガネか？・・・通販で買っただろ？")
      (wait)
      (text #:color 5 "【太郎】スカートの中を見てどうするのだ？・・・そんな事には興味がない。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 10) (== (: 22) 1))
     (<> (text #:color 5 "【太郎】メガネの事はどうでもいい・・・君も目が悪いのか？") (wait)))
    ((&& (== V 1) (== N 11) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】その手で、センズリしてるんだろ？・・・正直に行ってごらん？")
      (wait)
      (text #:color 5 "【太郎】センズリなんて汚い言い方はよしたまえ、ちゃんと手淫と言うべきだろう？")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 11) (== (: 23) 1))
     (<>
      (text #:color 7 "【" 0 "】手淫の手だ。")
      (wait)
      (text #:color 5 "【太郎】どの手の事だっ！！")
      (wait)
      (text #:color 7 "【" 0 "】やーい、怒ってやんの。")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 24) 0))
     (<>
      (text #:color 5 "【太郎】制服を着ると、気持ちが引き締まる・・・１８歳以下は学生服を着る事を義務付ければいいんだ。")
      (wait)
      (text #:color 7 "【" 0 "】マタロウは危険なやつだな・・・みんなが同じ考えだとは限らないだろ？")
      (wait)
      (text #:color 5 "【太郎】ふん、僕が洗脳してやるさ。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 12) (== (: 24) 1))
     (<>
      (text #:color 5 "【太郎】制服・・・ああ、なんて素敵な言葉なんだろう。")
      (wait)
      (text #:color 5 "【太郎】・・・。")
      (wait)
      (text #:color 5 "【太郎】君もそう思うだろう？")
      (wait)))
    ((&& (== V 1) (== N 13) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】エッチな本を持ち歩いてると、補導されちゃうぜ。")
      (wait)
      (text #:color 5 "【太郎】これはエッチな本ではない・・・僕の大切な参考書だ。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 13) (== (: 25) 1))
     (<>
      (text #:color 7 "【" 0 "】どれどれ・・・『究極アナル攻め』か。")
      (wait)
      (text #:color 5 "【太郎】ちっがーーーーうっ！！")
      (wait)))
    ((&& (== V 2) (== N 7) (== (: 18) 0))
     (<>
      (text #:color 5 "【太郎】友よ、語り合おう。")
      (wait)
      (text #:color 7 "【" 0 "】誰が友なんだよ・・・俺は一人でいるのが好きなんだ。")
      (wait)
      (text #:color 5 "【太郎】人間、一人では何もできないぞ・・・僕のような人格者でも一人では無理だ。")
      (wait)
      (text #:color 7 "【" 0 "】お前が人格者なら、俺は神様だぜ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 2) (== N 7) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】なあ・・・俺に用があるんだろ？")
      (wait)
      (text #:color 5 "【太郎】偶然会っただけだ。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ、俺は行くぜ・・・男と世間話をするほど暇じゃないんでね。")
      (wait)
      (text #:color 5 "【太郎】まあ待て・・・僕が持っている参考書を貸してあげようじゃないか。")
      (wait)
      (text #:color 7 "【" 0 "】いらない。")
      (wait)
      (text #:color 5 "【太郎】仕方がない、僕が誕生日のプレゼントに貰った、『木馬』を貸してあげよう・・・ちゃんと乗る事もできるぞ。")
      (wait)
      (text #:color 7 "【" 0 "】絶対にいらない。")
      (wait)
      (set-reg: 18 2)))
    ((&& (== V 2) (== N 7) (== (: 18) 2))
     (<>
      (text #:color 5 "【太郎】あいかわらず、女の子を追いかけているのか？")
      (wait)
      (text #:color 7 "【" 0 "】そうだよ・・・楽しいぜ。")
      (wait)
      (text #:color 5 "【太郎】そんなに楽しいのか？")
      (wait)
      (text #:color 7 "【" 0 "】ああ、すっごく楽しいぜ。")
      (wait)
      (text #:color 5 "【太郎】・・・そうか。")
      (wait)
      (text #:color 7 "【" 0 "】あれれ！？・・・『バカな事を！！』とか『将来を考えた事があるのか？』って言わないのか？")
      (wait)
      (text #:color 5 "【太郎】まあ・・・な。")
      (wait)
      (set-reg: 18 3)))
    ((&& (== V 2) (== N 7) (== (: 18) 3) (== (: 50) 0))
     (<>
      (text #:color 7 "【" 0 "】お前・・・何か悩んでいるんじゃないか？")
      (wait)
      (text #:color 5 "【太郎】僕の悩みは勉強の事だけだ・・・余計な詮索はやめてもらおう。")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・そう。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 7) (== (: 50) 1))
     (<>
      (text #:color 5 "【太郎】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 5 "【太郎】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なあ・・・いいかげんにしようぜ。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))