(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\る
  #\だ
  #\い
  #\。
  #\一
  #\ん
  #\哉
  #\う
  #\て
  #\っ
  #\か
  #\の
  #\、
  #\は
  #\も
  #\し
  #\に
  #\た
  #\よ
  #\く
  #\さ
  #\事
  #\き
  #\俺
  #\ら
  #\と
  #\み
  #\を
  #\れ
  #\ど
  #\が
  #\え
  #\ゃ
  #\ぜ
  #\？
  #\考
  #\け
  #\で
  #\ま
  #\す
  #\り
  #\わ
  #\好
  #\や
  #\あ
  #\別
  #\じ
  #\女
  #\ち)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "12.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "i.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "ran.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "r.s4" (~ @ 2))
 (animate 0 0 1)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "i.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 290) 0)
   (<>
    (text #:color 5 "【一哉】よう、" 0 "！！")
    (wait)
    (if (> T 2000)
      (<>
       (text #:color 7 "【" 0 "】こんな時間に何をしてるんだ・・・補導されちゃうぜ。")
       (wait)
       (text #:color 5 "【一哉】俺は顔が真面目だから大丈夫だよ。")
       (wait)))
    (text #:color 7 "【" 0 "】一哉・・・まだボーッとしてるのか？")
    (wait)
    (text #:color 5 "【一哉】ははは・・・もう大丈夫さ、ちょっと考え事をしててな。")
    (wait)
    (text #:color 7 "【" 0 "】考え事？")
    (wait)
    (text
     #:color
     5
     "【一哉】俺だって考え事ぐらいするさ・・・それよりもちょうどよかったよ、"
     0
     "に会いに来たんだけど、留守だったから帰ろうと思ってたんだ。")
    (wait)
    (set-reg: 290 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "中に入る") (text "他の場所に行く") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 5 "【一哉】" 0 "、もう少し話を聞いてくれないか？") (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】なあ・・・別れるのは簡単だぜ。")
         (wait)
         (text #:color 5 "【一哉】わかった・・・もう一度、考えてみるよ。")
         (wait)
         (slot 1 2)
         (mes-jump "myroom.mes")))
       ((&& (== N 2) (== (: 50) 0))
        (<> (text #:color 5 "【一哉】" 0 "・・・まだ話は終ってないんだけどな。") (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】なあ・・・別れるのは簡単だぜ。")
         (wait)
         (text #:color 5 "【一哉】わかった・・・もう一度、考えてみるよ。")
         (wait)
         (set-var N 0)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 3) (<> (text #:color 7 "【" 0 "】もう少しここにいるか・・・。") (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 5 "【一哉】" 0 "、俺は真面目に話をしてるんだぜ・・・髪の事なんかどうでもいいんだ。") (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 5 "【一哉】俺が悩んでいるのは、顔の事じゃないぜ。") (wait)))
    ((&& (== V 1) (== N 4))
     (<> (text #:color 5 "【一哉】なあ・・・シャツの事なんかどうでもいいんだ。") (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 5 "【一哉】ネクタイの事を考えてた訳じゃないぜ。")
      (wait)
      (text #:color 7 "【" 0 "】わかってるよう。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 5 "【一哉】制服の事なんかどうでもいいっ！！")
      (wait)
      (text #:color 7 "【" 0 "】わ、わかった・・・そう興奮するな。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 5 "【一哉】なあ・・・くるみとつき合ってもう１年近くになるけど、まだキスもしてないんだ。")
      (wait)
      (text #:color 7 "【" 0 "】やっぱりくるみちゃん事か・・・。")
      (wait)
      (text
       #:color
       5
       "【一哉】キスをしようとすると、顔をそむけるしさ・・・抱き締めようとすると『らっきょう』みたいにツルっと逃げるんだ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・らっきょうねえ。")
      (wait)
      (text #:color 5 "【一哉】確かに俺はくるみが好きさ・・・くるみも俺の事を好きだって言ってくれる。")
      (wait)
      (text
       #:color
       5
       "【一哉】でも好きだけじゃ我慢できないんだ・・・俺は健康な男だし、このままじゃ頭の中まで精液だらけになりそうだ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 5 "【一哉】俺さ・・・くるみと別れようかなって思うんだ。")
      (wait)
      (text #:color 7 "【" 0 "】好きなんだろ？・・・くるみの事が。")
      (wait)
      (text #:color 5 "【一哉】好きさ・・・大好きだよ。")
      (wait)
      (text #:color 5 "【一哉】でもくるみは・・・いつもお父さんの事ばかり気にしてるしな、俺はお父さんの次に好きなんじゃないか？")
      (wait)
      (text #:color 7 "【" 0 "】彼女は子供なんだよ・・・一哉の気持ちもわかるけど、もう少し大事にしてやったらどうだ？")
      (wait)
      (text #:color 5 "【一哉】" 0 "、お前はいいよ・・・特定の彼女いないけど、逆にやらせてくれる女を選び放題さ。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】俺は逆に一哉がうらやましいぜ・・・特定の彼女がいるって事がさ、俺なんかいつも行き当りばったりさ。")
      (wait)
      (text #:color 5 "【一哉】俺は童貞を捨てたいんだぜ・・・くるみが駄目なら、他の女の子を探すしかないんだ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 5 "【一哉】決めた・・・くるみと別れる。")
      (wait)
      (text #:color 7 "【" 0 "】なんて言って別れるんだ？")
      (wait)
      (text #:color 5 "【一哉】さあね・・・わからないよ。")
      (wait)
      (text #:color 7 "【" 0 "】なあ・・・もう少し考えた方がいいんじゃないか？")
      (wait)
      (text #:color 5 "【一哉】もう十分考えたさ・・・彼女は俺にとって子供すぎるんだ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 1))
     (<>
      (text #:color 5 "【一哉】なんだか、別れるって決めたらすっきりしたよ・・・最後の夏休みだ、楽しくやらないとな。")
      (wait)
      (set-reg: 50 1)))
    (else (<>)))))
 (set-arr~ @ 7 1))