(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\の
  #\な
  #\だ
  #\。
  #\る
  #\て
  #\、
  #\っ
  #\は
  #\に
  #\か
  #\が
  #\ん
  #\と
  #\う
  #\ー
  #\！
  #\し
  #\た
  #\ル
  #\ら
  #\よ
  #\れ
  #\あ
  #\こ
  #\で
  #\？
  #\を
  #\く
  #\も
  #\そ
  #\俺
  #\み
  #\０
  #\さ
  #\ト
  #\ン
  #\ゃ
  #\フ
  #\ラ
  #\タ
  #\日
  #\じ
  #\デ
  #\グ
  #\す
  #\一
  #\ま
  #\ッ
  #\女
  #\や
  #\今
  #\子
  #\時
  #\き
  #\ろ
  #\事
  #\け
  #\本
  #\り
  #\コ
  #\ぞ
  #\ど
  #\哉
  #\つ
  #\話
  #\生
  #\気
  #\ス
  #\ぜ
  #\様
  #\電
  #\ち
  #\１
  #\学
  #\お
  #\チ
  #\ク
  #\『
  #\』
  #\間
  #\前
  #\ア
  #\言
  #\見
  #\夏
  #\入
  #\カ
  #\え
  #\人
  #\曲
  #\神
  #\声
  #\３
  #\め
  #\休
  #\ば
  #\イ
  #\物
  #\レ
  #\ポ
  #\ピ
  #\ガ
  #\ャ
  #\出
  #\為
  #\置
  #\分
  #\エ
  #\テ
  #\Ｂ
  #\Ｇ
  #\Ｍ
  #\ュ
  #\８
  #\行
  #\上
  #\ふ
  #\家
  #\最
  #\わ
  #\談
  #\シ
  #\セ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (if (== (: 413) 1) (<> (set-reg: 415 1)))
 (if (&& (== (: 399) 1) (> T 817)) (<> (set-reg: 459 1)))
 (if (== (: 604) 1) (<> (set-reg: 606 1)))
 (if (== (: 785) 1) (<> (set-reg: 786 1)))
 (if (== (: 793) 1) (<> (set-reg: 794 1)))
 (if (== (: 799) 1) (<> (set-reg: 800 1)))
 (if (== (: 805) 1) (<> (set-reg: 806 1)))
 (if (== (: 811) 1) (<> (set-reg: 812 1)))
 (if (== (: 839) 1) (<> (set-reg: 839 0)))
 (set-reg: 835 0)
 (proc 11)
 (if (== (: 608) 0)
   (<>
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "42.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 15)
    (set-arr~ @ 7 0)))
 (if (== (: 837) 0)
   (<>
    (if (== (: 834) 1) (<> (sound 1) (set-var I 39) (proc 26)))
    (if (== (: 834) 2) (<> (sound 1) (set-var I 40) (proc 26)))
    (if (== (: 834) 3) (<> (sound 1) (set-var I 41) (proc 26)))
    (set-reg: 837 0)))
 (set-arr~ @ 7 0)
 (load "42.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (cond
  ((== H 831)
   (<>
    (sound 1)
    (set-var I 16)
    (proc 26)
    (text #:color 7 "【" 0 "】・・・ん！？")
    (wait)
    (text #:color 5 "【神の声】" 0 "よ・・・今日は８月３１日じゃぞ。")
    (wait)
    (text #:color 7 "【" 0 "】それがどうしたんだよ。")
    (wait)
    (text #:color 5 "【神の声】明日からは新学期じゃ・・・今日こそお前の審判の日じゃっ！！")
    (wait)
    (text #:color 5 "【神の声】さあ、自らの手で運命を定めるのじゃ・・・そして行くのじゃっ、" 0 "っ！！")
    (wait)
    (text #:color 7 "【" 0 "】どひゃー！！")
    (wait)
    (set-var H 831)
    (set-var T 1200)
    (proc 11)
    (palette 3 0)
    (slot 1 2)
    (mes-jump "kokuha.mes")))
  ((&& (== (: 150) 0) (== (: 608) 0))
   (<>
    (text #:color 7 "【" 0 "】ただいま俺様は留守にしています・・・ご用のある方は電報でも打ってください、以上。")
    (wait)
    (text #:color 6 "ガチャッ！！")
    (wait)
    (text #:color 7 "【" 0 "】ふう・・・。")
    (wait)
    (sound 1)
    (set-var I 49)
    (proc 26)
    (text #:color 6 "トルルルル・・・トルルルル・・・トルルルル。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 6 "トルルルル・・・トルルルル・・・トルルルル。")
    (wait)
    (text #:color 7 "【" 0 "】あーーーーっ！！うるさいっ！！")
    (wait)
    (text #:color 6 "ガチャッ！！")
    (wait)
    (sound 1)
    (set-var I 39)
    (proc 26)
    (set-reg: 834 1)
    (text #:color 7 "【" 0 "】誰だよっ！！")
    (wait)
    (text #:color 5 "【一哉】俺だよ、一哉だ。")
    (wait)
    (text #:color 7 "【" 0 "】なんだよ・・・こんなに朝早く。")
    (wait)
    (text #:color 5 "【一哉】昼ごろに電話しても、いつもいないからだよ・・・" 0 "の事だから、毎日女の子でも追いかけ回してたのか？")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】お前みたいに、暖かい家庭に包まれて生活しているやつとは違うんだ・・・俺は『学生版単身赴任』だからな。")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】一哉が安穏とした夏休みを過ごしている時に、俺様は労働に精を出していたんだ・・・金がなければ女の子を追いかけ回す事もできないぜ、現実は厳しいんだ。")
    (wait)
    (text #:color 5 "【一哉】じゃあ今日もアルバイトなのか？・・・学生生活最後の夏休みだと言うのに悲しすぎるな。")
    (wait)
    (text #:color 7 "【" 0 "】はっはっはっ！！アルバイトは昨日でおしまいさ・・・今日からが俺様の本当の夏休みだ。")
    (wait)
    (text #:color 5 "【一哉】そうか、ちょうどよかった・・・午前１１時に、先負駅の入口で待ってるぜ。")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】俺様は男とデートしない主義なんだ、それに言っただろ？・・・最後の夏休みを女の子の為だけに費やすぞっ、て。")
    (wait)
    (text #:color 5 "【一哉】わかってるよ・・・俺もお前とデートする気はない、買物につきあってくれと言ってるんだ。")
    (wait)
    (text #:color 7 "【" 0 "】買物だったら、くるみちゃんと一緒に行けばいいだろ？・・・ケンカでもしたのか？")
    (wait)
    (text #:color 5 "【一哉】だからあ、明日はその『くるみ』の誕生日じゃないか・・・俺の彼女の誕生日を忘れたのか？")
    (wait)
    (text #:color 7 "【" 0 "】なんで俺が、くるみちゃんの誕生日まで覚えてなければならんのだ・・・お前の彼女だろ？")
    (wait)
    (text #:color 5 "【一哉】いいからさあ・・・愛するくるみに、洋服をプレゼントしたいんだ・・・だからつき合ってくれよ、いいだろう？")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】いいじゃないか、くるみちゃんは裸の方がかわいいに決まってる・・・だから洋服なんてプレゼントする必要はない。")
    (wait)
    (text #:color 5 "【一哉】" 0 "・・・くるみの裸を見た事があるのか？")
    (wait)
    (text #:color 7 "【" 0 "】はっはっはっ！！冗談だよ、冗談。")
    (wait)
    (text
     #:color
     5
     "【一哉】"
     0
     "が言うと、冗談に聞こえないんだ・・・なんたってお前は、先負学園の女子生徒から『要注意人物』と言われてるヤツだからな。")
    (wait)
    (text #:color 7 "【" 0 "】一哉・・・。")
    (wait)
    (text #:color 5 "【一哉】なんだ？")
    (wait)
    (text #:color 7 "【" 0 "】キスしてくれ。")
    (wait)
    (text #:color 5 "【一哉】お前と話をしていると気が狂いそうだ・・・とにかく、１１時に駅前で待っているからな！！")
    (wait)
    (text #:color 6 "ガチャッ！！")
    (wait)
    (text #:color 7 "【" 0 "】あれれ・・・勝手に切りやがった。")
    (wait)
    (text #:color 7 "【" 0 "】ちぇっ・・・どうして俺様が肉体関係もない女の為に、貴重な時間を割かなくてはならんのだ。")
    (wait)
    (text #:color 7 "【" 0 "】確か１１時って言っていたな・・・今が８時だから、あと３時間後って事か・・・ぶつぶつぶつ。")
    (wait)
    (set-reg: 150 1)))
  ((== (: 646) 1)
   (<>
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ふう・・・やっと帰ったよ。")
    (wait)
    (set-reg: 646 0)))
  ((== (: 652) 1)
   (<>
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】よしこ先生は・・・帰ってしまった。")
    (wait)
    (set-reg: 652 0)))
  ((&& (== (: 324) 1) (== (: 685) 0) (== (: 608) 0))
   (<>
    (text #:color 7 "【" 0 "】いきなり思い出したぞ・・・無修正ぱくぱくの本を、学校の教室に置き忘れていたな。")
    (wait)
    (text #:color 7 "【" 0 "】まあいいや、今度学校に行ったら持って帰ればいい。")
    (wait)))
  ((&& (== (: 150) 1) (== (: 250) 0) (== (: 608) 0))
   (<> (text #:color 7 "【" 0 "】ここは俺の部屋だぞ・・・女の子がいないのが唯一の不満だ。") (wait)))
  ((&& (== (: 250) 1) (== (: 608) 0))
   (<> (text #:color 7 "【" 0 "】部屋に戻って来たぜ・・・ふう。") (wait))))
 (set-reg: 608 0)
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】よーし・・・外に出るぞ。")
         (wait)
         (set-var N 0)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<> (text #:color 7 "【" 0 "】そうだな・・・まだ部屋の中でくつろいでいたい気分だ。") (wait)))
       (else (<>)))))
    ((&& (== (: 414) 1) (== (: 417) 0) (> T 2100) (< T 2345) (> H 818))
     (<>
      (sound 1)
      (set-var I 49)
      (proc 26)
      (text #:color 6 "トルルルル・・・トルルルル・・・トルルルル。")
      (wait)
      (text #:color 7 "【" 0 "】誰だ、こんな時間に・・・俺は電話が嫌いなんだ。")
      (wait)
      (cond
       ((== (: 834) 1) (<> (sound 1) (set-var I 39) (proc 26)))
       ((== (: 834) 2) (<> (sound 1) (set-var I 40) (proc 26)))
       ((== (: 834) 3) (<> (sound 1) (set-var I 41) (proc 26)))
       (else (<>)))
      (text #:color 6 "ガチャッ！！")
      (wait)
      (text #:color 7 "【" 0 "】悪いな、俺は電話嫌いでね・・・電話をかけてると、魂を抜かれるような気がするんだ。")
      (wait)
      (text #:color 6 "【さとみ】" 0 "・・・。")
      (wait)
      (text #:color 7 "【" 0 "】その声は・・・さとみじゃないか！？")
      (wait)
      (text #:color 7 "【" 0 "】めずらしいな、さとみが俺の所に電話してくるなんて。")
      (wait)
      (text #:color 6 "【さとみ】悪いわね、" 0 "が電話嫌いなのは知ってたんだけど・・・ちょっと相談したい事があって。")
      (wait)
      (text #:color 7 "【" 0 "】相談したい事？")
      (wait)
      (text #:color 6 "【さとみ】うん・・・話を聞いてくれる？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いいよ") (text "いやだ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】いいぜ・・・今、どこにいるんだ？")
         (wait)
         (text #:color 6 "【さとみ】" 0 "が住んでるマンションの裏よ。")
         (wait)
         (text #:color 7 "【" 0 "】裏って事は・・・公園にいるのか？")
         (wait)
         (text #:color 6 "【さとみ】うん。")
         (wait)
         (text #:color 7 "【" 0 "】こんな時間に危ないなあ・・・すぐ行くから待っててくれ。")
         (wait)
         (text #:color 6 "【さとみ】ありがとう・・・。")
         (wait)
         (text #:color 6 "ガチャッ！！")
         (wait)
         (text #:color 7 "【" 0 "】こんな時間に、公園に一人でいるなんて・・・あいつ、何やってんだ！？")
         (wait)
         (set-var Q H)
         (set-reg: 418 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いやだよ。")
         (wait)
         (text #:color 6 "【さとみ】そう・・・。")
         (wait)
         (text #:color 7 "【" 0 "】さとみ・・・今、どこにいるんだ？")
         (wait)
         (text #:color 6 "【さとみ】ううん、もういいの・・・じゃあね、" 0 "。")
         (wait)
         (text #:color 6 "ガチャッ！！")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】ちょっと冷たかったかな？")
         (wait)
         (set-reg: 105 (- (: 105) 2))))
       (else (<>)))
      (set-reg: 417 1)))
    ((&& (== V 1) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 7 "【" 0 "】エアコンだな・・・これがないと、俺は毎日ダイエットする事になるだろう。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 1) (== N 1) (== (: 10) 1))
     (<> (text #:color 7 "【" 0 "】だからエアコンだってば・・・。") (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】本当に寝るのかい？")
      (set-reg: 101 0)
      (proc 18)
      (menu-show (<.> (text "はい") (text "いいえ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】ふあああ・・・そうなんだよ、俺は死ぬほど眠たいんだ。")
         (wait)
         (flag 1 0)
         (sound 1)
         (palette 3 0)
         (set-var A 8)
         (proc 13)
         (proc 11)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "42.pd8")
         (proc 15)
         (set-arr~ @ 7 0)
         (palette 3)
         (sound 1)
         (set-var I 8)
         (proc 26)
         (text #:color 7 "【" 0 "】・・・・・・・・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・・・・・・・・。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・よく寝た気がするぞ。")
         (wait)
         (cond
          ((== (: 834) 1) (<> (sound 1) (set-var I 39) (proc 26)))
          ((== (: 834) 2) (<> (sound 1) (set-var I 40) (proc 26)))
          ((== (: 834) 3) (<> (sound 1) (set-var I 41) (proc 26)))
          (else (<>)))
         (if-else (== (: 578) 1) (<> (set-reg: 579 (+ (: 579) 1))) (<>))
         (cond
          ((&& (> (: 579) 1) (== (: 594) 1) (== (: 580) 0))
           (<>
            (text #:color 7 "【" 0 "】あれれ！？")
            (wait)
            (text #:color 7 "【" 0 "】・・・。")
            (wait)
            (text #:color 7 "【" 0 "】なんか・・・ポコチンが痛いような気がする。")
            (wait)
            (text #:color 7 "【" 0 "】・・・。")
            (wait)
            (text #:color 7 "【" 0 "】ポコチンがシクシク痛むぞ・・・変だなあ。")
            (wait)
            (set-reg: 580 1)))
          ((&& (== (: 580) 1) (== (: 598) 0))
           (<>
            (text #:color 7 "【" 0 "】・・・。")
            (wait)
            (text #:color 7 "【" 0 "】なんか・・・ポコチンに違和感があるなあ。")
            (wait)))
          ((&& (== (: 598) 1) (== (: 597) 0))
           (<>
            (text #:color 7 "【" 0 "】うーん・・・ポコチンの調子も絶好調だぜ、完全復活だな、はっはっはっ！！")
            (wait)
            (set-reg: 597 1)))
          (else (<>)))
         (if-else (== H 831)
           (<>
            (sound 1)
            (set-var I 16)
            (proc 26)
            (text #:color 7 "【" 0 "】・・・ん！？")
            (wait)
            (text #:color 5 "【神の声】" 0 "よ・・・今日は８月３１日じゃぞ。")
            (wait)
            (text #:color 7 "【" 0 "】それがどうしたんだよ。")
            (wait)
            (text #:color 5 "【神の声】明日からは新学期じゃ・・・今日こそお前の審判の日じゃっ！！")
            (wait)
            (text #:color 5 "【神の声】さあ、自らの手で運命を定めるのじゃ・・・そして行くのじゃっ、" 0 "っ！！")
            (wait)
            (text #:color 7 "【" 0 "】どひゃー！！")
            (wait)
            (set-var H 831)
            (set-var T 1200)
            (proc 11)
            (palette 3 0)
            (slot 1 2)
            (mes-jump "kokuha.mes"))
           (<>))))
       ((== N 2) (<> (text #:color 7 "【" 0 "】そうだ・・・俺は眠たくないぜ。") (wait)))
       ((== N 3)
        (<>
         (set-arr~ @ 7 0)
         (proc 18)
         (menu-show
          (<.>
           (text "フラグ００")
           (text "フラグ０１")
           (text "フラグ０２")
           (text "フラグ０３")
           (text "フラグ０４")
           (text "フラグ０５")
           (text "フラグ０６")
           (text "フラグ０７")
           (text "フラグ０８")
           (text "フラグ０９")))
         (set-arr~ @ 7 0)
         (set-var A (~ @ 99))
         (set-var I 32768)
         (set-arr~ I 0 A)
         (flag 2 (- N 1))
         (set-arr~ @ 7 0)
         (set-var I 32768)
         (set-var A (~ I 0))
         (set-arr~ @ 99 A)
         (slot 1 2)
         (mes-jump "myroom.mes")))
       ((== N 4)
        (<>
         (text "本当は寝た時のみセーブされるようにします。")
         (wait)
         (set-arr~ @ 7 0)
         (proc 18)
         (menu-show
          (<.>
           (text "フラグ００")
           (text "フラグ０１")
           (text "フラグ０２")
           (text "フラグ０３")
           (text "フラグ０４")
           (text "フラグ０５")
           (text "フラグ０６")
           (text "フラグ０７")
           (text "フラグ０８")
           (text "フラグ０９")))
         (flag 1 (- N 1))))
       (else (<>)))))
    ((&& (== V 1) (== N 3) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】テーブルだな・・・机があるから、このテーブルはほとんど使ってないぞ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 1) (== N 3) (== (: 11) 1))
     (<>
      (text #:color 7 "【" 0 "】テーブルだ・・・狭い部屋なのに、なんで俺はこんな物を置いているんだろう？")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】そうだな・・・このＢＧＭはもう飽きたぞ。")
      (wait)
      (set-reg: 101 0)
      (proc 18)
      (menu-show
       (<.> (text "ＢＧＭ１") (text "ＢＧＭ２") (text "ＢＧＭ３") (text "このままでいい")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな、今の俺様の気分にぴったりな曲は・・・この曲だ。")
         (wait)
         (sound 1)
         (set-var I 39)
         (proc 26)
         (set-reg: 834 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな、今の俺様の気分にぴったりな曲は・・・この曲だ。")
         (wait)
         (sound 1)
         (set-var I 40)
         (proc 26)
         (set-reg: 834 2)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】そうだな、今の俺様の気分にぴったりな曲は・・・この曲だ。")
         (wait)
         (sound 1)
         (set-var I 41)
         (proc 26)
         (set-reg: 834 3)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】そうだよ・・・俺はこの曲が気に入っているんだ、変える必要はないだろう。")
         (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 5) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】テレビを見る気分じゃない・・・夏休みをテレビ三昧で過ごすなんて、俺は御免だぜ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 5) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】テレビなんかいつでも見れる・・・それよりも、他にする事があるだろう？") (wait)))
    ((&& (== V 1) (== N 6) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】スピーカーからは、心地よいＢＧＭが流れている。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 6) (== (: 13) 1))
     (<>
      (text #:color 7 "【" 0 "】スピーカーからは、ＢＧＭが流れているが・・・。")
      (wait)
      (text #:color 7 "【" 0 "】他の曲にしたい場合は、アンプをクリックしてくれ。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】椅子だな・・・この椅子に座ってぐるぐる回ると、童心にかえれるぜ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 7) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】だから椅子だよ・・・座って勉強でもするつもりか？") (wait)))
    ((&& (== V 1) (== N 8) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】俺様の机だ・・・机の上には、本棚とコンピューターが載っている。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 8) (== (: 15) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】俺は机を動かして、模様替えをするつもりはないし・・・ましてや、引きだしの中を整理するつもりなんか毛頭ないぞ。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】教科書やら、参考書やら・・・とにかく色々な本が入っている。")
      (wait)
      (text #:color 7 "【" 0 "】だめだよ、いくら調べても『いやらしい本』は出てこないぜ。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 9) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】本棚と本だ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ！！本の上にホコリが積もっている・・・勉強をしてない証拠だな。")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】デスクライトだな・・・こう暑い日が続くと、蛍光管でもつける気になれないぞ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 10) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】デスクライトだ・・・スイッチはＯＦＦだな。") (wait)))
    ((&& (== V 1) (== N 11) (== (: 175) 1))
     (<>
      (text #:color 7 "【" 0 "】よーし、女の子のデータでも見るか・・・。")
      (wait)
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 170) 1) (text "美穂のデータ"))
        (if (== (: 171) 1) (text "亜子のデータ"))
        (if (== (: 177) 1) (text "さとみのデータ"))
        (if (== (: 183) 1) (text "ひろみのデータ"))
        (if (== (: 217) 1) (text "かおりのデータ"))
        (if (== (: 235) 1) (text "夏子のデータ"))
        (if (== (: 239) 1) (text "よしこのデータ"))
        (if (== (: 248) 1) (text "舞のデータ"))
        (if (== (: 250) 1) (text "くるみのデータ"))
        (if (== (: 223) 1) (text "美沙のデータ"))
        (if (== (: 221) 1) (text "真子のデータ"))
        (if (== (: 463) 1) (text "ちはるのデータ"))
        (if (== (: 554) 1) (text "麗子のデータ"))
        (if (== (: 598) 1) (text "やよいのデータ"))
        (if (== (: 787) 1) (text "その他"))
        (text "やめる")))
      (cond
       ((== N 1) (<> (slot 0 0) (mes-jump "miho_z.mes")))
       ((== N 2) (<> (slot 0 0) (mes-jump "ako_z.mes")))
       ((== N 3) (<> (slot 0 0) (mes-jump "satom_z.mes")))
       ((== N 4) (<> (slot 0 0) (mes-jump "hirom_z.mes")))
       ((== N 5) (<> (slot 0 0) (mes-jump "kaori_z.mes")))
       ((== N 6) (<> (slot 0 0) (mes-jump "natsu_z.mes")))
       ((== N 7) (<> (slot 0 0) (mes-jump "yoshi_z.mes")))
       ((== N 8) (<> (slot 0 0) (mes-jump "mai_z.mes")))
       ((== N 9) (<> (slot 0 0) (mes-jump "kurum_z.mes")))
       ((== N 10) (<> (slot 0 0) (mes-jump "misa_z.mes")))
       ((== N 11) (<> (slot 0 0) (mes-jump "mako_z.mes")))
       ((== N 12) (<> (slot 0 0) (mes-jump "chiha_z.mes")))
       ((== N 13) (<> (slot 0 0) (mes-jump "reiko_z.mes")))
       ((== N 14) (<> (slot 0 0) (mes-jump "yayoi_z.mes")))
       ((== N 15) (<> (slot 1 2) (mes-jump "sonota.mes")))
       ((== N 16) (<> (text #:color 7 "【" 0 "】やーめたっと！！") (wait)))
       (else (<>)))))
    ((&& (== V 1) (== N 11) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】残念だが・・・俺はコンピューターで、女の子のデータが見れる事を、まだ何もしていないぞ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 11) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】気になる女の子の事は、このコンピューターで調べる事ができるぞ。") (wait)))
    ((&& (== V 1) (== N 12) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】俺様が通っている『先負学園』の時間割だ・・・今は夏休みだから、見る必要はないだろう。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 12) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】夏休みの時ぐらい、時間割を見るのはよそうぜ・・・ジンマシンが出てきそうだ。")
      (wait)))
    ((&& (== V 1) (== N 13) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】壁には標語が張ってあるんだ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】『女こそ、我が人生！！』と書かれている・・・青春の甘酸っぱい気持ちを最大限に表現した標語だろ？")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 13) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】『女こそ、我が人生！！』と書かれているんだ・・・すばらしい言葉だな、うん。")
      (wait)))
    ((&& (== V 1) (== N 14) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】これはエアコンのホースだな・・・。")
      (wait)
      (text #:color 7 "【" 0 "】エアコン本体が進化しても、このホースの取り回しはなんとかならんのか？")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 14) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】エアコンのホースだ・・・粘土みたいな物で、壁につけられている。") (wait)))
    ((&& (== V 1) (== N 15) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】コルクボードだな・・・今は何も張ってないが。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 15) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】だからコルクボードだよ・・・そんなに好きなのか、コルクが？") (wait)))
    ((&& (== V 1) (== N 16) (== (: 23) 0))
     (<> (text #:color 7 "【" 0 "】パネルが床に置いてある・・・。") (wait) (set-reg: 23 1)))
    ((&& (== V 1) (== N 16) (== (: 23) 1))
     (<>
      (text #:color 7 "【" 0 "】ポスターが入っているパネルだ・・・どうして床に置いてあるかというと、飾るスペースがないからさ。")
      (wait)))
    ((&& (== V 1) (== N 17) (== (: 24) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】２０までは自分の為だけに生き、３０までは好きな人の為に、４０までは家族の為に、そして４０を過ぎたら社会の為に生きなさい。")
      (wait)
      (text #:color 7 "【" 0 "】電話台だな・・・もちろん上には電話が置いてある。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 17) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】電話台だ・・・アドレス帳とかが入っている。") (wait)))
    ((&& (== V 1) (== N 18))
     (<> (text #:color 7 "【" 0 "】電話だな・・・はっきり言って、俺は電話が嫌いだ。") (wait)))
    ((&& (== V 1) (== N 19) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】ヘッドフォンだな・・・英会話のカセットを聞く時によく使っていたぜ。")
      (wait)
      (text #:color 7 "【" 0 "】過去形と言う事は、今は使っていないという事だ。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 19) (== (: 25) 1))
     (<>
      (text #:color 7 "【" 0 "】ヘッドフォンだな・・・股間に当てて、ボリュームを最大に上げると感じるぜ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】間違っても真似をしないように。")
      (wait)))
    ((&& (== V 1) (== N 20) (== (: 26) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】どこにでもあるような、ＣＤカセットだ・・・道端にＣＤカセットが置いてあっても不思議じゃなほど、ありふれた物だな。")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 20) (== (: 26) 1))
     (<> (text #:color 7 "【" 0 "】ＣＤカセットだ・・・最近は使っていない。") (wait)))
    ((&& (== V 1) (== N 21) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】本棚の中には、色々な本が入っている・・・『女性心理学入門』、『女のくどき方』、『女体の神秘』。")
      (wait)
      (text #:color 7 "【" 0 "】な？・・・色々な本が入っているだろう？")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 21) (== (: 27) 1))
     (<>
      (text #:color 7 "【" 0 "】本棚だ・・・寝ている時に地震があったら、この本棚が倒れてくるかもしれない。")
      (wait)))
    ((&& (== V 1) (== N 22) (== (: 28) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】一哉から借りているヘルメットだな・・・俺達が通っている学校はバイク通学が禁止されているんだが・・・。")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 22) (== (: 28) 1))
     (<> (text #:color 7 "【" 0 "】ヘルメットだ・・・たまには使わないと、カビが生えそうだな。") (wait)))
    ((&& (== V 1) (== N 23) (== (: 29) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】ちょっとだけいやらしいポスターだな・・・俺様のレベルになると、この程度の物ではピュピュッとヌク事ができないぞ。")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 23) (== (: 29) 1))
     (<> (text #:color 7 "【" 0 "】うーん、このポーズ・・・定番って感じだな。") (wait)))
    ((&& (== V 5) (== N 1) (> H 812) (> T 700) (< T 1700) (== (: 280) 0))
     (<>
      (text #:color 7 "【" 0 "】窓を開けると・・・。")
      (wait)
      (slot 1 7)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "24.pd8")
      (proc 15)
      (set-arr~ @ 6 1)
      (image "d07.pd8")
      (proc 16)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "d07an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "d07.s4" (~ @ 2))
      (set-arr~ @ 7 0)
      (animate 0 8 0)
      (animate 4 8)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 7 "【" 0 "】あ・・・。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "d08.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】目と目が合っちゃったよ・・・。")
      (wait)
      (slot 1 2)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "42.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (text #:color 7 "【" 0 "】なんだか・・・寂しそうな感じの人だったな。")
      (wait)
      (set-reg: 280 1)))
    ((&& (== V 5) (== N 1) (== (: 280) 1) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】窓を開けると・・・。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "24.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (text #:color 7 "【" 0 "】誰もいない・・・。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "42.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (cond
       ((== (: 554) 0)
        (<> (text #:color 7 "【" 0 "】和服姿の女性は・・・あの家の住人なのか？") (wait)))
       ((== (: 554) 1) (<> (text #:color 7 "【" 0 "】麗子さんは、家にいないのかな？") (wait)))
       (else (<>)))
      (set-reg: 30 1)))
    ((&& (== V 5) (== N 1) (== (: 280) 1) (== (: 30) 1))
     (<> (text #:color 7 "【" 0 "】おいおい、何度も開けるなよ・・・。") (wait)))
    ((&& (== V 5) (== N 1) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】窓を開けると・・・。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "24.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (text #:color 7 "【" 0 "】マンションの正面に建ってる家の庭が見えるな・・・いったい誰が住んでいるんだろう？")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "42.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (text #:color 7 "【" 0 "】若い女性が一人暮らし・・・なんて事はないか、ははは。")
      (wait)
      (set-reg: 30 1)))
    ((&& (== V 5) (== N 1) (== (: 30) 1))
     (<> (text #:color 7 "【" 0 "】さっき見たばかりだぜ・・・今という時間は、二度とやって来ないんだ。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))