(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\ろ
  #\い
  #\。
  #\ひ
  #\み
  #\、
  #\ん
  #\っ
  #\だ
  #\な
  #\の
  #\か
  #\が
  #\て
  #\！
  #\う
  #\れ
  #\に
  #\や
  #\め
  #\し
  #\た
  #\ま
  #\で
  #\る
  #\ら
  #\こ
  #\？
  #\を
  #\よ
  #\は
  #\も
  #\ち
  #\ゃ
  #\君
  #\そ
  #\ぺ
  #\あ
  #\す
  #\さ
  #\（
  #\）
  #\く
  #\き
  #\ず
  #\ふ
  #\せ
  #\わ
  #\り
  #\え
  #\好
  #\事
  #\け
  #\ー
  #\と
  #\言
  #\脱
  #\身
  #\体
  #\取
  #\子)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "o02.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "o02an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "o02.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "o02.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (set-reg: 331 0)
 (if (== (: 406) 1)
   (<>
    (animate 0 8 1)
    (animate 4 8)
    (text #:color 2 "【ひろみ】ああっ・・・だめえ。")
    (wait)
    (text #:color 7 "【" 0 "】好きなんだよ・・・ひろみちゃん。")
    (wait)
    (text #:color 2 "【ひろみ】嘘・・・" 0 "君が私の事、好きなはずがないもの。")
    (wait)
    (text #:color 7 "【" 0 "】そんな事はないさ・・・ほら、俺は好きでもない女の子で、ここがこんなになるのか？")
    (wait)
    (text #:color 2 "【ひろみ】やだ・・・大きい。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (set-reg: 331 (+ (: 331) 1))
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "興奮する")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】ふんが、ふんが、ふんが！！")
         (wait)
         (text #:color 2 "【ひろみ】いや・・・" 0 "君、鼻息を吹きかけないで。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】ふがふがふがふが、ふーんっ！！")
         (wait)
         (text #:color 2 "【ひろみ】" 0 "君・・・鼻息が荒すぎるわ。")
         (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 1) (== (: 10) 0))
     (<> (text #:color 2 "【ひろみ】んっ・・・いや、駄目よ、" 0 "君。") (wait) (set-reg: 10 1)))
    ((&& (== V 7) (== N 1) (== (: 10) 1))
     (<> (text #:color 2 "【ひろみ】ん・・・舌を入れないで・・・ん・・・。") (wait) (set-reg: 10 2)))
    ((&& (== V 7) (== N 1) (== (: 10) 2))
     (<>
      (text #:color 2 "【ひろみ】んっ・・・こんな濃厚なキス・・・生まれて初めて。")
      (wait)
      (set-reg: 10 3)))
    ((&& (== V 7) (== N 1) (== (: 10) 3) (< (: 331) 11))
     (<> (text #:color 2 "【ひろみ】んん・・・。") (wait)))
    ((&& (== V 7) (== N 1) (== (: 21) 0))
     (<>
      (text #:color 2 "【ひろみ】やめて・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】いやだ。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君・・・恐い。")
      (wait)
      (text #:color 7 "【" 0 "】ひろみちゃん・・・どうして脚を開いて椅子に座ってたの？")
      (wait)
      (text #:color 2 "【ひろみ】そ、それは・・・。")
      (wait)
      (text #:color 7 "【" 0 "】本当は・・・こうしたかったんだろ？")
      (wait)
      (text #:color 2 "【ひろみ】違うわ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（よーし、ここで一発びしっと・・・。）")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "乱暴に言う") (text "優しく言う") (text "丁寧に言う")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】ひろみ、脱げっ！！")
         (wait)
         (text #:color 2 "【ひろみ】い、いやあ。")
         (wait)
         (text #:color 7 "【" 0 "】何がいやだよ、さっきから下着を見せてたくせに・・・脱がないなら、服を破いちゃうぞっ！！")
         (wait)
         (text #:color 2 "【ひろみ】わ、わかったから・・・乱暴にしないで。")
         (wait)
         (text #:color 7 "【" 0 "】この格好じゃだめだ、そのまま机によりかかって・・・片足を椅子の背もたれに乗せろっ！！")
         (wait)
         (text #:color 2 "【ひろみ】い、いや・・・そんな格好、恥ずかしい。")
         (wait)
         (text #:color 7 "【" 0 "】やれっ！！")
         (wait)
         (text #:color 2 "【ひろみ】わ、わかった・・・言う通りにするから怒鳴らないで。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ひろみちゃん・・・お願いだ、君の身体が見たいんだ。")
         (wait)
         (text #:color 2 "【ひろみ】恥ずかしい・・・。")
         (wait)
         (text #:color 7 "【" 0 "】恥ずかしくないさ・・・ひろみちゃんの身体は奇麗に決まってる。")
         (wait)
         (text #:color 2 "【ひろみ】でも・・・。")
         (wait)
         (text #:color 7 "【" 0 "】いいだろ？・・・さあ、そのまま机に寄りかかって、片足を椅子の背もたれの上に。")
         (wait)
         (text #:color 2 "【ひろみ】うん・・・。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】すいませんが、私の言う事を聞いてください・・・。")
         (wait)
         (text #:color 2 "【ひろみ】え？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】恐縮ですが、私はひろみさんの身体が見たいんです・・・よって、そのまま身体を後ろに４５度傾け、片足を椅子の背もたれに乗せていただけませんか？")
         (wait)
         (text #:color 2 "【ひろみ】いや・・・そんな格好恥ずかしい。")
         (wait)
         (text #:color 7 "【" 0 "】いいえ、そんな事はありません・・・ひろみさんの身体は、とってもビューティフルなはずです。")
         (wait)
         (text #:color 2 "【ひろみ】言う通りにするから・・・その喋り方だけはやめて、気持ち悪いわ。")
         (wait)
         (set-reg: 103 (- (: 103) 1))))
       (else (<>)))
      (set-var A 1)
      (proc 13)
      (proc 11)
      (slot 1 8)
      (mes-jump "o07.mes")))
    ((&& (== V 10) (== N 2) (== (: 11) 0))
     (<> (text #:color 2 "【ひろみ】いやあ、くすぐったい・・・。") (wait) (set-reg: 11 1)))
    ((&& (== V 10) (== N 2) (== (: 11) 1))
     (<> (text #:color 2 "【ひろみ】だめよ・・・身体の力が抜けちゃう。") (wait)))
    ((&& (== V 8) (== N 3) (== (: 12) 0))
     (<> (text #:color 7 "【" 0 "】（思ったより、ずっと柔らかい・・・。）") (wait) (set-reg: 12 1)))
    ((&& (== V 8) (== N 3) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】（柔らかい髪だ・・・。）") (wait)))
    ((&& (== V 7) (== N 4) (== (: 13) 0))
     (<>
      (text #:color 2 "【ひろみ】あんっ・・・こんな事、駄目よ・・・もうやめましょ？")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 7) (== N 4) (== (: 13) 1))
     (<> (text #:color 2 "【ひろみ】んん・・・ん・・・。") (wait)))
    ((&& (== V 6) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 2 "【ひろみ】だめっ・・・それは取っちゃだめえ！！")
      (wait)
      (text #:color 7 "【" 0 "】（これさえ取れれば・・・胸が見れるぞ。）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 6) (== N 5) (== (: 14) 1))
     (<> (text #:color 2 "【ひろみ】だめよ、" 0 "君・・・ね？") (wait)))
    ((&& (== V 6) (== N 6) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（これを取るって・・・もう取れてるよ。）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 6) (== N 6) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（だから、もう取れてるってば・・・。）") (wait)))
    ((&& (== V 6) (== N 7) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（このまま引っ張っても、取れるはずがない・・・。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 6) (== N 7) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（無理に引っ張ると、破けちゃうぞ。）") (wait)))
    ((&& (== V 6) (== N 8) (== (: 17) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君・・・だめよ、脱がさないで。")
      (wait)
      (text #:color 7 "【" 0 "】脱がしたい。")
      (wait)
      (text #:color 2 "【ひろみ】会社の中で・・・そんな事、駄目。")
      (wait)
      (text #:color 7 "【" 0 "】会社の中だから、興奮するんだろ？")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 6) (== N 8) (== (: 17) 1))
     (<>
      (text #:color 2 "【ひろみ】だめだめっ！！")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、このポーズだと脱がせにくいなあ。）")
      (wait)))
    ((&& (== V 6) (== N 9) (== (: 18) 0))
     (<>
      (text #:color 2 "【ひろみ】いや・・・破れちゃう。")
      (wait)
      (text #:color 7 "【" 0 "】ひろみちゃん、お尻を浮かしてくれ。")
      (wait)
      (text #:color 2 "【ひろみ】だめえ・・・。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 6) (== N 9) (== (: 18) 1))
     (<> (text #:color 2 "【ひろみ】だめよ、" 0 "君・・・無理に脱がさないで。") (wait)))
    ((&& (== V 10) (== N 10) (== (: 19) 0))
     (<> (text #:color 2 "【ひろみ】ああ・・・いや、手をペロペロしちゃだめ。") (wait) (set-reg: 19 1)))
    ((&& (== V 10) (== N 10) (== (: 19) 1))
     (<> (text #:color 2 "【ひろみ】いやいや・・・手をなめるなんて。") (wait)))
    ((&& (== V 10) (== N 11) (== (: 20) 0))
     (<>
      (text #:color 2 "【ひろみ】くすぐったあい！！")
      (wait)
      (text #:color 7 "【" 0 "】ぺろぺろぺろ・・・ぺろ。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君って・・・いやらしい。")
      (wait)
      (text #:color 7 "【" 0 "】まだまだ、これからもっといやらしくなるんだぜ。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 10) (== N 11) (== (: 20) 1))
     (<>
      (text #:color 2 "【ひろみ】お願い・・・もう・・・だめ。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、だんだん感じてきたのかな？）")
      (wait)))
    ((&& (== V 10) (== N 12) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】ぺっぺっぺっ！！")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君・・・どうしたの？")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 10) (== N 12) (== (: 22) 1))
     (<>
      (text #:color 7 "【" 0 "】ぺっぺっぺっぺっ・・・ぺっ！！")
      (wait)
      (text #:color 2 "【ひろみ】？？？")
      (wait)
      (text #:color 7 "【" 0 "】き、気にしないでくれ。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))