(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\。
  #\の
  #\、
  #\【
  #\】
  #\ひ
  #\ろ
  #\っ
  #\み
  #\な
  #\る
  #\て
  #\ん
  #\あ
  #\は
  #\に
  #\た
  #\を
  #\し
  #\う
  #\だ
  #\ま
  #\が
  #\で
  #\と
  #\そ
  #\俺
  #\女
  #\も
  #\か
  #\め
  #\く
  #\彼
  #\す
  #\き
  #\れ
  #\じ
  #\ら
  #\よ
  #\君
  #\り
  #\感
  #\お
  #\！
  #\ー
  #\こ
  #\さ
  #\私
  #\？
  #\事
  #\ゃ
  #\や
  #\え
  #\ず
  #\ち
  #\わ
  #\せ
  #\見
  #\恥
  #\ど
  #\我
  #\慢
  #\身
  #\好
  #\つ
  #\言
  #\体
  #\上
  #\分
  #\激
  #\視
  #\ス
  #\中
  #\ぶ
  #\け
  #\一
  #\気
  #\手
  #\何
  #\出)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "o07.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 2)
 (image "o03.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 27)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 2)
 (image "o04.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 27)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 2)
 (image "o05.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 27)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 2)
 (image "o06.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 27)
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "o07an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "o07.s4" (~ @ 2))
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "o07.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (set-reg: 331 0)
 (if (== (: 406) 1)
   (<>
    (text #:color 2 "【ひろみ】は、恥ずかしい・・・。")
    (wait)
    (text
     #:color
     7
     "俺はひろみに過激な格好をさせ、そのまま下がってしばらくその姿を眺める。ひろみは恥ずかしそうに頬を赤らめ、視線を俺からそらしている。")
    (wait)
    (text #:color 2 "【ひろみ】い、いや・・・そんなに見ないで。")
    (wait)
    (text #:color 7 "ひろみの肩がかすかに震えている。俺はその肩をそっと抱き、スルスルとブレザーを脱がせた。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "o07.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 2)
    (image "o03.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 27)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 2)
    (image "o04.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 27)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 2)
    (image "o05.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 27)
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o07an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "o07.s4" (~ @ 2))
    (set-arr~ @ 7 0)
    (animate 0 8 0)
    (animate 4 8)
    (text #:color 2 "【ひろみ】あ・・・。")
    (wait)
    (text
     #:color
     7
     "いい眺めだ・・・俺は床に座り、さらにひろみを見る。ひろみはいやがりながらも、この欲情をそそる格好を変えようとしない。")
    (wait)
    (text #:color 2 "【ひろみ】" 0 "君・・・私をどうするつもり？")
    (wait)
    (text #:color 7 "どうするつもりって、決まってるじゃないか・・・と、俺は頭の中でつぶやく。")
    (wait)
    (text #:color 2 "【ひろみ】この格好はいや・・・恥ずかしくて我慢できない。")
    (wait)
    (text
     #:color
     7
     "恥ずかしいから興奮するんじゃないか、女は恥らえば恥らうほど濡れるもんだ・・・と、俺のひいひいおじいさんが言っていた・・・嘘だけど。")
    (wait)
    (text #:color 2 "【ひろみ】" 0 "君・・・私をこのままにしておくつもり？")
    (wait)
    (text #:color 7 "俺はひろみに近づき唇にキスをすると、そのままシャツのボタンをはずした。")
    (wait)
    (text #:color 2 "【ひろみ】あ・・・いや。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "o07.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 2)
    (image "o03.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 27)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 2)
    (image "o04.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 27)
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o07an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "o07.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (animate 0 8 0)
    (animate 4 8)
    (text #:color 7 "彼女の姿を見ていると、一気に脱がす事がおしくなってくる・・・女は子宮で感じ、男は視覚で感じると言った人は偉い。")
    (wait)
    (text #:color 2 "【ひろみ】もう、だめよ・・・この格好はいや。")
    (wait)
    (text #:color 7 "彼女がポーズを変えようとするのを、言葉ではなく表情で制止した・・・こういう時の女性は、男の表情に敏感なんだ。")
    (wait)
    (text #:color 2 "【ひろみ】見ないで、見られていると・・・。")
    (wait)
    (text #:color 7 "見られていると、感じてきちゃう・・・か？")
    (wait)
    (text #:color 7 "このままずっと見ている訳にもいかない。俺は多少未練を残しながら、彼女のスカートに手をかけた。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "o07.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 2)
    (image "o03.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 27)
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o07an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "o07.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (animate 0 8 0)
    (animate 4 8)
    (text #:color 2 "【ひろみ】ああ・・・。")
    (wait)
    (text #:color 7 "彼女はもう、脱がされる事には抵抗を感じてない・・・むしろ、俺の視線に対して抵抗しているようだ。")
    (wait)
    (text #:color 2 "【ひろみ】ん・・・。")
    (wait)
    (text #:color 7 "俺はまだ何もしていないのに、彼女は感じ始めている・・・ようするに、俺の視線が彼女を刺激している訳だ。")
    (wait)
    (text #:color 2 "【ひろみ】我慢できない・・・" 0 "君。")
    (wait)
    (text #:color 7 "我慢できない・・・このポーズが我慢できないのか？")
    (wait)
    (text #:color 7 "いいや、違うな・・・服を脱がされる事も、この淫乱なポーズも、彼女にとっては我慢できない事じゃない。")
    (wait)
    (text #:color 7 "そう、俺が何もしない事が一番我慢できない事なんだ。")
    (wait)
    (text #:color 7 "俺は彼女の下着を一気にはがす事した・・・。")
    (wait)
    (text #:color 2 "【ひろみ】ああっ・・・いやあ！！")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "o07.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o07an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "o07.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 54)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】奇麗な身体だ・・・。")
    (wait)
    (text #:color 2 "【ひろみ】" 0 "君・・・恥ずかしい。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (set-reg: 331 (+ (: 331) 1))
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "叫ぶ")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】おおおおおーっ！！")
         (wait)
         (text #:color 2 "【ひろみ】だめ・・・まだ出しちゃだめ。")
         (wait)
         (text #:color 7 "【" 0 "】（ご、誤解されてしまった・・・。）")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】おおおおおーーーっ・・・うっ！！")
         (wait)
         (text #:color 2 "【ひろみ】早すぎる・・・まだだめえ！！")
         (wait)
         (text #:color 7 "【" 0 "】（ま、またまた誤解されてしまった。）")
         (wait)))
       (else (<>)))))
    ((&& (== V 7) (== N 1) (== (: 10) 0))
     (<> (text #:color 2 "【ひろみ】ん・・・んんん・・・とろけそう。") (wait) (set-reg: 10 1)))
    ((&& (== V 7) (== N 1) (== (: 10) 1))
     (<> (text #:color 2 "【ひろみ】素敵よ・・・" 0 "君。") (wait) (set-reg: 10 2)))
    ((&& (== V 7) (== N 1) (== (: 10) 2))
     (<> (text #:color 2 "【ひろみ】ああ・・・身体がほてってきちゃう。") (wait)))
    ((&& (== V 10) (== N 2) (== (: 11) 0))
     (<> (text #:color 2 "【ひろみ】あんっ・・・感じるう。") (wait) (set-reg: 11 1)))
    ((&& (== V 10) (== N 2) (== (: 11) 1))
     (<> (text #:color 2 "【ひろみ】耳の穴に・・・んんっ・・・舌を入れないで。") (wait)))
    ((&& (== V 8) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君って・・・女の子の扱に慣れてる。")
      (wait)
      (text #:color 2 "【ひろみ】あなたって、今までどんな事をしてきたの・・・？")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 8) (== N 3) (== (: 12) 1))
     (<>
      (text #:color 2 "【ひろみ】あんっ・・・ん。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君って・・・優しい。")
      (wait)))
    ((&& (== V 7) (== N 4) (== (: 13) 0))
     (<> (text #:color 2 "【ひろみ】あっ・・・顔にもキスしてくれるの？") (wait) (set-reg: 13 1)))
    ((&& (== V 7) (== N 4) (== (: 13) 1))
     (<> (text #:color 2 "【ひろみ】" 0 "君・・・本気で好きになっちゃいそう。") (wait)))
    ((&& (== V 10) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 2 "【ひろみ】あっ・・・首はだめ・・・私、感じすぎちゃうの。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 10) (== N 5) (== (: 14) 1))
     (<> (text #:color 2 "【ひろみ】あは・・・ん。") (wait)))
    ((&& (== V 10) (== N 6) (== (: 15) 0))
     (<> (text #:color 2 "【ひろみ】あっ・・・んん。") (wait) (set-reg: 15 1)))
    ((&& (== V 10) (== N 6) (== (: 15) 1))
     (<> (text #:color 2 "【ひろみ】んんっ・・・感じる・・・感じちゃう。") (wait) (set-reg: 15 2)))
    ((&& (== V 10) (== N 6) (== (: 15) 2))
     (<> (text #:color 2 "【ひろみ】んんっ・・・舌で・・・そんな事・・・ああっ。") (wait)))
    ((&& (== V 9) (== N 7) (== (: 16) 0))
     (<>
      (text #:color 2 "【ひろみ】あんっ・・・私の胸って、思ったより小さいでしょ？")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 9) (== N 7) (== (: 16) 1))
     (<> (text #:color 2 "【ひろみ】んんんっ・・・いいっ・・・すごくいい。") (wait) (set-reg: 16 2)))
    ((&& (== V 9) (== N 7) (== (: 16) 2))
     (<> (text #:color 2 "【ひろみ】" 0 "君の手が・・・私の胸を触ってるう。") (wait)))
    ((&& (== V 12) (== N 8) (> (: 331) 14))
     (<>
      (text #:color 2 "【ひろみ】も、もう我慢できない・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ひろみちゃん・・・。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君、私がリードしてあげる・・・机の上に寝て。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "o08.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "o08an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "o08.s4" (~ @ 2))
      (animate 0 0 0)
      (animate 1 0)
      (set-arr~ @ 7 0)
      (text #:color 7 "何を思ったのか、彼女は寝ている俺の身体らまたがり、俺のズボンを降ろしはじめた。")
      (wait)
      (text #:color 2 "【ひろみ】わあ・・・すごい。")
      (wait)
      (text #:color 7 "俺は、彼女のなすがままだ・・・リードすると言われた以上、へたに動かないほうがいいだろう。")
      (wait)
      (text #:color 2 "【ひろみ】あっ・・・。")
      (wait)
      (text #:color 7 "うーん、これまたいい眺めだ・・・彼女の秘部に俺の視線が釘づけになる。")
      (wait)
      (text #:color 2 "【ひろみ】だめよ・・・見ちゃだめ。")
      (wait)
      (text #:color 7 "彼女は俺の一物を手で握り、自分の淫肉の部分にその先端を食い込ませる。")
      (wait)
      (text #:color 2 "【ひろみ】あ・・・" 0 "君の・・・大きい。")
      (wait)
      (text #:color 7 "彼女は大きく息をはいた・・・そして、ゆっくりと俺の固くなった肉棒を、自分の内側へと導く。")
      (wait)
      (text #:color 2 "【ひろみ】あ・・・あ・・・あはあ。")
      (wait)
      (text
       #:color
       7
       "ずっ、ずっ、と音をたてるように、彼女の奥深くへと吸い込まれる。濡れたその内側は、彼女の身体のほてりと同じように、妙に熱い。")
      (wait)
      (text #:color 2 "【ひろみ】んんっ・・・あん・・・" 0 "君。")
      (wait)
      (text #:color 7 "彼女は俺の名前を呼ぶと、ゆっくりと腰を上下させた・・・そのたびに、彼女の口から小さな悲鳴が漏れる。")
      (wait)
      (text #:color 2 "【ひろみ】いい・・・すごく・・・よるぎるう。")
      (wait)
      (text "腰の動きが少しづつ早くなる・・・俺の肉棒は、彼女の濡れた部分の入口、そしてその内側を激しく刺激している。")
      (wait)
      (text #:color 2 "【ひろみ】あは・・・んんっ・・・。")
      (wait)
      (text
       #:color
       7
       "彼女は腰を上下させるだけでなく、前後にゆすり始めた・・・このまま彼女の感じるままに、俺は身体をまかせる事に決めた。")
      (wait)
      (text #:color 2 "【ひろみ】あんんっ・・・あんんっ・・・あんんっ・・・。")
      (wait)
      (text
       #:color
       7
       "自分の腰の動きに合わせ、彼女のあえぎ声が激しくなる。そして、俺と彼女がつながっている部分を手をそえ、中に入ったままの俺イチモツを手でこすり始めた。")
      (wait)
      (text #:color 2 "【ひろみ】ど、どう？・・・" 0 "君も・・・あ・・・感じる？")
      (wait)
      (text #:color 7 "た、確かに感じる・・・俺はあふれ出そうになるのを、必死でこらえる。")
      (wait)
      (text #:color 2 "【ひろみ】私・・・私・・・もうだめ・・・い、いきそう。")
      (wait)
      (text #:color 7 "だ、だめ・・・俺もだめだ・・・そうだ、頭の中で暗算をすれば・・・。")
      (wait)
      (text #:color 7 "４８９５４＋２５８７５は？・・・えーと、えーと。")
      (wait)
      (text #:color 2 "【ひろみ】あっ・・・ああっ・・・ああっ・・・あんんっ！！")
      (wait)
      (text
       #:color
       7
       "そ、そんなに早く動かないでくれ、と、俺は心の中で叫ぶ。も、もうだめだ・・・あふれ出る物を、押える事ができない。")
      (wait)
      (text #:color 2 "【ひろみ】い・・・いく・・・ひいっ・・・ひいいいっ！！")
      (wait)
      (text #:color 2 "【ひろみ】いいいいいいっ・・・！！")
      (wait)
      (text
       #:color
       7
       "彼女は悲鳴のような事を上げると、そのままぐったりと俺の身体の上にかぶさって来る・・・そして俺はすでに、彼女の中でたっぷりと吐き出していた。")
      (wait)
      (text #:color 7 "心地よい疲労感を感じながら、俺は彼女を抱きしめ、ゆっくりと目を閉じた。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "kuro.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (sound 1)
      (set-var I 29)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 2 "【ひろみ】" 0 "君・・・とってもよかったわ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【ひろみ】このままあなたに会ってると、本気で好きになってしまいそう・・・でもあなたは１８歳の男の子なのよね。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【ひろみ】決めたわ・・・私、もう" 0 "君に会わないようにする。")
      (wait)
      (text #:color 7 "【" 0 "】！？")
      (wait)
      (text #:color 2 "【ひろみ】何も言わないで・・・あなたにとっても、私にとってもそれが一番いいのよ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君は大人だから・・・私の言ってる事がわかるはずよ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【ひろみ】もうわかったでしょ？・・・私自身が" 0 "君へのプレゼントだったの。")
      (wait)
      (text #:color 2 "【ひろみ】さようなら、" 0 "君・・・１０年後ぐらいに、私みたいな女の子もいたなって・・・思い出してね。")
      (wait)
      (set-reg: 103 (+ (: 103) 5))
      (field 14 1 1)
      (field 13 0 0)
      (field 13 1 1)
      (set-reg: 1001 0)
      (set-var N 4)
      (set-var A 1)
      (proc 13)
      (proc 11)
      (mouse 4 49152)
      (mouse 0)
      (slot 1 2)
      (mes-jump "town1.mes")))
    ((&& (== V 12) (== N 8) (== (: 17) 0))
     (<> (text #:color 2 "【ひろみ】だ、だめ・・・まだ早いわ。") (wait) (set-reg: 17 1)))
    ((&& (== V 12) (== N 8) (== (: 17) 1))
     (<> (text #:color 2 "【ひろみ】いや・・・まだだめ。") (wait) (set-reg: 17 2)))
    ((&& (== V 12) (== N 8) (== (: 17) 2))
     (<> (text #:color 2 "【ひろみ】あんっ・・・だ、だめよ・・・あせらないで。") (wait)))
    ((&& (== V 10) (== N 9) (== (: 18) 0))
     (<> (text #:color 2 "【ひろみ】ああんっ・・・そんな・・・なめないで。") (wait) (set-reg: 18 1)))
    ((&& (== V 10) (== N 9) (== (: 18) 1))
     (<> (text #:color 2 "【ひろみ】んんっ・・・くすぐったい。") (wait) (set-reg: 18 2)))
    ((&& (== V 10) (== N 9) (== (: 18) 2))
     (<>
      (text #:color 2 "【ひろみ】あ・・・" 0 "君の舌って・・・気持ちいい。")
      (wait)
      (set-reg: 18 3)))
    ((&& (== V 10) (== N 9) (== (: 18) 3))
     (<> (text #:color 2 "【ひろみ】いやいや・・・そこは感じちゃうの。") (wait) (set-reg: 18 4)))
    ((&& (== V 10) (== N 9) (== (: 18) 4))
     (<> (text #:color 2 "【ひろみ】んんんっ・・・あっ・・・。") (wait)))
    ((&& (== V 11) (== N 10) (== (: 19) 0))
     (<> (text #:color 7 "【" 0 "】あたたた・・・歯が折れる。") (wait) (set-reg: 19 1)))
    ((&& (== V 11) (== N 10) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】おいおい、俺は何をしてるんだ？") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))