(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\な
  #\。
  #\舞
  #\、
  #\っ
  #\ん
  #\の
  #\だ
  #\う
  #\て
  #\に
  #\し
  #\る
  #\が
  #\は
  #\た
  #\か
  #\と
  #\で
  #\？
  #\ゃ
  #\こ
  #\！
  #\を
  #\も
  #\ら
  #\ち
  #\事
  #\（
  #\）
  #\ど
  #\君
  #\そ
  #\あ
  #\け
  #\く
  #\き
  #\マ
  #\ー
  #\れ
  #\思
  #\や
  #\ま
  #\お
  #\私
  #\わ
  #\り
  #\言
  #\よ
  #\女
  #\み
  #\話
  #\ひ
  #\す
  #\ふ
  #\え
  #\じ
  #\つ
  #\め
  #\ね
  #\方
  #\泳
  #\俺
  #\何
  #\水
  #\本
  #\仲
  #\ろ
  #\見)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (image "51.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 6 1)
 (image "w.pd8")
 (proc 25)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "wan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "w.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 24)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "w.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 248) 0)
   (<>
    (text #:color 7 "【" 0 "】舞ちゃん！？")
    (wait)
    (text #:color 3 "【舞】" 0 "君・・・こんにちは。")
    (wait)
    (text #:color 7 "【" 0 "】こ、こ、こ、こ、こ、こんちは。")
    (wait)
    (text #:color 3 "【舞】ふふっ・・・変な" 0 "君。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "校庭に戻る") (text "プール入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】いやだ・・・絶対にいやだ。") (wait)))
       ((&& (== N 1) (> H 813) (< H 817) (== (: 271) 1))
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・校庭に戻るか。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、またお話をしましょうね。")
         (wait)
         (text #:color 7 "【" 0 "】うんうんっ！！")
         (wait)
         (set-reg: 248 1)
         (set-reg: 175 1)
         (set-reg: 309 1)
         (slot 1 3)
         (mes-jump "koutei2.mes")))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】仕方がない・・・戻るか。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、またお話をしましょうね。")
         (wait)
         (text #:color 7 "【" 0 "】うんうんっ！！")
         (wait)
         (set-reg: 248 1)
         (set-reg: 175 1)
         (set-reg: 309 1)
         (slot 1 3)
         (mes-jump "koutei.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【舞】" 0 "君も泳ぐの？")
         (wait)
         (text #:color 7 "【" 0 "】いーやっ！！俺はここで舞ちゃんと話がしたい。")
         (wait)
         (text #:color 3 "【舞】私も・・・" 0 "君と話がしたいわ。")
         (wait)))
       ((== N 3)
        (<> (text #:color 7 "【" 0 "】そうだよ・・・舞ちゃんがいる限り、俺はここにいるぞ。") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 3 "【舞】" 0 "君・・・ここで何をしてるの？")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・俺は。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "舞に会う為") (text "目の保養") (text "毒を盛りに来た")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】舞ちゃんがいないかなって・・・思ってさ。")
         (wait)
         (text #:color 3 "【舞】私が？・・・私に何か用かしら？")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ひっひっひっ・・・そりゃあ決ってるさ。")
         (wait)
         (text #:color 3 "【舞】なに？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】目の保養に来たんだ・・・水着姿の女の子を、しっかりと網膜に焼き付けて、夜になったら・・・ひっひっひっ。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・いやらしい。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】ここだけの話だけど・・・毒を盛りに来たんだ。")
         (wait)
         (text #:color 3 "【舞】え！？")
         (wait)
         (text #:color 7 "【" 0 "】だからあ、プールの中に毒を盛って・・・。")
         (wait)
         (text #:color 3 "【舞】ふふふっ・・・" 0 "君って、みんなが言う通り面白い人なのね。")
         (wait)
         (text #:color 7 "【" 0 "】本気だったのに。")
         (wait)
         (text #:color 3 "【舞】それ以上言わないで、はしたなく笑っちゃいそうだから。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんは、ここで何をしてるの？")
      (wait)
      (text #:color 7 "【" 0 "】って、舞ちゃんは水泳部だったね・・・愚問だった。")
      (wait)
      (text #:color 3 "【舞】本当は、みんなと一緒に練習したいけど・・・私、色々とお稽古事があるから。")
      (wait)
      (text #:color 3 "【舞】今日も練習に出たいけど、今から日本舞踊のお稽古だから・・・ちょっとだけ、みんなに会いに来ただけ。")
      (wait)
      (text #:color 7 "【" 0 "】そうか・・・それで水着じゃないんだ。")
      (wait)
      (text #:color 3 "【舞】ママが私に言うの・・・水泳部なんか辞めて、もっと教養が身に付く稽古事に励みなさいって。")
      (wait)
      (text #:color 3 "【舞】でも私、泳ぐ事が大好きだし・・・みんなと一緒にいると、とても楽しいし・・・。")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・それでもママの言う事をきいた方がいいのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "きいた方がいい") (text "ママを殺せ") (text "きかなくていい")))
      (cond
       ((== N 1)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】ママの言う事は正しいんじゃないの？・・・舞ちゃんはお嬢様だし、お金持ちの家に生まれた訳だし、俺達とは違う世界に住んでいるんだから。")
         (wait)
         (text #:color 3 "【舞】そんな悲しくなる事を言わないで・・・私は、みんなと一緒だと思っていたのに。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】きくもきかないも・・・簡単な解決方法があるぜ。")
         (wait)
         (text #:color 3 "【舞】どうすればいいの？")
         (wait)
         (text #:color 7 "【" 0 "】ママを殺せ。")
         (wait)
         (text #:color 3 "【舞】私・・・真面目に相談してたのに。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 3)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】ママの言う事もわからなくはないけど・・・一度しかない学生生活なんだから、好きな事をした方がいいと思うぜ。")
         (wait)
         (text #:color 3 "【舞】本当にそう思う？")
         (wait)
         (text #:color 7 "【" 0 "】自分が楽しいと思う事を、いっぱいやって・・・余った時間で、お稽古事をすればいいんだよ。")
         (wait)
         (text #:color 3 "【舞】うん・・・本当は、私もそう思うの。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】なあ・・・健二の事をどう思う？")
      (wait)
      (text #:color 3 "【舞】健二君？・・・幼馴染みだし、いい人だと思うけど。")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 3 "【舞】どうしてそんな事を聞くの？")
      (wait)
      (text #:color 7 "【" 0 "】い、いいや・・・何でもない。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 3 "【舞】" 0 "君は、健二君と仲がいいの？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "仲がいい") (text "仲が悪い")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】はっはっはっ！！仲がいいよ、すっごくいいよ、はっはっはっ！！")
         (wait)
         (text #:color 3 "【舞】なんだか、顔がひきつってるけど・・・。")
         (wait)
         (text #:color 7 "【" 0 "】え！？・・・気のせいじゃない？")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】仲は・・・悪いな。")
         (wait)
         (text #:color 3 "【舞】どうして？")
         (wait)
         (text #:color 7 "【" 0 "】どうしてって・・・相性が悪いんじゃないか？")
         (wait)
         (text #:color 3 "【舞】ふーん・・・舞はいい人だと思うけど。")
         (wait)
         (text #:color 7 "【" 0 "】悪いやつだとは思わないけど・・・ほら、何となく合わないやつっているだろ？")
         (wait)))
       (else (<>)))
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 0))
     (<>
      (text #:color 3 "【舞】あ・・・もう行かないと。")
      (wait)
      (text #:color 3 "【舞】" 0 "君と話をすると、元気が出てくるの・・・またお話をしてくれる？")
      (wait)
      (text #:color 7 "【" 0 "】よ、喜んで！！")
      (wait)
      (text #:color 3 "【舞】・・・よかった。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 3 "【舞】" 0 "君・・・先に行って。")
      (wait)
      (text #:color 7 "【" 0 "】どうして？")
      (wait)
      (text #:color 3 "【舞】" 0 "君がいると・・・ここから離れたくなくなっちゃう。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（奇麗な髪・・・まるでシルクのようだ。）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 2) (== (: 14) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（ベスト・オブ・ヘヤーだぜ・・・触ってみたいけど、舞ちゃんだけは冗談でもそんな事はできないんだ。）")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんがしてると、リボンまでも神聖に見えてしまう。）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 3) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（かわいいリボンだ・・・俺もリボンになりたい。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 16) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（かわいいなんて言葉じゃ足りなすぎる・・・うーん、彼女のかわいらしさを形容する言葉が見つからない。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 4) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（見つめていたい・・・ずっと見つめていたい。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（ああ・・・この首に触れる事ができるのは、舞ちゃん以外いないだろうな！？）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（いたら、殴っちゃうぞ。）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 5) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（この首にキスできたら・・・寿命が半分になってもいい！！）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】（白い肌・・・水泳部なのに、どうしてこんなに白いんだろ？）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 6) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの胸元が少し見えている事は・・・他の女の全裸と同じくらいの価値があるぞ。）")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 19) 0))
     (<> (text #:color 7 "【" 0 "】（駄目だ・・・正視する事ができない。）") (wait) (set-reg: 19 1)))
    ((&& (== V 1) (== N 7) (== (: 19) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（ああ、舞ちゃんにも『おっぱい』があるなんて・・・彼女の存在だけで、血管から血が吹き出しそうなのに！！）")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんのセーラー服だ・・・。）")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】（他の女はゴザでも巻いていればいいんだ・・・セーラー服は、彼女の為だけにある事を法律で決めろっ！！）")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 8) (== (: 20) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（素直で頭もよくて、清潔で上品で・・・それでいて、普通の女の子が持っている魅力を全て兼ね備えてる。）")
      (wait)
      (text #:color 7 "【" 0 "】（ああ・・・他の女どもにしたら、こんな不公平な事はないだろう。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))