(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\い
  #\う
  #\な
  #\舞
  #\ん
  #\、
  #\の
  #\っ
  #\か
  #\て
  #\し
  #\る
  #\と
  #\は
  #\だ
  #\ち
  #\ゃ
  #\そ
  #\？
  #\ら
  #\に
  #\も
  #\た
  #\よ
  #\（
  #\）
  #\れ
  #\が
  #\君
  #\事
  #\！
  #\あ
  #\を
  #\や
  #\わ
  #\お
  #\き
  #\俺
  #\く
  #\え
  #\で
  #\け
  #\ど
  #\ぜ
  #\す
  #\じ
  #\ね
  #\私
  #\ま
  #\ー
  #\さ
  #\こ
  #\見
  #\言
  #\気
  #\ば
  #\一
  #\ょ
  #\つ
  #\他
  #\ろ
  #\遊
  #\園
  #\地
  #\好
  #\ふ
  #\日
  #\時
  #\間
  #\度
  #\み
  #\元
  #\由
  #\違
  #\思
  #\前
  #\忘
  #\ト
  #\顔
  #\持
  #\り
  #\理
  #\人
  #\子
  #\今
  #\ス
  #\濡)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (image "51.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 6 1)
 (image "v11.pd8")
 (proc 25)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "v11an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "v11.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 24)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "v11.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 745) 0)
   (<>
    (text #:color 7 "【" 0 "】ま、ま、ま、ま、ま。")
    (wait)
    (text #:color 3 "【舞】こんにちは、" 0 "君。")
    (wait)
    (text #:color 7 "【" 0 "】舞ちゃんっ！！")
    (wait)
    (text #:color 3 "【舞】どうしたの？・・・そんなに驚いた顔をして。")
    (wait)
    (text #:color 7 "【" 0 "】だってえ・・・舞ちゃん、ほとんどプールにいないからさ。")
    (wait)
    (text #:color 3 "【舞】私、色々とお稽古してるから・・・でもね、本当は泳ぐ事が一番好きなのよ。")
    (wait)
    (text #:color 7 "【" 0 "】お、俺も舞ちゃんの水着姿が一番好きっ！！")
    (wait)
    (text #:color 3 "【舞】" 0 "君って・・・ちょっとエッチなのよね。")
    (wait)
    (set-reg: 745 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "校庭に戻る") (text "プール入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】いやだ・・・絶対にいやだ。") (wait)))
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・校庭に戻るか。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・楽しみにしているわ。")
         (wait)
         (text #:color 7 "【" 0 "】うんうんっ！！")
         (wait)
         (set-reg: 309 1)
         (slot 1 3)
         (mes-jump "koutei.mes")))
       ((== N 2)
        (<>
         (text #:color 3 "【舞】" 0 "君・・・水着は？")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、持ってない。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】舞ちゃんがいるんだ・・・ここにいようぜ。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、誰に話しかけているのかしら？")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 3 "【舞】" 0 "君って、いつも元気ね。")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃんの顔を見ると、ますます元気になってくる。")
      (wait)
      (text #:color 3 "【舞】ふふふ・・・ありがとう。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 10) 1))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんを見てるとさ・・・どうして元気になるか知ってる？")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 3 "【舞】ううん、わからないわ。")
      (wait)
      (text #:color 7 "【" 0 "】その理由はね・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "かわいいから") (text "美人だから") (text "好きだから") (text "お金持ちだから")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】その理由は、かわいいからさ。")
         (wait)
         (text #:color 3 "【舞】じゃあ、私じゃなくてもいいのね・・・他のかわいい子でも、" 0 "君は元気になるのよね。")
         (wait)
         (text #:color 7 "【" 0 "】（ちょっと・・・失敗したかな？）")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】その理由は、舞ちゃが美人だからさ。")
         (wait)
         (text #:color 3 "【舞】じゃあ、私じゃなくてもいいのね・・・他の美人な女性を見ても、" 0 "君は元気になるのよね。")
         (wait)
         (text #:color 7 "【" 0 "】（ちょっと・・・失敗したかな？）")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】その理由は・・・好きだからさ。")
         (wait)
         (text #:color 3 "【舞】好きって・・・" 0 "君が？")
         (wait)
         (text #:color 7 "【" 0 "】他に誰がいるんだよ。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】うれしいけど・・・なんて返事をしていいのかわからないわ。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】その理由は・・・舞ちゃんがお金持ちだからさ。")
         (wait)
         (text #:color 3 "【舞】私とお金と・・・どういう関係があるのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】決まってるさ・・・舞ちゃんとつき合えば、おこずかいがもらえるだろ？")
         (wait)
         (text #:color 3 "【舞】" 0 "君、何か勘違いをしてない？")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       (else (<>)))
      (set-reg: 10 2)))
    ((&& (== V 2) (== N 1) (== (: 10) 2))
     (<>
      (text #:color 7 "【" 0 "】今日はずっと練習なの？")
      (wait)
      (text #:color 3 "【舞】ううん、そろそろ帰らないと・・・これからお稽古があるの。")
      (wait)
      (text #:color 7 "【" 0 "】大変だなあ。")
      (wait)
      (text #:color 3 "【舞】誤解しないでね、お稽古事も好きなのよ・・・でも、もう少し自由な時間が欲しいなって思うだけ。")
      (wait)
      (text #:color 7 "【" 0 "】うんうん、わかるぜその気持ち。")
      (wait)
      (set-reg: 10 3)))
    ((&& (== V 2) (== N 1) (== (: 10) 3))
     (<>
      (text #:color 3 "【舞】ねえ・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】なに？")
      (wait)
      (text #:color 3 "【舞】前にも話したと思うけど・・・私って、他の女の子と違うのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】どうしてそんな事を聞くんだい？")
      (wait)
      (text #:color 3 "【舞】うん・・・なんかそう感じるから。")
      (wait)
      (text #:color 7 "【" 0 "】感じるって・・・何を。")
      (wait)
      (text
       #:color
       3
       "【舞】説明しにくいけど、男の子達って私に話しかけてこないし・・・クラスの女の子でも、私の事を『さん』づけで呼ぶ人がいるのよ。")
      (wait)
      (text #:color 7 "【" 0 "】俺もくるみちゃんから、『" 0 "さん』って呼ばれているぜ。")
      (wait)
      (text #:color 3 "【舞】くるみちゃんは、" 0 "君の事を尊敬してるのよ・・・きっと。")
      (wait)
      (text #:color 7 "【" 0 "】尊敬ねえ・・・。")
      (wait)
      (text #:color 3 "【舞】なんだか・・・寂しい。")
      (wait)
      (text #:color 7 "【" 0 "】気にする事はないと思うけど・・・舞ちゃんは考えすぎなんじゃない？")
      (wait)
      (text #:color 3 "【舞】でも・・・私の事を普通に扱ってくれるのは、" 0 "君と健二君だけなのよ。")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃん、健二の事は忘れよう。")
      (wait)
      (set-reg: 10 4)))
    ((&& (== V 2) (== N 1) (== (: 10) 4))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんにあこがれてるんだよ・・・男も女も。")
      (wait)
      (text #:color 3 "【舞】私は普通でいたいのに・・・。")
      (wait)
      (text #:color 7 "【" 0 "】そんな悲しい顔をするなよ・・・舞ちゃんらしくないぜ。")
      (wait)
      (text #:color 3 "【舞】でも・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん・・・どうにかして元気づけてあげたいな。）")
      (wait)
      (set-reg: 10 5)))
    ((&& (== V 2) (== N 1) (== (: 10) 5) (== (: 11) 0))
     (<>
      (cond
       ((== (: 16) 0)
        (<>
         (text #:color 7 "【" 0 "】そうだ・・・。")
         (wait)
         (text #:color 3 "【舞】なに？")
         (wait)))
       ((== (: 16) 1)
        (<>
         (text #:color 7 "【" 0 "】今度こそ、そうだ・・・。")
         (wait)
         (text #:color 3 "【舞】今度こそ・・・なに？")
         (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 11) 0) (text "デートしよう"))
        (if (== (: 12) 0) (text "結婚しよう"))
        (if (== (: 13) 0) (text "一緒に泳ごう"))
        (if (== (: 14) 0) (text "セックスしよう"))
        (if (== (: 15) 0) (text "見せ合おう"))))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺とデートしようぜ・・・そうすれば、悩み事なんかなくなっちゃうかもよ。")
         (wait)
         (text #:color 3 "【舞】確かに、" 0 "君と話してると・・・いやな事が忘れられそうだわ。")
         (wait)
         (text #:color 7 "【" 0 "】でしょう？")
         (wait)
         (text #:color 3 "【舞】前から約束してたし・・・。")
         (wait)
         (text #:color 7 "【" 0 "】そうそう。")
         (wait)
         (text #:color 3 "【舞】夜じゃなかったら・・・いいわよ。")
         (wait)
         (text #:color 7 "【" 0 "】や、や、やったあっ！！")
         (wait)
         (set-reg: 11 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】俺と結婚しようぜ・・・そうすれば、いやな事なんか忘れられちゃうぜ。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】なんか変・・・だな。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、きっと言い間違えたのよ。")
         (wait)
         (text #:color 7 "【" 0 "】そうそう、俺は言い間違えたんだ・・・もう一度やりなおそう。")
         (wait)
         (set-reg: 12 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】俺と一緒に泳ごうぜ・・・そうすれば、いやな事なんか忘れられちゃうぜ。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・水着は？")
         (wait)
         (text #:color 7 "【" 0 "】ははは、持ってない。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、本当は他の事を言おうとしたんじゃない？")
         (wait)
         (text #:color 7 "【" 0 "】そうそう、俺は他の事を言うつもりだったんだ・・・。")
         (wait)
         (set-reg: 13 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】俺とセックスしようぜ・・・そうすれば、いやな事なんか忘れられちゃうぜ。")
         (wait)
         (text #:color 3 "【舞】・・・いやらしいわ。")
         (wait)
         (text #:color 7 "【" 0 "】俺も・・・そう思う。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、きっと言い間違えたのよ。")
         (wait)
         (text #:color 7 "【" 0 "】そうそう、俺は言い間違えたんだ・・・もう一度やりなおそう。")
         (wait)
         (set-reg: 14 1)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】俺と見せ合おうぜ・・・そうすれば、いやな事なんか忘れられちゃうぜ。")
         (wait)
         (text #:color 3 "【舞】何を・・・見せ合うの？")
         (wait)
         (text #:color 7 "【" 0 "】えーと・・・なんだろう？")
         (wait)
         (text #:color 3 "【舞】" 0 "君、本当は他の事を言おうとしたんじゃない？")
         (wait)
         (text #:color 7 "【" 0 "】そうそう、俺は他の事を言うつもりだったんだ・・・。")
         (wait)
         (set-reg: 14 1)
         (set-reg: 111 (- (: 111) 1))))
       (else (<>)))
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 7 "【" 0 "】昼間のデートだから・・・どこにしようかな。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、私ね・・・遊園地に行きたいわ。")
      (wait)
      (text #:color 7 "【" 0 "】遊園地？")
      (wait)
      (text #:color 3 "【舞】私ね・・・遊園地って嫌いなの。")
      (wait)
      (text #:color 7 "【" 0 "】はあ！？")
      (wait)
      (text #:color 3 "【舞】子供の頃から、遊園地が嫌いだった・・・昔はあんなものなければいいと思ってたわ。")
      (wait)
      (text #:color 7 "【" 0 "】（言ってる事が・・・よくわからない。）")
      (wait)
      (text #:color 3 "【舞】" 0 "君と一緒に行けば・・・遊園地が好きになれそう。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 2) (== N 1) (== (: 11) 2) (== (: 17) 0))
     (<>
      (cond
       ((== (: 18) 0) (<> (text #:color 3 "【舞】遊園地じゃ・・・いや？") (wait)))
       ((== (: 18) 1) (<> (text #:color 3 "【舞】もう一度聞くけど・・・遊園地じゃいや？") (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いや") (text "いい")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】うん・・・ちょっといやかな。")
         (wait)
         (text #:color 3 "【舞】そう・・・残念だわ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いいよ、遊園地で・・・俺も行きたいと思ってたんだ。")
         (wait)
         (text #:color 3 "【舞】" 0 "君も？")
         (wait)
         (text #:color 7 "【" 0 "】うんうん、俺も。")
         (wait)
         (set-reg: 17 1)))
       (else (<>)))
      (set-reg: 18 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 1) (== (: 50) 0))
     (<>
      (text #:color 7 "【" 0 "】でもさ、舞ちゃんって暇な時があるの？")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 3 "【舞】今度の日曜日だったら・・・。")
      (wait)
      (text #:color 7 "【" 0 "】今度の日曜日か８月２４日だな・・・俺は平気だぜ。")
      (wait)
      (text #:color 3 "【舞】時間は・・・早い方がいいわ。")
      (wait)
      (text #:color 7 "【" 0 "】午前５時とか？")
      (wait)
      (text #:color 3 "【舞】ふふふっ・・・もうちょっと遅い方がいい。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ、１０時頃でどう？")
      (wait)
      (text #:color 3 "【舞】午前１０時に・・・矢吹町駅かしら？")
      (wait)
      (text #:color 7 "【" 0 "】そうだな、午前１０時に矢吹町の駅前で待ってるよ。")
      (wait)
      (text #:color 3 "【舞】わかった・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（とうとう、舞ちゃんとデートができるぞうっ！！・・・健二のやつめ、ざまーみろっ！！）")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 3 "【舞】そろそろ私、着替えて帰らないと・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの横顔もいいなあ・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 3 "【舞】" 0 "君？")
      (wait)
      (text #:color 7 "【" 0 "】はっ！？・・・ついつい見とれてしまったあ！！")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 2) (== (: 19) 1))
     (<> (text #:color 7 "【" 0 "】（舞ちゃんは、正面から見るとかわいいし・・・横顔は美人に見えるぞ。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（髪は濡れているようだ・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（濡れている・・・濡れる・・・濡らす。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 3 "【舞】" 0 "君？")
      (wait)
      (text #:color 7 "【" 0 "】はっ！？・・・と、とんでもない事を考えてしまったあ！！")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 3) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】（髪は濡れている・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（" 0 "・・・変な事を考えるなよ。）")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん、手が邪魔なんだけどな・・・ちっ。）")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 4) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】（舞ちゃんの胸のふくらみが・・・ちょっとだけ見える。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんのウェストって、細いよな・・・さすが日本舞踊をやってるだけの事はある。）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（関係ないな・・・きっと。）")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 5) (== (: 22) 1))
     (<>
      (text #:color 7 "【" 0 "】（ウェストは細くて、胸は大きくて・・・お尻は？）")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（ちょっと大きい。）")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 23) 0))
     (<> (text #:color 7 "【" 0 "】（舞ちゃんの肌は・・・輝いている。）") (wait) (set-reg: 23 1)))
    ((&& (== V 1) (== N 6) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】（舞ちゃんの肌に、水滴が光ってるぞ・・・俺のヨダレじゃないだろうな？）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんだ・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（いいなあ・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（すごくいいなあ・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（欲しいなあ・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】はあ・・・。")
      (wait)
      (text #:color 3 "【舞】どうしたの、" 0 "君・・・ため息なんかついて。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 7) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】（正直に言おう・・・俺は舞ちゃんと『おせっくす』がしたいっ！！）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))