(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\る
  #\い
  #\な
  #\。
  #\く
  #\ん
  #\っ
  #\み
  #\の
  #\だ
  #\、
  #\て
  #\に
  #\う
  #\か
  #\？
  #\も
  #\あ
  #\ら
  #\き
  #\は
  #\さ
  #\た
  #\し
  #\一
  #\で
  #\れ
  #\が
  #\と
  #\ゃ
  #\ち
  #\ー
  #\そ
  #\哉
  #\を
  #\好
  #\め
  #\！
  #\よ
  #\君
  #\り
  #\こ
  #\（
  #\）
  #\ぜ
  #\え
  #\事
  #\乗
  #\わ
  #\ど
  #\私
  #\じ
  #\や
  #\思
  #\け
  #\ボ
  #\人
  #\つ
  #\ト
  #\す
  #\ね
  #\ま
  #\気
  #\俺
  #\お
  #\聞
  #\女
  #\ろ
  #\太
  #\ょ
  #\ふ
  #\嫌
  #\郎
  #\手
  #\子
  #\時
  #\持
  #\ば
  #\見
  #\何
  #\相
  #\タ
  #\知
  #\ご
  #\言
  #\池
  #\プ
  #\せ
  #\性
  #\場
  #\緒
  #\当
  #\小
  #\面
  #\話
  #\死
  #\合
  #\ラ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "31.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "s.pd8")
 (proc 16)
 (set-arr~ @ 6 1)
 (image "fan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "f.s4" (~ @ 2))
 (animate 0 0 1)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 2)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "q01.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 503) 0)
   (<>
    (text #:color 7 "【" 0 "】げっ！！")
    (wait)
    (text #:color 5 "【太郎】なんだ・・・" 0 "君じゃないか。")
    (wait)
    (text #:color 7 "【" 0 "】マタロウ・・・いやな時に会うなあ、一哉の気持ちがわかったよ。")
    (wait)
    (text #:color 6 "【くるみ】なあに？・・・一哉君の気持ちって？")
    (wait)
    (text #:color 5 "【太郎】ん？・・・誰だその女性は、" 0 "君の妹か？")
    (wait)
    (text #:color 7 "【" 0 "】俺に妹なんていないぜ。")
    (wait)
    (text #:color 5 "【太郎】じゃあ、お姉さんか？")
    (wait)
    (text #:color 7 "【" 0 "】俺に女の兄弟はいないってば。")
    (wait)
    (text #:color 5 "【太郎】じゃあ・・・お母さんか？")
    (wait)
    (text #:color 7 "【" 0 "】お前なあ・・・勉強のしすぎで、目がどうかしちゃったんじゃないか？")
    (wait)
    (text #:color 5 "【太郎】まさか" 0 "君、見ず知らずの女性を連れているわけではあるまいな・・・犯罪だぞ。")
    (wait)
    (text #:color 6 "【くるみ】" 0 "さん、私、この人知ってる・・・先負学園で一番勉強のできる・・・えーと。")
    (wait)
    (text #:color 6 "【くるみ】そう、キタロウさんでしょ？")
    (wait)
    (text #:color 5 "【太郎】違うっ！！僕はキタロウでもマタロウでもない、ただの太郎だっ！！")
    (wait)
    (text #:color 6 "【くるみ】あ・・・ごめんなさい。")
    (wait)
    (text #:color 5 "【太郎】不愉快だ・・・僕は帰るぞ、いーや、引き留めたって無駄だ。")
    (wait)
    (text #:color 7 "【" 0 "】誰も引き留めてないけど・・・。")
    (wait)
    (text #:color 5 "【太郎】ふんっ！！じゃあなっ！！")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "31.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 50)
    (proc 26)
    (set-reg: 835 1)
    (text #:color 6 "【くるみ】面白い人ね・・・。")
    (wait)
    (text #:color 7 "【" 0 "】面白いって言うか・・・そうそう、あいつも恋愛で悩んでるんだぜ。")
    (wait)
    (text #:color 6 "【くるみ】ふーん・・・そうなんだ。")
    (wait)
    (text #:color 7 "【" 0 "】とんだ邪魔が入ったな・・・えーと、池のそばで話したいって言ったよね。")
    (wait)
    (text #:color 6 "【くるみ】うん・・・。")
    (wait)
    (text #:color 7 "【" 0 "】よーし、ベンチにでも座って話をするか・・・。")
    (wait)
    (slot 1 8)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "q01.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "q01an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "q01.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 57)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】ふう・・・ここなら池のそばだし、ボート乗り場も見えるし。")
    (wait)
    (text #:color 6 "【くるみ】うん・・・ここでいい。")
    (wait)
    (text #:color 6 "【くるみ】・・・。")
    (wait)
    (text #:color 6 "【くるみ】なんだか・・・ずっと前の事みたい。")
    (wait)
    (text #:color 7 "【" 0 "】何が？")
    (wait)
    (text #:color 6 "【くるみ】うん、一哉君と手をつないでね・・・池の周りを一緒に歩いた時の事。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 6 "【くるみ】やだ、また暗くなってきちゃった・・・ごめんなさい、" 0 "さん。")
    (wait)
    (set-reg: 503 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 50) 0) (text "帰る"))
        (if (== (: 50) 1) (text "ボートに乗る"))
        (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 6 "【くるみ】" 0 "さん・・・何か用があるの？")
         (wait)
         (text #:color 7 "【" 0 "】いいや、別にないけど・・・。")
         (wait)
         (text #:color 6 "【くるみ】だったら、もう少し一緒にいてほしい・・・。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 6 "【くるみ】いやあ・・・まだ一緒にいて。")
         (wait)
         (text #:color 7 "【" 0 "】（くるみちゃんは、寂しいんだな・・・きっと。）")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】よーし、ボートに乗るか・・・。")
         (wait)
         (text #:color 6 "【くるみ】わーい！！")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "kuro.pd8")
         (proc 15)
         (set-arr~ @ 7 0)
         (text #:color 7 "【" 0 "】あれれ・・・ボート乗り場に誰もいないぜ。")
         (wait)
         (text #:color 6 "【くるみ】今日は休みなのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】いいや、勝手に乗っちゃえ。")
         (wait)
         (text #:color 6 "【くるみ】大丈夫？")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっ、怒られたらその時に戻ればいいさ・・・さあ、乗ろうぜ。")
         (wait)
         (text #:color 6 "【くるみ】ちょっと・・・恐い。")
         (wait)
         (text #:color 7 "【" 0 "】気をつけて・・・揺れるから。")
         (wait)
         (set-var A 1)
         (proc 13)
         (proc 11)
         (set-reg: 112 (+ (: 112) 1))
         (slot 1 8)
         (mes-jump "q02.mes")))
       ((&& (== N 3) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】よーし・・・まだここにいるぞ。")
         (wait)
         (text #:color 6 "【くるみ】ごめんなさい、" 0 "さん・・・私ってわがままなの？")
         (wait)))
       ((&& (== N 3) (== (: 50) 1))
        (<>
         (text #:color 6 "【くるみ】" 0 "さん、ボートに乗らないの？")
         (wait)
         (text #:color 7 "【" 0 "】くるみちゃんに乗る・・・。")
         (wait)
         (text #:color 6 "【くるみ】え？")
         (wait)
         (text #:color 7 "【" 0 "】なんでもない・・・ははは。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 6 "【くるみ】やっぱり気持ちいい・・・公園って。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 6 "【くるみ】ここでね、何回か一哉君とデートしたの・・・とっても楽しかった。")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃんって、本当に一哉の事が好きなんだなあ。")
      (wait)
      (text #:color 6 "【くるみ】好きよ、とっても・・・でもね、" 0 "さんも好き。")
      (wait)
      (text #:color 7 "【" 0 "】俺の事が好きなの？・・・そりゃあ光栄だぜ。")
      (wait)
      (text #:color 6 "【くるみ】一哉君の気持ちと少し違うけど、好きなの・・・だって" 0 "さんって面白いんですもの。")
      (wait)
      (text #:color 7 "【" 0 "】面白いか・・・ははは。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 6 "【くるみ】一哉君がね、いつも言ってたの・・・" 0 "さんと一緒にいると、すごく楽しいって。")
      (wait)
      (text #:color 6 "【くるみ】私ね、それを聞いた時にちょっと嫉妬しちゃた・・・ふふふ。")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃん、さっきりより少し元気になったみたいだな。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さんが一緒にいてくれるから・・・一人でいると、だんだん暗くなってきちゃうの。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・私、どうしたらいいの？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (text #:color 6 "【くるみ】いくら私が好きでも、一哉君がそうじゃなかったら・・・ただの片思いだもの。")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃんが一哉の事を好きなら・・・その気持ちを無理に変える事はないんじゃないか？")
      (wait)
      (text #:color 6 "【くるみ】うん・・・。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】相手にも好きになって欲しいのは当り前だけど・・・相手が自分の事を嫌いだったら、くるみちゃんも嫌いになる？")
      (wait)
      (text #:color 6 "【くるみ】ううん・・・なれない。")
      (wait)
      (text #:color 7 "【" 0 "】だろう？・・・だったら、自分の気持ちに正直になるのが一番さ。")
      (wait)
      (text #:color 6 "【くるみ】うん・・・理屈ではわかるんだけど。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 45) 0))
     (<>
      (text #:color 6 "【くるみ】ねえ、" 0 "さんが私の立場だった・・・どうする？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "あきらめる") (text "あきらめない") (text "死んでやる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺だったら・・・あきらめちゃうぜ。")
         (wait)
         (text #:color 6 "【くるみ】その人の事が好きでも？")
         (wait)
         (text #:color 7 "【" 0 "】ああ・・・他に好きな人を作るように努力するだろうな。")
         (wait)
         (text #:color 6 "【くるみ】私・・・器用じゃないから。")
         (wait)))
       ((== N 2)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】あきらめないさ・・・好きな人が自分を振り向いてくれるまで、何度でもプッシュ、プッシュさ！！")
         (wait)
         (text #:color 6 "【くるみ】うん・・・でも私って、そういう事ができない性格だから。")
         (wait)
         (text #:color 7 "【" 0 "】もしそうなら、待ってるしかないんだぜ・・・くるみちゃんはそれでいいのか？")
         (wait)
         (text #:color 6 "【くるみ】いや・・・。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】死んでやるっ！！")
         (wait)
         (text #:color 6 "【くるみ】え！？")
         (wait)
         (text #:color 7 "【" 0 "】死んで相手にイヤな思いをさせて・・・一生まとわりついてやる。")
         (wait)
         (text #:color 6 "【くるみ】そんなのいや・・・死んだらだめ。")
         (wait)
         (text #:color 7 "【" 0 "】その通りさ、死んだらおしまいだ・・・生きているから刺激的なんだもんな。")
         (wait)
         (text #:color 6 "【くるみ】うん・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 45 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 6 "【くるみ】私・・・一哉君に会って、はっきり気持ちを聞いてみようかな？")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん・・・一哉君から何も聞いてないんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】（聞いてるよ、一哉の好きな女性は夏子さんって言うんだぜ。）")
      (wait)
      (text #:color 6 "【くるみ】ねえ・・・" 0 "さん？")
      (wait)
      (text #:color 7 "【" 0 "】え！？・・・ああ、そうだな。")
      (wait)
      (text
       #:color
       6
       "【くるみ】"
       0
       "さんが知らないって事は、本当は何もないのかも知れないし・・・だったら、聞いちゃった方がいいもの。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さんも・・・そう思うでしょ？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "思う") (text "思わない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】賛成だな・・・はっきり聞いた方がいい。")
         (wait)
         (text #:color 6 "【くるみ】そうよね、頭の中で色々と考えてるだけじゃ・・・何も進まないもの。")
         (wait)
         (text #:color 7 "【" 0 "】そうそう。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】思わないな・・・だって一哉のやつ、電話に出ようとしないんだろ？")
         (wait)
         (text #:color 7 "【" 0 "】電話にも出ないやつに聞いても、本当の事を言うとは思えないしさ。")
         (wait)
         (text #:color 6 "【くるみ】でも、それだって私の思い過ごしかもしれないし・・・本当に留守だったかもしれないもん。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・。")
         (wait)
         (text #:color 6 "【くるみ】もういやなの、一哉君の事で色々と悩むのは・・・絶対にいや。")
         (wait)))
       (else (<>)))
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 6 "【くるみ】一哉君に好きな人ができてたら・・・私はどうすればいいのかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "好きな人を作る") (text "一哉を刺す") (text "あきらめる") (text "あきらめない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・新しく好きな人を作るってのはどう？")
         (wait)
         (text #:color 6 "【くるみ】好きな人って・・・一哉君以外に？")
         (wait)
         (text #:color 7 "【" 0 "】もちろんさ。")
         (wait)
         (text #:color 6 "【くるみ】一哉君以外で好きになる人って・・・" 0 "さんしかいない。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ俺を好きになってよ・・・俺はいいぜえ、一度つき合うと離れられなくなるぜ。")
         (wait)
         (text #:color 6 "【くるみ】でも" 0 "さんって、色々な女の子とつき合ってるもの。")
         (wait)
         (text #:color 7 "【" 0 "】（ちくしょー・・・どうしてみんな、俺の事を知ってるんだ！？）")
         (wait)
         (text #:color 6 "【くるみ】でも・・・一哉君にフラれたら、最初に" 0 "さんの所に相談に行くと思う。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ決まってるさ・・・ケジメをつける為に、一哉を刺す。")
         (wait)
         (text #:color 6 "【くるみ】やだ・・・そんな事、絶対にできないわ。")
         (wait)
         (text #:color 7 "【" 0 "】だから世の中の男がいい気になるんだぜ・・・ここはびしっと決めてもらわないと。")
         (wait)
         (text #:color 6 "【くるみ】じゃあ・・・" 0 "さんも手伝ってくれる？")
         (wait)
         (text #:color 7 "【" 0 "】ははは、俺は遠慮するよ・・・俺は良識ある青年だからな。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】そうなったら、あきらめるしかないだろう・・・相手の気持ちは、他の女性に向いてるんだから。")
         (wait)
         (text #:color 6 "【くるみ】あきらめて・・・その後はどうすればいいの？")
         (wait)
         (text #:color 7 "【" 0 "】じきに好きな人ができるさ。")
         (wait)
         (text #:color 6 "【くるみ】一哉君以外の好きな人・・・あ、いた！！")
         (wait)
         (text #:color 7 "【" 0 "】なんだ・・・もういるの？")
         (wait)
         (text #:color 6 "【くるみ】" 0 "さん。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ俺を好きになってよ・・・俺はいいぜえ、一度つき合うと離れられなくなるぜ。")
         (wait)
         (text #:color 6 "【くるみ】でも" 0 "さんって、色々な女の子とつき合ってるもの。")
         (wait)
         (text #:color 7 "【" 0 "】（ちくしょー・・・どうしてみんな、俺の事を知ってるんだ！？）")
         (wait)
         (text #:color 6 "【くるみ】でも・・・一哉君にフラれたら、最初に" 0 "さんの所に相談に行くと思う。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】フラれたからって、あきらめちゃ駄目だぜ・・・何度も世話女房のように押しかけるんだ。")
         (wait)
         (text #:color 6 "【くるみ】でも・・・しつこい女の子って、もっと嫌われないかしら？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】相手にしつこいと思われる以上のしつこさを発揮すれば、相手は訳がわからなくなって降参するかもしれないぜ。")
         (wait)
         (text #:color 6 "【くるみ】それって・・・ちっともよくないと思う。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】まあ、一哉がくるみちゃんを嫌いとは思えないし・・・そんなに考える事はないんじゃないの？")
      (wait)
      (text #:color 6 "【くるみ】うん・・・。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん、もう一つだけ聞きたいの・・・男の子って、同時に二人の女の子を好きになれるのかな？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・人によるんじゃないの？")
      (wait)
      (text #:color 6 "【くるみ】一哉君はどっちかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】（たぶん・・・好きになれる方だろうな。）")
      (wait)
      (text #:color 6 "【くるみ】ねえ・・・どっちだと思う？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "なれるタイプ") (text "なれないタイプ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】うーん・・・同時に好きになれるタイプかな？")
         (wait)
         (text #:color 6 "【くるみ】でも、そうだったら・・・私だって可能性があるわよね？")
         (wait)
         (text #:color 7 "【" 0 "】え？")
         (wait)
         (text #:color 6 "【くるみ】だって、好きな人がいたとしても・・・私の事も好きなんですもの。")
         (wait)
         (text #:color 7 "【" 0 "】まあ・・・そうだけど。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】うーん・・・同時に好きになれないんじゃないかなあ。")
         (wait)
         (text #:color 6 "【くるみ】もしそうなら・・・一哉君に好きな人がいたとして、一人しか好きになれないって事は・・・。")
         (wait)
         (text #:color 6 "【くるみ】・・・。")
         (wait)
         (text #:color 6 "【くるみ】もう・・・絶望的って事だもん、やだなあ。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そうか。")
         (wait)))
       (else (<>)))
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん、ありがとう・・・なんだか元気になってきた。")
      (wait)
      (text #:color 7 "【" 0 "】すっきりした？")
      (wait)
      (text #:color 6 "【くるみ】うん・・・。")
      (wait)
      (text #:color 6 "【くるみ】・・・。")
      (wait)
      (text #:color 6 "【くるみ】もう一つだけお願いしていい？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いい") (text "だめ")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】いいぜ・・・なんだい？") (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】だめ・・・。")
         (wait)
         (text #:color 6 "【くるみ】だめ？")
         (wait)
         (text #:color 7 "【" 0 "】うん、だめ。")
         (wait)
         (text #:color 6 "【くるみ】だめ？")
         (wait)
         (text #:color 7 "【" 0 "】だめだったら。")
         (wait)
         (text #:color 6 "【くるみ】だめ？")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】いい。")
         (wait)))
       (else (<>)))
      (text #:color 6 "【くるみ】あのね・・・私、ボートに乗りたい。")
      (wait)
      (text #:color 7 "【" 0 "】ボート・・・ああ、ボートね。")
      (wait)
      (text #:color 6 "【くるみ】一哉君ってね、水が恐いんだって・・・だからここに来た時、ボートに乗れなかったの。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん・・・私と一緒にボートに乗って欲しい。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・どうするかなあ。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "乗る") (text "乗らない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】いいよ、ボートぐらいなら・・・そのかわりボートに乗った後は、くるみちゃに乗せてくれ。")
         (wait)
         (text #:color 6 "【くるみ】私に乗るって、お馬さんごっこでもするの？")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・もういい、今の言葉は聞かなかった事にしてくれ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】やだよ・・・ボートなんて疲れるだけだ。")
         (wait)
         (text #:color 6 "【くるみ】乗りたいの。")
         (wait)
         (text #:color 7 "【" 0 "】だーめ。")
         (wait)
         (text #:color 6 "【くるみ】だめ？")
         (wait)
         (text #:color 7 "【" 0 "】だめ。")
         (wait)
         (text #:color 6 "【くるみ】だめ？")
         (wait)
         (text #:color 7 "【" 0 "】ああ、だめだ。")
         (wait)
         (text #:color 6 "【くるみ】だめ？")
         (wait)
         (text #:color 7 "【" 0 "】あーっ！！わかったよ、乗るよ、乗ればいいんだろ！！")
         (wait)
         (text #:color 6 "【くるみ】うれしい・・・。")
         (wait)
         (text #:color 7 "【" 0 "】そのかわり・・・ボートに乗った後は、くるみちゃに乗せてくれ。")
         (wait)
         (text #:color 6 "【くるみ】私に乗るって、お馬さんごっこでもするの？")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・もういい、今の言葉は聞かなかった事にしてくれ。")
         (wait)))
       (else (<>)))
      (set-reg: 17 1)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 1))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん、ボート漕げる？")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ！！俺にできない事はできないっ！！")
      (wait)
      (text #:color 6 "【くるみ】？？？")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 18) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・この髪型がいけないのかなあ。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 6 "【くるみ】だから、この髪型のせいで一哉君に嫌われたのかな？")
      (wait)
      (text #:color 7 "【" 0 "】関係ないと思うけど。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 2) (== (: 18) 1))
     (<> (text #:color 7 "【" 0 "】（風でゆらゆら揺れてる・・・ように見える。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 19) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・こんなリボンをしてるから、一哉君に嫌われるのかなあ。")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃん、全然関係ないと思うぜ。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 3) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】（確かにリボンとかって子供っぽいけど・・・くるみちゃんはまだ子供だからいいと思うな。）")
      (wait)))
    ((&& (== V 1) (== N 15) (== (: 48) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・一哉君って私の顔が嫌いなのかなあ。")
      (wait)
      (text #:color 7 "【" 0 "】絶対に違うよ・・・くるみちゃんは、かわいい顔をしてるぜ。")
      (wait)
      (set-reg: 48 1)))
    ((&& (== V 1) (== N 15) (== (: 48) 1))
     (<> (text #:color 7 "【" 0 "】（くるみちゃんには、笑顔が似合う・・・。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 20) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・私って痩せてるから、一哉君に嫌われちゃったのかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】ぶくぶく太ってるよりいいと思うぜ・・・それに一哉は痩せてる女の子の方が好きだと思う。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 4) (== (: 20) 1))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・一哉のやつ、この肌を見て我慢できなくなったんじゃないか？）")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 21) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・私って胸が小さいの。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 6 "【くるみ】だから一哉君に嫌われちゃったのかなあ。")
      (wait)
      (text #:color 7 "【" 0 "】（小さかろうが、大きかろうが・・・問題はその部分に触らせなかった事にあるんだ。）")
      (wait)
      (text #:color 6 "【くるみ】ねえ・・・聞いてる？")
      (wait)
      (text #:color 7 "【" 0 "】そ、そんな事はないよ・・・一哉は確か、小さい胸が好きなんだ。")
      (wait)
      (text #:color 6 "【くるみ】ふーん・・・" 0 "さんって、私より一哉君の事を知ってるのね。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 5) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】（確かに小さそうだけど・・・おっぱいは大きさじゃないと思うぜ。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 22) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・私ってお尻も小さいの。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 6 "【くるみ】だから一哉君、嫌いになったのかなあ？")
      (wait)
      (text #:color 7 "【" 0 "】あのねえ、関係ないと思うよ・・・だいたい一哉は、くるみちゃんのお尻を見た事があるのかい？")
      (wait)
      (text #:color 6 "【くるみ】・・・ない。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 6) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】（小さいけど、形のいいお尻だな・・・ちょっと固そうだけど。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 23) 0))
     (<>
      (text #:color 6 "【くるみ】私って、セーラー服を着るから・・・一哉君、いやになっちゃったのかなあ。")
      (wait)
      (text #:color 7 "【" 0 "】逆じゃない？・・・一哉はセーラー服が好きだから。")
      (wait)
      (text #:color 6 "【くるみ】そうなんだ・・・ふーん。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 7) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】（くるみちゃんだぜ・・・顔もしぐさもかわいい。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】（公園だからな・・・緑が多くて当り前だ。）")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 8) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】（セミの声が聞こえる・・・夏って感じだぜ。）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】（ボート乗り場だな・・・人影は見えないぞ。）")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 9) (== (: 25) 1))
     (<> (text #:color 7 "【" 0 "】（ボート乗り場だ・・・閑散としてるな。）") (wait)))
    ((&& (== V 1) (== N 10) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】（池の周りには柵がめぐらされている・・・これがないと、いつ池に落ちても不思議じゃない。）")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 10) (== (: 26) 1))
     (<> (text #:color 7 "【" 0 "】（柵だけど・・・寄りかかると、向こう側に倒れそうだぜ。）") (wait)))
    ((&& (== V 1) (== N 11) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】（地面は土だぜ・・・ゴミがいっぱい落ちてるな。）")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 11) (== (: 27) 1))
     (<> (text #:color 7 "【" 0 "】（土の上には・・・アリがちょこちょこ歩いてる。）") (wait)))
    ((&& (== V 1) (== N 12) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】（矢吹町公園の池だ・・・ボートがプカプカ浮かんでる。）")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 12) (== (: 28) 1))
     (<> (text #:color 7 "【" 0 "】（池だぜ・・・あまり奇麗じゃない。）") (wait)))
    ((&& (== V 1) (== N 13) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】（遠くに見えるビルは・・・たぶん矢吹町に建ってるビルだろう。）")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 13) (== (: 29) 1))
     (<> (text #:color 7 "【" 0 "】（霞がかかってビルが見えてる・・・空が汚いからだぜ。）") (wait)))
    ((&& (== V 1) (== N 14) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】（いい天気だな・・・こんな場所にいると、眠くなってくるよ。）")
      (wait)
      (set-reg: 30 1)))
    ((&& (== V 1) (== N 14) (== (: 30) 1))
     (<> (text #:color 7 "【" 0 "】（ふあああ・・・ベンチで寝たら、レゲエのおっさんになってしまう。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))