(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\し
  #\。
  #\よ
  #\い
  #\こ
  #\か
  #\な
  #\っ
  #\、
  #\ん
  #\の
  #\た
  #\る
  #\て
  #\あ
  #\で
  #\う
  #\す
  #\に
  #\と
  #\ら
  #\は
  #\？
  #\が
  #\ま
  #\さ
  #\だ
  #\わ
  #\を
  #\事
  #\も
  #\ど
  #\み
  #\ゃ
  #\り
  #\君
  #\そ
  #\ね
  #\ち
  #\先
  #\生
  #\言
  #\じ
  #\せ
  #\れ
  #\く
  #\人
  #\え
  #\け
  #\変
  #\何
  #\ぜ
  #\行
  #\自
  #\め
  #\子
  #\つ
  #\親
  #\（
  #\）)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "47.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "c.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "can.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "c.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 60)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "c.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 321) 0)
   (<>
    (text #:color 6 "【よしこ】あら、" 0 "君・・・こんな場所で何をしているの？")
    (wait)
    (text #:color 7 "【" 0 "】何をしているのって・・・ここは俺が住んでるマンションのまん前だぜ。")
    (wait)
    (text #:color 6 "【よしこ】あ、そうだったわね・・・でもちょうどよかったわ。")
    (wait)
    (text #:color 7 "【" 0 "】ちょうどよかったって・・・まさか、家庭訪問！？")
    (wait)
    (if (> T 1900)
      (<>
       (text #:color 7 "【" 0 "】・・・。")
       (wait)
       (text #:color 7 "【" 0 "】まさかね、こんな時間から家庭訪問する訳がないか。")
       (wait)
       (text #:color 6 "【よしこ】そうね、危険すぎるわ。")
       (wait)
       (text #:color 7 "【" 0 "】どういう意味だよ・・・失礼しちゃうぜ。")
       (wait)))
    (text #:color 6 "【よしこ】" 0 "君は特別ですからね・・・一番最後に行こうと思ってます。")
    (wait)
    (set-reg: 321 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 6 "【よしこ】待ちなさい・・・ちょっと聞きたい事があるんです。") (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】じゃあ・・・俺はもう行くよ。")
         (wait)
         (text #:color 6 "【よしこ】参考になったわ、" 0 "君・・・どうもありがとう。")
         (wait)
         (set-var N 3)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (== (: 554) 0))
        (<>
         (text #:color 6 "【よしこ】" 0 "君、他人の家に入っちゃ駄目よ。")
         (wait)
         (text #:color 7 "【" 0 "】先生、ここに住んでる人って・・・何者だろ？")
         (wait)
         (text #:color 6 "【よしこ】私は国勢調査員じゃありませんから。")
         (wait)))
       ((&& (== N 2) (== (: 554) 1))
        (<>
         (text #:color 6 "【よしこ】" 0 "君、他人の家に入っちゃ駄目よ。")
         (wait)
         (text #:color 7 "【" 0 "】先生、ここに住んでる人って・・・すっごい奇麗な人なんだぜ。")
         (wait)
         (text #:color 6 "【よしこ】先生には関係のない事です。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】・・・ふう。")
         (wait)
         (text #:color 6 "【よしこ】若い男の子が、ため息をつくもんじゃありません。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0) (== (: 413) 0))
     (<>
      (text #:color 6 "【よしこ】そう言えば・・・" 0 "君は、『黒川さとみ』さんと親しかったわね。")
      (wait)
      (text #:color 7 "【" 0 "】親しいと言うか・・・まあ、中学の頃から知ってるけど。")
      (wait)
      (text #:color 6 "【よしこ】最近、変わった事はないかしら？")
      (wait)
      (text #:color 7 "【" 0 "】さとみが？・・・相変わらず駅前の喫茶店でバイトしてるぜ、何も変わった所はないけど。")
      (wait)
      (text
       #:color
       6
       "【よしこ】それは知ってます、あの喫茶店は黒川さんの親戚の方が経営しているみたいですから・・・それについて文句を言うつもりはありません。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0) (== (: 413) 0))
     (<>
      (text #:color 7 "【" 0 "】先生、さとみがどうかしたのか？")
      (wait)
      (text #:color 6 "【よしこ】別に何でもありません・・・若い女の子によくある事ですから。")
      (wait)
      (text #:color 7 "【" 0 "】若い女の子によくある事って言うと・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "妊娠") (text "暴れる") (text "自律神経失調症")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】わかった、さとみが妊娠したとか？")
         (wait)
         (text #:color 6 "【よしこ】馬鹿な事を言わないで・・・変な噂を広めるんじゃありませんよ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】暴れるとか？")
         (wait)
         (text #:color 6 "【よしこ】誰がですか？")
         (wait)
         (text #:color 7 "【" 0 "】だから・・・さとみが。")
         (wait)
         (text #:color 6 "【よしこ】彼女はそんな子じゃありません・・・素直ないい子ですよ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】じりつしんけいしっちょう・・・あたたた、舌をかんだ。")
         (wait)
         (text #:color 6 "【よしこ】自律神経失調症なんかじゃありませんよ。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】じゃあ・・・さとみが何かしたとか？")
      (wait)
      (text #:color 6 "【よしこ】変わった所かないのなら、それでいいんです・・・私の思い違いかも知れませんし。")
      (wait)
      (text #:color 7 "【" 0 "】気になるなあ・・・。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 6 "【よしこ】" 0 "君は・・・『黒川さとみ』さんと親しかったわね？")
      (wait)
      (text #:color 7 "【" 0 "】親しいと言うか・・・まあ、中学の頃から知ってるけど。")
      (wait)
      (text #:color 6 "【よしこ】最近、変わった事はないかしら？")
      (wait)
      (text #:color 7 "【" 0 "】（あるけど・・・へたな事は言えないな。）")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君、私の質問に答えなさい。")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ある") (text "ない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】ある。")
         (wait)
         (text #:color 6 "【よしこ】変わった事って、どんな事ですか？")
         (wait)
         (text #:color 7 "【" 0 "】最近、さとみの胸が大きくなって来たぞ・・・だいぶもまれてるようだな。")
         (wait)
         (text #:color 6 "【よしこ】はあ・・・聞く相手を間違えたみたいですね。")
         (wait)
         (set-reg: 110 (- (: 110) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ない。")
         (wait)
         (text #:color 6 "【よしこ】そうですか・・・ならいいんですけど。")
         (wait)))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 6 "【よしこ】呼び止めて悪かったですね・・・もう行っていいですよ。")
      (wait)
      (text #:color 7 "【" 0 "】行っていいと言われても・・・どこに行こうかな？")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 7 "【" 0 "】先生の髪型って・・・。")
      (wait)
      (text #:color 6 "【よしこ】" 0 "君、私の髪型の話はいいですから・・・自分の時間を大切にしなさい。")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】先生、コンタクトレンズにしてみたら？")
      (wait)
      (text #:color 6 "【よしこ】メガネの方が便利ですよ・・・長時間使えますから。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<> (text #:color 7 "【" 0 "】（メガネをはずしたら、絶対に美人だぜ。）") (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】（芹沢先生の成熟した裸を見た事がある人って・・・自分自身以外に誰かいるのかな？）")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<> (text #:color 7 "【" 0 "】（いつも手と腕で隠すようにしてるな・・・警戒心が強い証拠だぜ。）") (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】先生の手って・・・奇麗だよね。")
      (wait)
      (text #:color 6 "【よしこ】そんな事を言ってる暇があったら、自分の将来の事を考えなさい。")
      (wait)
      (text #:color 7 "【" 0 "】（ちっ・・・誉めてるんだから、素直に喜べよ。）")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】芹沢先生っ！！")
      (wait)
      (text #:color 6 "【よしこ】な、なあに！？")
      (wait)
      (text #:color 7 "【" 0 "】呼んだだけです。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))