(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\っ
  #\い
  #\。
  #\子
  #\亜
  #\て
  #\な
  #\ん
  #\、
  #\は
  #\！
  #\う
  #\か
  #\の
  #\る
  #\し
  #\だ
  #\に
  #\を
  #\た
  #\と
  #\ら
  #\れ
  #\で
  #\が
  #\？
  #\ゃ
  #\す
  #\よ
  #\も
  #\お
  #\り
  #\あ
  #\ー
  #\じ
  #\さ
  #\く
  #\わ
  #\そ
  #\け
  #\え
  #\（
  #\）
  #\や
  #\ン
  #\ど
  #\こ
  #\尻
  #\ま
  #\ち
  #\ぜ
  #\見
  #\私
  #\き
  #\ば
  #\君
  #\べ
  #\笑
  #\台
  #\ょ
  #\め
  #\ね
  #\取
  #\カ
  #\ぐ
  #\ス
  #\ラ
  #\ト
  #\自
  #\身
  #\上
  #\言
  #\手
  #\抜
  #\胸
  #\動
  #\ご
  #\ず
  #\せ
  #\入
  #\ろ
  #\持
  #\何
  #\思
  #\リ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "t07.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 6 1)
 (image "t07an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "t07.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "t07.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 317) 1)
   (<>
    (text #:color 2 "【亜子】" 0 "君っ！！危ないからどいてっ！！")
    (wait)
    (text #:color 7 "【" 0 "】（おおおおおっ！！期待してた通りだぜっ！！）")
    (wait)
    (text #:color 2 "【亜子】・・・。")
    (wait)
    (text #:color 2 "【亜子】・・・。")
    (wait)
    (text #:color 2 "【亜子】・・・あれ？")
    (wait)
    (text #:color 7 "【" 0 "】どうしたの？・・・早くすべりなよ。")
    (wait)
    (text #:color 2 "【亜子】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】？？？")
    (wait)
    (text #:color 2 "【亜子】やだ、お尻がはさまって動けなくなっちゃった・・・もう。")
    (wait)
    (text #:color 7 "【" 0 "】はははははっ！！")
    (wait)
    (text #:color 2 "【亜子】笑わないでよ・・・自分自身でもおかしいんだから。")
    (wait)
    (set-reg: 317 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "笑う")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】はっはっはっはっはっ！！")
         (wait)
         (text #:color 2 "【亜子】だから笑わないで・・・私まで笑いそうになるわ。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】はーっはっはっはっはっ！！")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっはっはっ！！")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっはっはっ！！")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっはっはっ！！")
         (wait)
         (text #:color 2 "【亜子】ちょっと笑いすぎじゃない？")
         (wait)
         (text #:color 7 "【" 0 "】ごめん。")
         (wait)
         (set-reg: 10 2)))
       ((&& (== N 1) (== (: 10) 2))
        (<>
         (text #:color 7 "【" 0 "】わっはっはっはっはっ！！あーおかしい。")
         (wait)
         (text #:color 2 "【亜子】もう・・・。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【亜子】私のお尻って、そんなに大きいのかしら・・・ショックだわ。")
      (wait)
      (text #:color 7 "【" 0 "】どれどれ？")
      (wait)
      (text #:color 2 "【亜子】見なくていいの。")
      (wait)
      (text #:color 7 "【" 0 "】亜子さんのお尻って・・・１メートルぐらいあるのかな？")
      (wait)
      (text #:color 2 "【亜子】失礼ね、８９センチよ。")
      (wait)
      (text #:color 7 "【" 0 "】同じようなもんだよ。")
      (wait)
      (text #:color 2 "【亜子】１０センチ以上も違うじゃないっ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【亜子】あーん・・・取れない。")
      (wait)
      (text #:color 7 "【" 0 "】このすべり台は子供用だからな・・・熟れきった身体の亜子さんには、ちょっと無理があったようだ。")
      (wait)
      (text #:color 2 "【亜子】いやらしい言い方をしないで・・・それより、すべり台の上にずっといる訳にはいかないわ。")
      (wait)
      (text #:color 7 "【" 0 "】お尻をぐりぐり動かせば？")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【亜子】だめ・・・ますます深く入っちゃった。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 1) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】さてと・・・帰ろうかな。")
      (wait)
      (text #:color 2 "【亜子】ちょっとお、私を置いていかないでよ。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 18) 1) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】まったく・・・持ち上げるぜ、んんんんっ！！")
      (wait)
      (text #:color 2 "【亜子】いたたたた。")
      (wait)
      (text #:color 7 "【" 0 "】すごいな・・・本当にずっぽりはまってるぜ。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、もっと優しくして。")
      (wait)
      (text #:color 7 "【" 0 "】第三者が聞いたら、何をしてるかと思われるぜ。")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 2) (== N 1) (== (: 28) 1) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】さてと・・・帰ろうかな。")
      (wait)
      (text #:color 2 "【亜子】ちょっとお、私を置いていかないでよ。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 29) 1) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】亜子さんの腰をかかえて・・・。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、お尻に手を回さないでね。")
      (wait)
      (text #:color 7 "【" 0 "】うるさいなあ・・・せーの、んんんんっ！！")
      (wait)
      (text #:color 2 "【亜子】だ、だめ・・・抜けないわ。")
      (wait)
      (set-reg: 30 1)))
    ((&& (== V 2) (== N 1) (== (: 30) 1) (== (: 31) 0))
     (<>
      (text #:color 7 "【" 0 "】さてと・・・帰ろうかな。")
      (wait)
      (text #:color 2 "【亜子】ちょっとお、私を置いていかないでよ。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 31) 1))
     (<>
      (text #:color 7 "【" 0 "】亜子さんのふとももの下に手を入れて・・・。")
      (wait)
      (text #:color 2 "【亜子】く、くすぐったい・・・。")
      (wait)
      (text #:color 7 "【" 0 "】そのまま・・・お尻の下に手を入れて・・・と。")
      (wait)
      (text #:color 2 "【亜子】あ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】腰を抱き抱えるように・・・んんんっ！！")
      (wait)
      (text #:color 2 "【亜子】ん・・・。")
      (wait)
      (text #:color 7 "【" 0 "】んんんんんっ！！")
      (wait)
      (text #:color 6 "スッポン！！")
      (wait)
      (text #:color 2 "【亜子】ぬ、抜けたわ・・・ありがとう、" 0 "君。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "t03.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 6 1)
      (image "t03an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "t03.s4" (~ @ 2))
      (set-arr~ @ 7 0)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 7 "【" 0 "】・・・ちゅっ。")
      (wait)
      (text #:color 2 "【亜子】あっ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ご褒美。")
      (wait)
      (text #:color 2 "【亜子】唇に・・・キスした。")
      (wait)
      (text #:color 7 "【" 0 "】だから、ご褒美だってば。")
      (wait)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 7 "【" 0 "】な、なにボーゼンとしてるんだよ・・・。")
      (wait)
      (sound 1)
      (set-var I 37)
      (proc 26)
      (text #:color 6 "ドンッ！！")
      (wait)
      (text #:color 7 "【" 0 "】いててててっ！！")
      (wait)
      (set-reg: 106 (+ (: 106) 2))
      (set-var A 30)
      (proc 12)
      (proc 11)
      (field 14 1 1)
      (field 13 0 0)
      (field 13 1 1)
      (set-reg: 1001 0)
      (mouse 4 49152)
      (mouse 0)
      (set-reg: 835 0)
      (set-var N 5)
      (set-reg: 329 1)
      (slot 1 2)
      (mes-jump "town1.mes")))
    ((&& (== V 1) (== N 2) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】亜子さんの髪って・・・奇麗だなあ。")
      (wait)
      (text #:color 2 "【亜子】誉めるのは、私のお尻が取れたあとにして・・・ねえ、どうやったら取れるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】お尻に油を塗るっていうのはどう？")
      (wait)
      (text #:color 2 "【亜子】もう・・・真剣に答えてよ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 2) (== (: 15) 1))
     (<>
      (text #:color 7 "【" 0 "】（亜子さんが動くたびに、髪の毛が揺れている・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（ついでに胸も揺れてるな・・・。）")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】亜子さん・・・困ってる割には、顔が笑ってるぜ。")
      (wait)
      (text #:color 2 "【亜子】だって、自分で自分の姿を想像すると・・・おかしいんですもの。")
      (wait)
      (text #:color 7 "【" 0 "】けっこう楽しんでるんじゃないか？")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 3) (== (: 16) 1))
     (<>
      (text #:color 7 "【" 0 "】（亜子さんの笑顔って子供みたいだなあ・・・それだけ純情って事か？）")
      (wait)
      (text #:color 2 "【亜子】ねえ・・・見てないで、何とかして。")
      (wait)
      (text #:color 7 "【" 0 "】何とかしてって言われても・・・。")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（一生懸命、お尻を抜こうとしてる亜子さんの首筋は・・・妙に艶めかしいぜ。）")
      (wait)
      (text #:color 2 "【亜子】うーんっ・・・と、取れないわ。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 4) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】（白い首筋が、身体を動かすたびに・・・うねうねと動く。）")
      (wait)
      (text #:color 7 "【" 0 "】（なんて言うと、とってもいやらしい聞こえるだろ？）")
      (wait)))
    ((&& (== V 9) (== N 5) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】仕方がない・・・手伝ってやるか。")
      (wait)
      (text #:color 2 "【亜子】き、きゃあっ！！・・・どこを触ってるのよっ！！")
      (wait)
      (text #:color 7 "【" 0 "】だって、ここを持たないと力が入らないじゃないか。")
      (wait)
      (text #:color 2 "【亜子】でも・・・胸に触ったわよ。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ・・・どうすればいいんだ？")
      (wait)
      (text #:color 2 "【亜子】胸に触らないように手伝って。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 9) (== N 5) (== (: 19) 0))
     (<>
      (text #:color 2 "【亜子】あ・・・だ、だから胸は駄目だってば。")
      (wait)
      (text #:color 7 "【" 0 "】ここを持って、こうやって持ち上げれば・・・。")
      (wait)
      (text #:color 2 "【亜子】い、痛い・・・胸がつぶれちゃう！！")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 9) (== N 5) (== (: 19) 1))
     (<>
      (text #:color 2 "【亜子】" 0 "君・・・胸に触らないで、お願い。")
      (wait)
      (text #:color 7 "【" 0 "】亜子さん、まだ顔が笑ってるぜ。")
      (wait)
      (text #:color 2 "【亜子】だって・・・自分自身がバカみたいで、きっかけがあれば笑い出しちゃいそうよ。")
      (wait)))
    ((&& (== V 6) (== N 6) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】ベルトを・・・はずして、と。")
      (wait)
      (text #:color 2 "【亜子】な、何をするつもり！？")
      (wait)
      (text #:color 7 "【" 0 "】服を脱げば、お尻が取れるかもしれないぜ。")
      (wait)
      (text #:color 2 "【亜子】やめてよ・・・公衆の面前で、裸になるなんていや。")
      (wait)
      (text #:color 7 "【" 0 "】誰も見てないってば。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 6) (== N 6) (== (: 20) 1))
     (<>
      (text #:color 2 "【亜子】ベルトに手をかけたら・・・蹴るわよ。")
      (wait)
      (text #:color 7 "【" 0 "】きっと色っぽいぜ、頼むからやってくれ。")
      (wait)
      (text #:color 2 "【亜子】もう・・・いや。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・いい眺め。）")
      (wait)
      (text #:color 2 "【亜子】" 0 "君・・・どこを見てるの？")
      (wait)
      (text #:color 7 "【" 0 "】（白いパンティだな・・・汗をびっしょりとかいて、透けてくれればもっとうれしいんだけど。）")
      (wait)
      (text #:color 2 "【亜子】" 0 "君ったら・・・もしかして、下着が見えてる？")
      (wait)
      (text #:color 7 "【" 0 "】うん。")
      (wait)
      (text #:color 2 "【亜子】み、見ないでよ・・・絶対に見ないでっ！！")
      (wait)
      (text #:color 7 "【" 0 "】そう言われると、ますます見たくなるなあ。")
      (wait)
      (text #:color 2 "【亜子】いやあ・・・恥ずかしい。")
      (wait)
      (set-reg: 21 1)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 7) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】亜子さん・・・白でしょ？")
      (wait)
      (text
       #:color
       2
       "【亜子】脚を真っ直ぐに伸ばすと下着は見えなくなるけど・・・そんな事をしたら、ますますすべり台から抜けられなくなりそう。")
      (wait)
      (text #:color 7 "【" 0 "】亜子さん、なんだか喜んでない？")
      (wait)
      (text #:color 2 "【亜子】だってえ・・・私って、本当にバカみたいなんですもの。")
      (wait)
      (set-reg: 21 2)))
    ((&& (== V 1) (== N 7) (== (: 21) 2))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・清潔なお色気だぜ。）")
      (wait)
      (text #:color 2 "【亜子】" 0 "君ったら・・・見ないでよ。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】（うーん、このスカートのラインがラブリィだぜ。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】亜子さん、カメラを持ってきていい？")
      (wait)
      (text #:color 2 "【亜子】だめっ！！")
      (wait)
      (text #:color 7 "【" 0 "】心配しなくていいよ、俺の家はすぐ近くだから。")
      (wait)
      (text #:color 2 "【亜子】そういう意味で言った訳じゃないわよ・・・こんな姿をカメラに撮られたら死んでやるから。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 8) (== (: 22) 1))
     (<>
      (text #:color 7 "【" 0 "】（うーん、俺は女性の美学を学んだような気がする・・・。）")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】（ピンと張ったスカートのライン、そのスカートから出てるふともも、そしてスカートの奥にチラチラ見えてるパンティ。）")
      (wait)
      (text #:color 7 "【" 0 "】（美しいぜ・・・うん。）")
      (wait)
      (set-reg: 22 2)))
    ((&& (== V 1) (== N 8) (== (: 22) 2))
     (<>
      (text #:color 7 "【" 0 "】カメラが駄目なら・・・８ミリビデオはどう？")
      (wait)
      (text #:color 2 "【亜子】" 0 "君を巻き添えにして、死んでやるっ！！")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】色っぽいなあ。")
      (wait)
      (text #:color 2 "【亜子】見てないで何とかしてよ・・・私一人じゃ、お尻が取れないわ。")
      (wait)
      (text #:color 7 "【" 0 "】脚を引っ張ってやろうか？")
      (wait)
      (text #:color 2 "【亜子】脚を伸ばしたら、今度は両足ごとすべり台から取れなくなりそう。")
      (wait)
      (text #:color 7 "【" 0 "】いい考えがある。")
      (wait)
      (text #:color 2 "【亜子】なに？")
      (wait)
      (text #:color 7 "【" 0 "】一生、すべり台の上で生活すればいいんだ。")
      (wait)
      (text #:color 2 "【亜子】もう・・・笑わせないでよ。")
      (wait)
      (text #:color 7 "【" 0 "】真剣にそう思ったのに。")
      (wait)
      (set-reg: 23 1)
      (set-reg: 31 1)))
    ((&& (== V 1) (== N 9) (== (: 23) 1))
     (<>
      (text #:color 7 "【" 0 "】（ああ・・・鼻血が出そうだ。）")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、出てるわよ。")
      (wait)
      (text #:color 7 "【" 0 "】ぎょっ！？・・・もしかして鼻血！？")
      (wait)
      (text #:color 2 "【亜子】ううん、ヨダレ。")
      (wait)
      (set-reg: 23 2)))
    ((&& (== V 1) (== N 9) (== (: 23) 2))
     (<>
      (text #:color 7 "【" 0 "】（ぐりぐりしたーいっ！！）")
      (wait)
      (text #:color 2 "【亜子】なんだか・・・どんどん奥にはまっていきそう。")
      (wait)
      (text #:color 7 "【" 0 "】そのうち、すべり台の一部になったりして・・・ははは。")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】亜子さん、全身に力を入れて・・・腰を思いきり上に・・・。")
      (wait)
      (text #:color 2 "【亜子】うーーーんっ！！")
      (wait)
      (text #:color 7 "【" 0 "】リンボーダンスをやってるつもりで・・・。")
      (wait)
      (text #:color 2 "【亜子】うーーーんっ！！")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】じゃんじゃんじゃん、じゃじゃんじゃじゃんじゃん、じゃんじゃんじゃじゃんじゃじゃんっ・・・うっ！！")
      (wait)
      (text #:color 2 "【亜子】ははははははははっ！！・・・笑わせないでよ、力が抜けちゃうじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ、せっかくリンボーダンスのリズムを口ずさんでやったのに。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 10) (== (: 24) 1))
     (<>
      (text #:color 7 "【" 0 "】全身の力を込めても取れないとなると・・・こりゃあ俺様の助けが必要だな。")
      (wait)
      (text #:color 2 "【亜子】だからあ、さっきからそう言ってるじゃない。")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】このすべり台がいけないんだ・・・えいっ！！")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、すべり台をたたいても・・・私のお尻は抜けないわ。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 11) (== (: 25) 1))
     (<>
      (text #:color 7 "【" 0 "】すべり台だぜ・・・知ってる？")
      (wait)
      (text #:color 2 "【亜子】ねえ・・・もしかして、私の事をからかってるのかしら？")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】緑が奇麗だなあ。")
      (wait)
      (text #:color 2 "【亜子】ねえ・・・景色を見るのは、私のお尻が取れてからにしてくれない？")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 12) (== (: 26) 1))
     (<>
      (text #:color 7 "【" 0 "】セミがミンミン鳴いている・・・夏だなあ。")
      (wait)
      (text #:color 2 "【亜子】ねえ・・・私の存在を覚えてる？")
      (wait)))
    ((&& (== V 1) (== N 13) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】いい天気だな・・・亜子さんもそう思うでしょ？")
      (wait)
      (text #:color 2 "【亜子】思いたいけど、今はそんな余裕がないの・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん。")
      (wait)
      (text #:color 2 "【亜子】ふーん、じゃなくて・・・お願い、助けてよ。")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 13) (== (: 27) 1))
     (<>
      (text #:color 7 "【" 0 "】空には雲があり・・・すべり台には、亜子さんのお尻がある。")
      (wait)
      (text #:color 2 "【亜子】お願い・・・助けて。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))