(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\。
  #\っ
  #\て
  #\な
  #\子
  #\、
  #\亜
  #\ん
  #\だ
  #\の
  #\う
  #\た
  #\に
  #\し
  #\よ
  #\る
  #\か
  #\？
  #\も
  #\が
  #\と
  #\で
  #\を
  #\ら
  #\は
  #\ゃ
  #\君
  #\登
  #\あ
  #\（
  #\）
  #\見
  #\ち
  #\じ
  #\え
  #\り
  #\お
  #\気
  #\わ
  #\や
  #\こ
  #\き
  #\さ
  #\ね
  #\け
  #\事
  #\く
  #\そ
  #\ー
  #\れ
  #\イ
  #\！
  #\言
  #\ょ
  #\ン
  #\ま
  #\感
  #\私
  #\カ
  #\俺
  #\大
  #\尻
  #\ど
  #\す
  #\ヒ
  #\ぜ
  #\一
  #\緒
  #\本
  #\持
  #\違
  #\雲)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "t08.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 6 1)
 (image "t08an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "t08.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "t08.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 317) 1)
   (<>
    (text #:color 2 "【亜子】やっほー！！" 0 "君っ！！")
    (wait)
    (text #:color 7 "【" 0 "】（うーん、なかなか色っぽいぞ・・・もっと脚を開け。）")
    (wait)
    (text #:color 2 "【亜子】" 0 "君も登っておいでよ・・・私だけ登ってると、バカみたいじゃない。")
    (wait)
    (text #:color 7 "【" 0 "】二人で登ってたら、もっとバカに見えるかもしれないぜ。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "一緒に登る")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】やだよ・・・無駄な事に体力を使いたくない。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<> (text #:color 7 "【" 0 "】（一緒に登るより、こうやって下から見てた方がいいぞ・・・。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【亜子】なんだか・・・とっても楽しい気分になってきちゃった。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、本気で童心に帰ってるな。）")
      (wait)
      (text #:color 2 "【亜子】いい天気だから、とっても気持ちがいいわ・・・なんだかお店に戻りたくなくなっちゃう。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【亜子】" 0 "君も、一緒に登ろうよ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは・・・俺はいいよ。")
      (wait)
      (text #:color 2 "【亜子】わかった、恐いんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】（違うよ、下から亜子さんを見上げてた方が色っぽいからだよ。）")
      (wait)
      (text #:color 2 "【亜子】ねえ・・・登らないの？")
      (wait)
      (text #:color 7 "【" 0 "】あ？・・・ああ、俺は閉所恐怖症なんだ。")
      (wait)
      (text #:color 2 "【亜子】関係ないじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】間違えた、高所恐怖症で・・・５０センチ以上登るなって、医者に止められてるんだ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 2 "【亜子】本当に、子供に戻った気分になってきちゃった。")
      (wait)
      (text #:color 7 "【" 0 "】（おー、おー、こんな大人のお尻をしてて・・・どこが子供なんだよう。）")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、あんまり楽しそうじゃないわね。")
      (wait)
      (text #:color 7 "【" 0 "】そ、そんな事はないさあ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 2 "【亜子】このてんとう虫、ひんやりしてて気持ちいい・・・。")
      (wait)
      (text #:color 7 "【" 0 "】亜子さん、もっと大胆に登ってくれ・・・足を大きく開いてさ。")
      (wait)
      (text #:color 2 "【亜子】いやよ、下着が見えちゃうもの。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 1) (== (: 19) 0))
     (<> (text #:color 2 "【亜子】本当に誰もいない公園ね・・・私達の貸切りだわ。") (wait)))
    ((&& (== V 2) (== N 1) (== (: 19) 1))
     (<>
      (text #:color 2 "【亜子】ねえねえ・・・私、すべり台って好きなの。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 2 "【亜子】この歳で、すべり台で遊んでたら・・・バカかしら？")
      (wait)
      (text #:color 7 "【" 0 "】童心に戻るんだろ？・・・だいたい誰も見てないよ。")
      (wait)
      (text #:color 2 "【亜子】そうよね・・・" 0 "君も一緒に行きましょ？")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、亜子さんがすべり台で遊ぶって事は・・・ひっひっひ、こりゃあ期待しちゃうぜ。）")
      (wait)
      (text #:color 2 "【亜子】早く行きましょうよ・・・ね？")
      (wait)
      (set-var A 30)
      (proc 12)
      (proc 11)
      (slot 1 5)
      (mes-jump "t07.mes")))
    ((&& (== V 1) (== N 2) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（髪の毛がそよ風にゆれている・・・こうして亜子さんを見てると、俺よりも歳下に感じてしまうな。）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 2) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（亜子さんの髪の毛だ・・・。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（なんか・・・本当に楽しそうな顔をしてるな。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 3) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（顔だけ見てると、小学生みたいだ・・・身体は大人だけど。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】ぐう。")
      (wait)
      (text #:color 2 "【亜子】え？")
      (wait)
      (text #:color 7 "【" 0 "】だから・・・ぐう。")
      (wait)
      (text #:color 2 "【亜子】え？")
      (wait)
      (text #:color 7 "【" 0 "】ジャンケンをしてるんだろ？")
      (wait)
      (text #:color 2 "【亜子】違うわよ・・・楽しいと指が自然にこうなっちゃうの。")
      (wait)
      (text #:color 7 "【" 0 "】ははあ・・・オカマがグラスを持つ時に、小指が立つのと一緒だな。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 4) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】亜子さん、今時ピースサインなんて・・・小学生でもやらないぜ。")
      (wait)
      (text #:color 2 "【亜子】ピースサイン？・・・違うわよ、ジャンケンをしてるの。")
      (wait)
      (text #:color 7 "【" 0 "】嘘つき。")
      (wait)))
    ((&& (== V 8) (== N 5) (== (: 18) 0))
     (<>
      (text #:color 2 "【亜子】きゃっ！？・・・" 0 "君、お尻に触らないで。")
      (wait)
      (text #:color 7 "【" 0 "】触った訳じゃなくて、お尻を押してあげようかと思ったんだよ。")
      (wait)
      (text #:color 2 "【亜子】嘘・・・押すって感じよりも、手が横にスライドしてたわよ。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、なんて敏感なお尻なんだ・・・。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 8) (== N 5) (== (: 19) 0))
     (<>
      (text #:color 2 "【亜子】" 0 "君・・・何をしてるの？")
      (wait)
      (text #:color 7 "【" 0 "】え？・・・何かした？")
      (wait)
      (text #:color 2 "【亜子】お尻に、" 0 "君の手を感じたけど。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ、気のせいだよ・・・きっと。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 8) (== N 5) (== (: 19) 1))
     (<>
      (text #:color 2 "【亜子】" 0 "君って・・・いやらしい。")
      (wait)
      (text #:color 2 "【亜子】公園に来て、いたいけな少女達に同じ事をしてるんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】おいおい、それじゃあ犯罪者だよ。")
      (wait)))
    ((&& (== V 1) (== N 6) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（へえ・・・思ったよりも、肉づきのいい太股だな。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君っ！！")
      (wait)
      (text #:color 7 "【" 0 "】え！？")
      (wait)
      (text #:color 2 "【亜子】もう・・・私の言う事を聞いてないんだから。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 6) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・脚と脚の間に、顔を埋めたい。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】亜子さんが・・・子供になってしまった。")
      (wait)
      (text #:color 2 "【亜子】やだ・・・童心に帰ったと言ってよ。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 7) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】（ちっ・・・もっと大胆に登ってくれないかなあ。）")
      (wait)
      (text #:color 7 "【" 0 "】（どうせ俺しか見てないんだ・・・もっと、脚をがばがば開いて登って欲しいぜ。）")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】穴の中から・・・見える。")
      (wait)
      (text #:color 2 "【亜子】やだ・・・またいやらしい事を言ったでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】どうしてだよ・・・穴の中から、樹木が見えるって言ったんだ。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 8) (== (: 22) 1))
     (<>
      (text #:color 7 "【" 0 "】セミが鳴いているな・・・あの木にとまってるのかな？")
      (wait)
      (text #:color 2 "【亜子】私ね、夏の終りのセミの声って嫌い・・・なんだか寂しくなっちゃうもの。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】近くで見ると、けっこうでかいな。")
      (wait)
      (text #:color 2 "【亜子】やだ・・・お尻の事でしょ？")
      (wait)
      (text #:color 7 "【" 0 "】違うって・・・このてんとう虫の事だよ。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 9) (== (: 23) 1))
     (<>
      (text #:color 7 "【" 0 "】子度が登れるのか？・・・亜子さんだって、ヒイヒイ言って登ってるぜ。")
      (wait)
      (text #:color 2 "【亜子】私、ヒイヒイなんて言ってないわ。")
      (wait)
      (text #:color 7 "【" 0 "】ヒイヒイは、ベットの中だけだよね？")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、いい天気よね。")
      (wait)
      (text #:color 7 "【" 0 "】無視されちゃった。")
      (wait)
      (set-reg: 23 2)))
    ((&& (== V 1) (== N 9) (== (: 23) 2))
     (<>
      (text #:color 2 "【亜子】" 0 "君、本当は登れないんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】俺は大人だから登らないんだ。")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】雲がプカプカ浮かんでる・・・。")
      (wait)
      (text #:color 2 "【亜子】あの雲を見ると、夏って感じがするわね。")
      (wait)
      (text #:color 7 "【" 0 "】そう？・・・俺が夏って感じるのは、女性の服装が薄着になった時だな。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君らしいわ・・・。")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 10) (== (: 24) 1))
     (<>
      (text #:color 7 "【" 0 "】雲は自由でいいな・・・雲のように生きたいものだ。")
      (wait)
      (text #:color 2 "【亜子】でも風が吹けば、雲なんてどこかに飛んでいっちゃうわよ・・・。")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 25) 0))
     (<>
      (text #:color 2 "【亜子】気持ちいい・・・。")
      (wait)
      (text #:color 7 "【" 0 "】そんなに感じる？")
      (wait)
      (text #:color 2 "【亜子】もう・・・空を見てると気分がいいって言ったの。")
      (wait)
      (text #:color 7 "【" 0 "】気持ちいいって言ったじゃないかよ。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 11) (== (: 25) 1))
     (<>
      (text #:color 7 "【" 0 "】子供の頃見ていた空は、もっと青かったような気がする。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君でも、そんな事を思う時があるんだ・・・頭の中は女の子の事だけだと思っていたわ。")
      (wait)
      (text #:color 7 "【" 0 "】失礼な・・・。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))