(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\。
  #\っ
  #\、
  #\て
  #\子
  #\の
  #\亜
  #\か
  #\だ
  #\と
  #\う
  #\ん
  #\る
  #\に
  #\た
  #\？
  #\ら
  #\は
  #\し
  #\さ
  #\が
  #\よ
  #\ー
  #\で
  #\も
  #\あ
  #\く
  #\わ
  #\を
  #\り
  #\ど
  #\ゃ
  #\そ
  #\こ
  #\れ
  #\じ
  #\ま
  #\み
  #\す
  #\け
  #\！
  #\ち
  #\ン
  #\事
  #\言
  #\き
  #\え
  #\ね
  #\人
  #\見
  #\ぜ
  #\お
  #\行
  #\ょ
  #\ス
  #\君
  #\や
  #\私
  #\分
  #\俺
  #\つ
  #\生
  #\真
  #\コ
  #\思
  #\店
  #\ろ
  #\ト
  #\方
  #\先
  #\ブ
  #\感
  #\園
  #\気
  #\ッ
  #\め
  #\茶
  #\ご
  #\０
  #\何
  #\シ
  #\中
  #\ラ
  #\公
  #\自
  #\（
  #\）
  #\ヒ
  #\喫
  #\ル
  #\ひ
  #\ば
  #\部
  #\一
  #\せ
  #\プ
  #\ク
  #\女
  #\本
  #\当
  #\美
  #\ふ
  #\飲
  #\マ
  #\カ
  #\姉
  #\肌
  #\セ
  #\誰
  #\ケ
  #\目
  #\金
  #\ぞ
  #\歳
  #\性
  #\チ
  #\胸
  #\所
  #\近
  #\『
  #\』
  #\変
  #\ホ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "30.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "t11.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 314) 0)
   (<>
    (text #:color 7 "【" 0 "】ふう・・・どこに座ろうかな。")
    (wait)
    (text #:color 6 "【さとみ】決まってるくせに。")
    (wait)
    (text #:color 7 "【" 0 "】うるさいなあ・・・まずは『いらっしゃいませ』だろ？")
    (wait)
    (text #:color 2 "【亜子】" 0 "君・・・私、コーヒーが飲みたいな。")
    (wait)
    (text #:color 6 "【さとみ】いらっしゃいませ亜子さん・・・コーヒーと泥水ですね、少々お待ちください。")
    (wait)
    (text #:color 2 "【亜子】" 0 "君・・・変な飲物を頼むのね。")
    (wait)
    (text #:color 7 "【" 0 "】うっうっうっ・・・俺はまだ何も言ってない。")
    (wait)
    (text #:color 6 "【さとみ】" 0 "っ！！とっとと座りないさいよ、コーヒー持って行くからっ！！")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "t11.pd8")
    (proc 16)
    (set-arr~ @ 6 1)
    (image "t11an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "t11.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 3)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 6 "【さとみ】お待たせしました、ホットコーヒーと・・・泥水は今、汲みに行ってますから。")
    (wait)
    (text #:color 6 "【さとみ】ほら、" 0 "・・・スプーンを貸してあげるから、これでもなめてなさい。")
    (wait)
    (text #:color 2 "【亜子】" 0 "君、ここの喫茶店で何かしたの？")
    (wait)
    (text #:color 7 "【" 0 "】何もしてない。")
    (wait)
    (text #:color 6 "【さとみ】嘘をつきなさいよ・・・シュガーの中にセイロガンを入れたのは誰？")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・。")
    (wait)
    (text #:color 6 "【さとみ】出口とただの窓を間違えて、ガラスをつき破ったのは誰？")
    (wait)
    (text #:color 7 "【" 0 "】あの時は痛かった。")
    (wait)
    (text #:color 6 "【さとみ】楽しくお茶を飲んでいたアベックに割り込んで、女の子をナンパしだしたのは誰？")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・は。")
    (wait)
    (text #:color 6 "【さとみ】ギターを持って、歌いながら店に入ってくるマヌケは誰？")
    (wait)
    (text #:color 7 "【" 0 "】でも・・・あれはウケたぜ。")
    (wait)
    (text #:color 6 "【さとみ】じゃあ言うけど・・・ヘルメットがぶったまま入ってきて、強盗のマネをしたのは誰？")
    (wait)
    (text #:color 7 "【" 0 "】ウケたよ、あれも。")
    (wait)
    (text
     #:color
     6
     "【さとみ】何を言ってるのよっ！！・・・みんなパニックになっちゃって、コーヒーはこぼすわ、テーブルはひっくり返るわ、大変だったじゃないっ！！")
    (wait)
    (text #:color 2 "【亜子】" 0 "君って・・・す、すごい人なのね。")
    (wait)
    (text
     #:color
     6
     "【さとみ】亜子さん、こんなバカを相手にすると不幸な目に会いますよ・・・１秒でも早くお別れした方がいいと思います、ふんっ！！")
    (wait)
    (text #:color 2 "【亜子】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 2 "【亜子】彼女、怒ってるみたいだけど・・・。")
    (wait)
    (text #:color 7 "【" 0 "】いいの、いいの・・・昔からあんな感じなんだ。")
    (wait)
    (set-reg: 314 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((&& (== V 0) (== (: 49) 1))
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "深呼吸をする")))
      (if-else (== N 1)
        (<> (text #:color 7 "【" 0 "】すうすう・・・はあはあ・・・すうすう・・・はあはあ。") (wait))
        (<>))))
    ((&& (== V 0) (== (: 49) 0))
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 50) 0) (text "外に出る"))
        (if (== (: 50) 1) (text "公園に行く"))
        (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 2 "【亜子】え！？・・・もう帰るの？")
         (wait)
         (text #:color 7 "【" 0 "】そうか・・・まだ来たばかりだった。")
         (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 7 "【" 0 "】よーし・・・マンションの裏の公園に行くか。")
         (wait)
         (text #:color 2 "【亜子】童心に戻るっていうのも、いいかもしれないわよ。")
         (wait)
         (text #:color 6 "【さとみ】" 0 "、ちゃんとお金を払って行ってね・・・ホットコーヒーと泥水で３００円になります。")
         (wait)
         (text #:color 7 "【" 0 "】俺は泥水なんか飲んでないぞ・・・たとえ出されても飲まないけど。")
         (wait)
         (text #:color 6 "【さとみ】だから３００円なのよ・・・なんだったら、１０００円ぐらいにしましょうか？")
         (wait)
         (text #:color 7 "【" 0 "】わかったよ、ほら３００円だろ？")
         (wait)
         (cond
          ((> M 299)
           (<>
            (set-var M (- M 300))
            (set-var A 1)
            (proc 13)
            (proc 11)
            (text #:color 6 "【さとみ】ありがとうございましたー！！")
            (wait)))
          ((< M 300)
           (<>
            (text #:color 6 "【さとみ】ちょっと・・・足りないじゃない。")
            (wait)
            (text #:color 7 "【" 0 "】ありゃりゃ。")
            (wait)
            (text #:color 6 "【さとみ】仕方がないわねえ・・・ツケとくから、あり金全部置いておきなさい。")
            (wait)
            (text #:color 2 "【亜子】" 0 "君、足りない分は私が払っておくから・・・お金がないなら、そう言えばいいのに。")
            (wait)
            (text #:color 7 "【" 0 "】ふんふんっ！！俺は女と年寄りには、金は出させない主義なんだよっ！！")
            (wait)
            (set-var M 0)
            (set-var A 1)
            (proc 13)
            (proc 11)))
          (else (<>)))
         (field 14 1 1)
         (field 13 0 0)
         (field 13 1 1)
         (set-reg: 1001 0)
         (set-reg: 316 1)
         (set-var N 9)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 3) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】そうだな・・・まだ来たばかりじゃないか。") (wait)))
       ((&& (== N 3) (== (: 50) 1))
        (<>
         (text #:color 2 "【亜子】ねえ・・・公園に行くんでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】そうだな・・・行ってみるか。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・なに？")
      (wait)
      (text #:color 2 "【亜子】先負学園の生徒とデートだなんて・・・自分でも信じられないわ。")
      (wait)
      (text #:color 7 "【" 0 "】別にデートって考える事はないだろ？・・・一緒にお茶を飲みに来ただけじゃないか。")
      (wait)
      (text #:color 2 "【亜子】まあ・・・そうだけど。")
      (wait)
      (text #:color 7 "【" 0 "】亜子さんって、歳下の男は嫌いなの？")
      (wait)
      (text #:color 2 "【亜子】嫌いって事はないけど、彼氏にするならやっぱり歳上よね。")
      (wait)
      (text #:color 7 "【" 0 "】７０歳ぐらい？")
      (wait)
      (text #:color 2 "【亜子】それじゃあ、歳上すぎるわよ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【亜子】さっき、さとみちゃんが言った事・・・本当なの？")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 2 "【亜子】ほら、シュガーの中にセイロガンを入れたり、窓を突き破ったりした事よ。")
      (wait)
      (text #:color 7 "【" 0 "】まあ・・・そんな事もあったかな。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 2 "【亜子】恐ろしい事をするわねー・・・" 0 "君って何者なの！？")
      (wait)
      (text #:color 7 "【" 0 "】俺は真面目で平凡な学生さ・・・そう見えるだろ？")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【亜子】ねえ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 2 "【亜子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なに？")
      (wait)
      (text #:color 2 "【亜子】話は変わるけど、真子姉さんの事をどう思う？")
      (wait)
      (text #:color 7 "【" 0 "】真子先生の事？・・・そりゃあ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "奇麗な人") (text "やりたい女") (text "眼中にない")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】奇麗な人だよな・・・うん。") (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】やりたい女だな・・・うん。")
         (wait)
         (text #:color 2 "【亜子】やりたいって事は、それほど素敵な女性って事でしょ？")
         (wait)
         (text #:color 7 "【" 0 "】まあ、そういう事になるかな？")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】眼中にないぜ・・・へっ！！")
         (wait)
         (text #:color 2 "【亜子】あ、真子姉さんが来た。")
         (wait)
         (text #:color 7 "【" 0 "】と言うのは嘘で、真子先生の前に立つと上がっちゃう程、素敵な人だと思う。")
         (wait)))
       (else (<>)))
      (text #:color 2 "【亜子】そうなのよ、だから困っちゃうのよ・・・子供の頃からいつも比べられてばかり。")
      (wait)
      (text #:color 7 "【" 0 "】どうして比べられるといやなんだ！？")
      (wait)
      (text
       #:color
       2
       "【亜子】わかりきった事を聞かないで・・・私と真子姉さんとじゃ、蒸気機関車と新幹線、軽自動車とＦ１ぐらいの差があるわよ。")
      (wait)
      (text #:color 7 "【" 0 "】そうかなあ、亜子さんだって・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "かわいい") (text "美人") (text "愛らしい") (text "ブス")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】かわいいと思うぜ。")
         (wait)
         (text #:color 2 "【亜子】いいのよ、気を使わなくても。")
         (wait)
         (text #:color 7 "【" 0 "】お世辞じゃないよ・・・なんだったら、その辺りに歩いてる通行人に聞いたっていいぜ。")
         (wait)
         (text #:color 2 "【亜子】その辺りの通行人は、真子姉さんの事を知らないじゃない。")
         (wait)
         (set-reg: 106 (+ (: 106) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】美人だと思うぜ。")
         (wait)
         (text #:color 2 "【亜子】美人？私が？・・・もう、適当な事を言わないで。")
         (wait)
         (text #:color 7 "【" 0 "】適当な事なんか言ってないよ・・・美人だと思うから、美人って言ったんだぜ。")
         (wait)
         (text #:color 2 "【亜子】私、美人って言われるより・・・かわいいって言われてみたい。")
         (wait)
         (text #:color 7 "【" 0 "】じゃあ、かわいい。")
         (wait)
         (text #:color 2 "【亜子】もう・・・" 0 "君にとって、私なんかどうでもいいのよね。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】愛らしいと思うよ・・・すごく。")
         (wait)
         (text #:color 2 "【亜子】愛らしい？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】ああ、表情なんかすごく愛らしいし・・・唇がピンク色で、目がちょっと寂しげで、真子先生よりもてると思うけど。")
         (wait)
         (text #:color 2 "【亜子】私が真子姉さんよりもてる？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】ああ、確かに真子先生は美人だけど・・・亜子さんには、真子先生にない魅力がいっぱいあると思う。")
         (wait)
         (text #:color 2 "【亜子】・・・。")
         (wait)
         (text #:color 2 "【亜子】・・・。")
         (wait)
         (text #:color 2 "【亜子】・・・。")
         (wait)
         (text #:color 2 "【亜子】・・・ありがとう。")
         (wait)
         (text #:color 7 "【" 0 "】（うーん、亜子さんの脳細胞の活動は・・・たまに停止するみたいだな。）")
         (wait)
         (set-reg: 106 (+ (: 106) 2))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】ブスだと思うな・・・あわわわわわわっ！！")
         (wait)
         (text #:color 2 "【亜子】何て言ったの？")
         (wait)
         (text #:color 7 "【" 0 "】だから・・・ブ。")
         (wait)
         (text #:color 2 "【亜子】え？")
         (wait)
         (text #:color 7 "【" 0 "】だから・・・ス。")
         (wait)
         (text #:color 2 "【亜子】・・・。")
         (wait)
         (text #:color 2 "【亜子】・・・。")
         (wait)
         (text #:color 2 "【亜子】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】じ、冗談だからね？・・・ね？・・・ね？")
         (wait)
         (text #:color 2 "【亜子】冗談でも、そんな事を言わないで・・・。")
         (wait)
         (text #:color 7 "【" 0 "】（あらら・・・傷ついちゃったよ。）")
         (wait)
         (set-reg: 106 (- (: 106) 1))))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】とにかく・・・真子先生と自分を比べすぎなんじゃない？")
      (wait)
      (text #:color 2 "【亜子】姉妹なんてそんなものなのよ・・・特にどちらか片方が美人だったりするとね。")
      (wait)
      (text #:color 7 "【" 0 "】俺は・・・真子先生より、亜子さんの方が好みだな。")
      (wait)
      (text #:color 2 "【亜子】嘘ばっかり。")
      (wait)
      (text #:color 7 "【" 0 "】本当だよ、嘘じゃない。")
      (wait)
      (text #:color 2 "【亜子】じゃあ聞くけど、私のどこがいいのよ。")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (text #:color 2 "【亜子】ほら、考え込むって事は・・・本気で言った訳じゃないのよね。")
      (wait)
      (text #:color 7 "【" 0 "】そ、そんな事はないさ。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (cond
       ((== (: 15) 0) (<> (text #:color 2 "【亜子】私のいい部分って・・・どこ？") (wait)))
       ((== (: 15) 1)
        (<> (text #:color 2 "【亜子】もう一度聞くけど、私のいい部分ってどこなの？") (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】えーと、亜子さんのチャーミングな部分は・・・。")
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 16) 0) (text "目"))
        (if (== (: 17) 0) (text "耳"))
        (if (== (: 18) 0) (text "唇"))
        (if (== (: 19) 0) (text "髪型"))
        (if (== (: 20) 0) (text "肌"))
        (if (== (: 21) 0) (text "雰囲気"))
        (if (== (: 22) 0) (text "性格"))
        (if (== (: 23) 0) (text "胸"))
        (if (== (: 24) 0) (text "あそこ"))))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】目がいいな・・・優しそうだし、何となく哀愁に満ちたその目がいい。")
         (wait)
         (text #:color 2 "【亜子】本当かなあ・・・。")
         (wait)
         (set-reg: 16 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】耳の穴がいいね・・・すっごく。")
         (wait)
         (text #:color 2 "【亜子】耳の穴がいいって、ふざけてるの？")
         (wait)
         (text #:color 7 "【" 0 "】ちょっと。")
         (wait)
         (text #:color 2 "【亜子】" 0 "君って、嫌い。")
         (wait)
         (set-reg: 106 (- (: 106) 1))
         (set-reg: 17 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】唇がいいな・・・ピンク色で、ちょっと濡れてるような感じがする。")
         (wait)
         (text #:color 2 "【亜子】本当？")
         (wait)
         (text #:color 7 "【" 0 "】ああ、すごくセクシーだぜ。")
         (wait)
         (text #:color 2 "【亜子】そう言われると、悪い気がしないわね。")
         (wait)
         (set-reg: 106 (+ (: 106) 1))
         (set-reg: 18 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】その髪型、すごく似合ってると思うよ。")
         (wait)
         (text #:color 2 "【亜子】でも、髪型なんて変えられるし・・・もっと内面的な部分で、いい所ってないのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】内面的ねえ・・・。")
         (wait)
         (set-reg: 19 1)))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】いい肌してやがるぜ・・・ぴちぴち、つるつるってか？")
         (wait)
         (text #:color 2 "【亜子】言い方がいやらしいと、誉められてる気がしないわ。")
         (wait)
         (text #:color 7 "【" 0 "】だからあ・・・真子先生と比べて、肌は亜子さんの方が奇麗だって言ってるんだよ。")
         (wait)
         (text #:color 2 "【亜子】肌だけ？")
         (wait)
         (text #:color 7 "【" 0 "】うっうっうっ・・・どうしてそういう解釈の仕方をするの？")
         (wait)
         (set-reg: 20 1)))
       ((== N 6)
        (<>
         (text #:color 7 "【" 0 "】雰囲気がいいな・・・なんとなくゆったりしてて、一緒にいると安心できるように感じる。")
         (wait)
         (text #:color 2 "【亜子】それって、私がボーっとしてるからかしら？")
         (wait)
         (text #:color 7 "【" 0 "】とにかくいい雰囲気さ・・・すごく女性っぽくて、暖かい雰囲気だぜ。")
         (wait)
         (text #:color 2 "【亜子】ふーん・・・そんなものなのかなあ。")
         (wait)
         (set-reg: 21 1)))
       ((== N 7)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ、性格だよ・・・亜子さんの性格がいい部分だ。")
         (wait)
         (text #:color 2 "【亜子】" 0 "君、私の性格を知ってるの？")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】優しくて、親切で、明るくて、ひょうきんで、穏やかで、正直で、好き嫌いがなくて、社交的で。")
         (wait)
         (text #:color 2 "【亜子】" 0 "君、頭に浮かんだ言葉を口に出してるだけでしょ？")
         (wait)
         (set-reg: 22 1)))
       ((== N 8)
        (<>
         (text #:color 7 "【" 0 "】胸だな・・・うん、実にいい胸だ。")
         (wait)
         (text #:color 2 "【亜子】見た事もない癖に、よく言うわね。")
         (wait)
         (text #:color 7 "【" 0 "】俺ぐらいになると、服の上から見てもわかるんだよ・・・うーん、実にいい。")
         (wait)
         (text
          #:color
          2
          "【亜子】胸を誉められて喜ぶのは、すでに恋人同士になってる人達だけよ・・・歳下の男の子に胸の事を言われても、恥ずかしいだけだわ。")
         (wait)
         (set-reg: 23 1)))
       ((== N 9)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ・・・アソコだな。")
         (wait)
         (text #:color 2 "【亜子】え？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】亜子さんのアソコ、きっとしまりがよくて・・・奥も深くて、カズノコが天井についてるって感じだな。")
         (wait)
         (text #:color 2 "【亜子】それって・・・誉めてるの？")
         (wait)
         (text #:color 7 "【" 0 "】誉めてない？")
         (wait)
         (text #:color 2 "【亜子】スケベな酔っ払いのオヤジに、からかわれてるって気分だわ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは。")
         (wait)
         (text #:color 2 "【亜子】相手が" 0 "君じゃなかったら、コーヒーを頭からかけてるわよ・・・とっくに。")
         (wait)
         (text #:color 7 "【" 0 "】ごめんなさい、もう言いません。")
         (wait)
         (text #:color 2 "【亜子】" 0 "君って、頭の中がオヤジなんじゃない？")
         (wait)
         (set-reg: 24 1)
         (set-reg: 106 (- (: 106) 1))))
       (else (<>)))
      (if-else (&& (== (: 16) 1) (== (: 18) 1) (== (: 21) 1))
        (<>
         (text #:color 7 "【" 0 "】とにかく・・・亜子さんは素敵だよ、もっと自分に自信を持てば？")
         (wait)
         (text #:color 2 "【亜子】自分でも持とうと思ってるんだけど・・・なかなかうまくいかないわ。")
         (wait)
         (set-reg: 14 1))
        (<>))
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】いい天気だなあ・・・亜子さんって夏休みの間、どこにも行かないの？")
      (wait)
      (text #:color 2 "【亜子】私は学生じゃないから、夏休みなんてないの・・・だいたいうちの薬局は年中無休なのよ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、それじゃあ『コンビニエンス・ドラック・ストア』だな。")
      (wait)
      (text #:color 2 "【亜子】いつも店の中にはいるから、たまにはどこかに行きたいわね・・・たとえば・・・。")
      (wait)
      (text #:color 7 "【" 0 "】俺と一緒にホテルとか？")
      (wait)
      (text #:color 2 "【亜子】" 0 "君っ！！")
      (wait)
      (text #:color 6 "カッチャーン！！")
      (wait)
      (text #:color 7 "【" 0 "】ど、怒鳴るなよ・・・スプーンを落としたじゃないか。")
      (wait)
      (text #:color 2 "【亜子】拾えばいいじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】マナーを知らないな、落としたナイフやフォークは自分で拾っちゃいけないんだぜ。")
      (wait)
      (text #:color 2 "【亜子】ここは喫茶店よ、さとみちゃんに文句を言われる前に自分で拾った方がいいわ。")
      (wait)
      (text #:color 7 "【" 0 "】へいへい。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "t10.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 0)
      (text #:color 7 "【" 0 "】スプーンを拾って・・・ん？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ひっひっひっ、こりゃあいい眺めだぜ。")
      (wait)
      (set-arr~ @ 7 0)
      (load "t10.a6" 47104)
      (set-reg: 26 1)
      (set-reg: 49 1)))
    ((&& (== V 2) (== N 1) (== (: 27) 0))
     (<>
      (cond
       ((== (: 28) 0)
        (<>
         (text #:color 2 "【亜子】本当にいい天気・・・どこかに行きたいわ。")
         (wait)
         (text #:color 7 "【" 0 "】俺と一緒に行こうぜ・・・今から。")
         (wait)
         (text #:color 2 "【亜子】今からって、いったいどこに行くつもり？・・・真子姉さんがお店で待ってるもの。")
         (wait)))
       ((== (: 28) 1) (<> (text #:color 2 "【亜子】近所だったら、つき合ってもいいわよ。") (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】えーと、この近所で行ける場所は・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "ラブホテル") (text "工事現場") (text "公園") (text "喫茶店")))
      (cond
       ((== N 1)
        (<>
         (text #:color 2 "【亜子】ラブホテルって言うんでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】ぎょっ！？")
         (wait)
         (text #:color 2 "【亜子】行く訳がないでしょ？・・・部屋の中にいたら、店の中にいるのと変わらないじゃない。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】工事現場なんてどう？・・・野外だし、ついでに仕事をすればお金も入ってくる。")
         (wait)
         (text #:color 2 "【亜子】" 0 "君、一人で行ってきたら？・・・私は遠慮するわ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】公園なんて・・・子供っぽいかな？")
         (wait)
         (text #:color 2 "【亜子】矢吹町公園に行くの？・・・確かに自然がいっぱいだけど、ちょっと遠いいし・・・。")
         (wait)
         (text #:color 2 "【亜子】それに私、人がたくさんいる場所って苦手なの・・・小さくても誰もいない公園の方がいい。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】ちょうどいい場所があるぜ・・・俺が一人暮ししてるマンションの裏に、小さな公園があるんだけど。")
         (wait)
         (text
          #:color
          2
          "【亜子】"
          0
          "君が一人暮ししてるマンションの裏？・・・"
          0
          "君って、マンションに一人で住んでるの？")
         (wait)
         (text #:color 7 "【" 0 "】うん・・・親の転勤で、俺だけ先負町に残ったんだ。")
         (wait)
         (text #:color 2 "【亜子】へえ・・・。")
         (wait)
         (text #:color 7 "【" 0 "】とにかく、あそこの公園なら近いし・・・人だっていつもいないんだ。")
         (wait)
         (text #:color 2 "【亜子】ちょっと年寄りみたいだけど・・・散歩って事でどう？")
         (wait)
         (text #:color 7 "【" 0 "】俺は何でもいいさ、家も近いし帰りが楽だ。")
         (wait)
         (text #:color 2 "【亜子】そのセリフこそ、本当に年寄りみたいじゃない・・・フケた学生なんてシャレにならないわよ。")
         (wait)
         (set-reg: 27 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】喫茶店に行こう。")
         (wait)
         (text #:color 2 "【亜子】喫茶店って・・・別の喫茶店に行くって事かしら？")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・ここは喫茶店だったな。")
         (wait)
         (text #:color 2 "【亜子】笑わせようとして言ったのかと思った・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 28 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 2 "【亜子】つき合ってあげるわよ・・・その公園って、ここから近いんでしょ？")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 1) (== N 2) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】（なんだか・・・ぐるっと回りそうな髪型だな、まさかカツラじゃないだろうな？）")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 2) (== (: 29) 1))
     (<>
      (text #:color 2 "【亜子】ボブカットよ。")
      (wait)
      (text #:color 7 "【" 0 "】わかってるよ・・・もう。")
      (wait)))
    ((&& (== V 1) (== N 3) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】（お世辞じゃなく・・・かわいいと思うけどな。）")
      (wait)
      (text #:color 2 "【亜子】なに？・・・私の顔をじっと見ちゃって。")
      (wait)
      (set-reg: 30 1)))
    ((&& (== V 1) (== N 3) (== (: 30) 1))
     (<> (text #:color 7 "【" 0 "】（亜子さんの顔を見てると・・・なんだか子供っぽい感じがしてくるな。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 31) 0))
     (<>
      (text #:color 7 "【" 0 "】（歳上だけど、汚れのない肌って感じだな・・・もしかして、亜子さんは処女だろうか？）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（まさか・・・ね。）")
      (wait)
      (set-reg: 31 1)))
    ((&& (== V 1) (== N 4) (== (: 31) 1))
     (<> (text #:color 7 "【" 0 "】（奇麗な肌だ・・・ごっくんコキ丸だぜ。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 32) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（亜子さんと喫茶店に来るのは、初めてだぜ・・・こうして向かい合っていると、亜子さんが高校生みたいに感じるぞ。）")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 32) 1))
     (<> (text #:color 7 "【" 0 "】（真子先生の妹・・・亜子さんだ。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 33) 0))
     (<>
      (text #:color 7 "【" 0 "】この制服だとよくわからないなあ。")
      (wait)
      (text #:color 2 "【亜子】何が？")
      (wait)
      (text #:color 7 "【" 0 "】胸の大きさ。")
      (wait)
      (text #:color 2 "【亜子】私は・・・小さいわよ。")
      (wait)
      (text #:color 7 "【" 0 "】見せて。")
      (wait)
      (text #:color 2 "【亜子】いや。")
      (wait)
      (text #:color 7 "【" 0 "】先っちょ５ミリでいいから。")
      (wait)
      (text #:color 2 "【亜子】その先っちょが大事なの。")
      (wait)
      (set-reg: 33 1)))
    ((&& (== V 1) (== N 6) (== (: 33) 1))
     (<>
      (text #:color 7 "【" 0 "】見た感じは・・・８０センチかな？")
      (wait)
      (text #:color 2 "【亜子】" 0 "君って・・・すごく子供っぽいか、オヤジみたいな学生か、どっちかよね。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 34) 0))
     (<>
      (text #:color 7 "【" 0 "】コーヒーっておいしい？")
      (wait)
      (text #:color 2 "【亜子】たまに飲むとね。")
      (wait)
      (text #:color 7 "【" 0 "】精子とどっちがおいしい？")
      (wait)
      (text #:color 2 "【亜子】うーん、日本酒ってあまり好きじゃないのよ。")
      (wait)
      (text #:color 7 "【" 0 "】あの・・・セイシュって言ったんじゃないけど。")
      (wait)
      (set-reg: 34 1)))
    ((&& (== V 1) (== N 7) (== (: 34) 1))
     (<>
      (text #:color 7 "【" 0 "】コーヒーはブラックに限るな・・・うん。")
      (wait)
      (text #:color 2 "【亜子】" 0 "君、スプーンをなめながらブツブツ言わないで。")
      (wait)
      (text #:color 7 "【" 0 "】ぺっぺっ！！金属の味がする。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 35) 0))
     (<>
      (text #:color 7 "【" 0 "】おいおい、自分の手を見てどうするんだよ。")
      (wait)
      (set-reg: 35 1)))
    ((&& (== V 1) (== N 8) (== (: 35) 1))
     (<> (text #:color 7 "【" 0 "】俺様の手だ・・・文句あるか？") (wait)))
    ((&& (== V 1) (== N 9) (== (: 36) 0))
     (<>
      (text #:color 7 "【" 0 "】幸運のスプーンだな・・・さとみに感謝しないと。")
      (wait)
      (set-reg: 36 1)))
    ((&& (== V 1) (== N 9) (== (: 36) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】このスプーンのおかげで、亜子さんの『秘密の花園布切れ付き』を見る事ができたんだ、感謝、感謝、感謝。")
      (wait)))
    ((&& (== V 8) (== N 10) (== (: 37) 0))
     (<>
      (text #:color 7 "【" 0 "】いいや、触らない方がいいだろう・・・その方がずっと見てられる。")
      (wait)
      (set-reg: 37 1)))
    ((&& (== V 8) (== N 10) (== (: 37) 1))
     (<> (text #:color 7 "【" 0 "】よそうぜ・・・。") (wait)))
    ((&& (== V 1) (== N 11) (== (: 38) 0))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・このチラリズムが、たまらんぜ。")
      (wait)
      (text #:color 7 "【" 0 "】ブルーかな・・・白かな？")
      (wait)
      (set-reg: 38 1)))
    ((&& (== V 1) (== N 11) (== (: 39) 0))
     (<>
      (text #:color 7 "【" 0 "】『秘密のデルタ地帯』だぜ・・・ひっひっひっ。")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・ちょっともっこりしてるところが、妙にいやらしいなあ。")
      (wait)
      (text #:color 7 "【" 0 "】もっとも、こうやって覗いてる俺の方が、よっぽどいやらしいけど・・・。")
      (wait)
      (set-reg: 39 1)))
    ((&& (== V 1) (== N 11) (== (: 39) 1))
     (<>
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】はっ！？・・・我を忘れて見てたぞ。")
      (wait)
      (set-reg: 39 2)))
    ((&& (== V 1) (== N 11) (== (: 39) 2))
     (<>
      (text #:color 7 "【" 0 "】もうちょっと見ていたいけど・・・どうする？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "もう飽きた") (text "まだ見続ける")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・もう充分に見たぞ。")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "30.pd8")
         (proc 15)
         (set-arr~ @ 6 1)
         (image "t11.pd8")
         (proc 16)
         (set-arr~ @ 6 1)
         (image "t11an.pd8")
         (set-arr~ @ 6 0)
         (set-arr~ @ 7 0)
         (load "t11.s4" (~ @ 2))
         (animate 0 0 0)
         (animate 1 0)
         (set-arr~ @ 7 0)
         (set-arr~ @ 7 0)
         (load "t11.a6" 47104)
         (text #:color 2 "【亜子】スプーン、なかなか取れなかったの？")
         (wait)
         (text #:color 7 "【" 0 "】いやあ、意外と重くてさ・・・スプーンが。")
         (wait)
         (text #:color 2 "【亜子】？？？")
         (wait)
         (set-reg: 49 0)))
       ((== N 2)
        (<> (text #:color 7 "【" 0 "】いくら見ても飽きないな・・・このままここに住んでしまおうか？") (wait)))
       (else (<>)))))
    ((&& (== V 6) (== N 12) (== (: 40) 0))
     (<>
      (text #:color 7 "【" 0 "】そーれ、かちゃかちゃかちゃ・・・って、口で言ってるだけだぜ。")
      (wait)
      (set-reg: 40 1)))
    ((&& (== V 6) (== N 12) (== (: 40) 1))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】ベルトを取って、下着姿を見るより・・・こうやってチラチラ見えてた方が刺激的だと思うのは、俺だけだろうか？")
      (wait)))
    ((&& (== V 8) (== N 13) (== (: 41) 0))
     (<>
      (text #:color 7 "【" 0 "】そんな事をしたら、亜子さんはデーブルをひっくり返して驚くぞ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】面白いじゃないか・・・下着が見えてなかったら、何も考えずにそうしただろう。")
      (wait)
      (set-reg: 41 1)))
    ((&& (== V 8) (== N 13) (== (: 41) 1))
     (<> (text #:color 7 "【" 0 "】よそうぜ・・・面白そうだけど。") (wait)))
    ((&& (== V 1) (== N 14) (== (: 42) 0))
     (<>
      (text #:color 7 "【" 0 "】うーん、このスカートのエッジの部分と、ふともものコントラスト・・・いいなあ。")
      (wait)
      (set-reg: 42 1)))
    ((&& (== V 1) (== N 14) (== (: 42) 1))
     (<> (text #:color 7 "【" 0 "】世の中から『短いスカート』がなくなったら、俺は生きてるつもりはないぞ。") (wait)))
    ((&& (== V 1) (== N 15) (== (: 43) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】これだよ、これ！！亜子さんには黒や白いストッキングは似合わない・・・限りなく素肌に近いベージュ、これで決まりだな。")
      (wait)
      (set-reg: 43 1)))
    ((&& (== V 1) (== N 15) (== (: 43) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん、触ってみたいけど・・・触ったらこのシーンからお別れだ。")
      (wait)
      (text #:color 7 "【" 0 "】まだまだ見たいけど・・・どうしようかな？")
      (wait)))
    ((&& (== V 1) (== N 16) (== (: 44) 0))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】喫茶店の店内なんて、いつでも見れるだろ？・・・俺は今、めったに見れない部分を見る事ができるんだぜ。")
      (wait)
      (set-reg: 44 1)))
    ((&& (== V 1) (== N 16) (== (: 44) 1))
     (<> (text #:color 7 "【" 0 "】そんな物は、どうだっていい・・・。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))