(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\な
  #\。
  #\、
  #\っ
  #\み
  #\ん
  #\か
  #\て
  #\ろ
  #\う
  #\の
  #\ひ
  #\だ
  #\？
  #\と
  #\に
  #\し
  #\は
  #\る
  #\よ
  #\た
  #\ー
  #\わ
  #\が
  #\ら
  #\で
  #\！
  #\も
  #\さ
  #\を
  #\あ
  #\そ
  #\ゃ
  #\れ
  #\き
  #\く
  #\言
  #\ど
  #\女
  #\０
  #\や
  #\り
  #\ま
  #\じ
  #\彼
  #\け
  #\俺
  #\ね
  #\ち
  #\私
  #\事
  #\君
  #\日
  #\子
  #\こ
  #\え
  #\つ
  #\人
  #\何
  #\ふ
  #\す
  #\お
  #\行
  #\ょ
  #\変
  #\ば
  #\気
  #\氏
  #\場
  #\め
  #\１
  #\ト
  #\所
  #\せ
  #\塩
  #\好
  #\ク
  #\円
  #\思
  #\フ
  #\見
  #\ブ
  #\水
  #\パ
  #\持
  #\大
  #\ジ
  #\２
  #\曜
  #\園
  #\歯
  #\一
  #\方
  #\合
  #\ラ
  #\入
  #\ご
  #\ル
  #\ェ
  #\食
  #\べ
  #\ロ
  #\出
  #\話
  #\公
  #\ぜ
  #\当
  #\追
  #\会
  #\度
  #\早
  #\テ
  #\嫌
  #\（
  #\物
  #\）
  #\今
  #\時
  #\ン
  #\ョ
  #\不
  #\ホ
  #\他
  #\デ)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "29.pd8")
 (proc 15)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "o10.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 264) 0)
   (<>
    (text #:color 7 "【" 0 "】ここが『ＯＴＩＭＴＩＭ』さ。")
    (wait)
    (text #:color 2 "【ひろみ】知ってるわよ、私も何度か来た事があるから・・・早く中に入りましょ？")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "30.pd8")
    (proc 15)
    (set-arr~ @ 6 1)
    (image "o10.pd8")
    (proc 16)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o10an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "o10.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 18)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 2 "【ひろみ】なんだか・・・噂の" 0 "君と、こうやって差し向いって言うのも変な感じね。")
    (wait)
    (text #:color 7 "【" 0 "】その噂って言うのはやめてくれ・・・俺はフツーの男の子さ。")
    (wait)
    (text #:color 2 "【ひろみ】ふふふ、ごめんなさい・・・フツーのかわいい男の子だわ。")
    (wait)
    (text #:color 6 "【さとみ】いらっしゃいませ・・・何になさいますか？")
    (wait)
    (text #:color 7 "【" 0 "】あれれ！？・・・声はするけど姿は見えない。")
    (wait)
    (text #:color 6 "【さとみ】いつものように、テーブルと" 0 "の間に入りましょうか？")
    (wait)
    (text #:color 2 "【ひろみ】？？？")
    (wait)
    (text #:color 7 "【" 0 "】いい・・・遠慮しとく。")
    (wait)
    (text #:color 6 "【さとみ】ご注文は？")
    (wait)
    (text #:color 2 "【ひろみ】私・・・パフェが食べたな。")
    (wait)
    (text #:color 7 "【" 0 "】俺は・・・。")
    (wait)
    (text #:color 6 "【さとみ】パフェと塩水ですね・・・かしこまりました。")
    (wait)
    (text #:color 2 "【ひろみ】" 0 "君って変わってるわねー・・・塩水なんか飲むの？")
    (wait)
    (text #:color 7 "【" 0 "】うっうっうっ、俺はまだ何も言ってない。")
    (wait)
    (text #:color 2 "【ひろみ】塩水なんか飲むと、逆に咽が渇くわよ。")
    (wait)
    (text #:color 7 "【" 0 "】だから、俺は何も言ってないってば。")
    (wait)
    (text #:color 2 "【ひろみ】わかった・・・いつも塩水を頼んでるから、何も言わなくても塩水を持ってきてくれるんだ。")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】ちくしょう、もうどうでもいいや・・・そうだよ、その通りさ！！どうせ俺は塩水が大好きなナメクジ野郎だよ。")
    (wait)
    (text #:color 2 "【ひろみ】" 0 "君、ナメクジは塩が嫌いなのよ。")
    (wait)
    (text #:color 6 "【さとみ】お待たせしました、パフェと塩水ですね。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o09.pd8")
    (proc 16)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "o10an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "o10.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 2 "【ひろみ】わあ、おいしそう！！")
    (wait)
    (text #:color 7 "【" 0 "】（女の子って、２０歳を過ぎても甘い物が好きなんだよなあ。）")
    (wait)
    (text #:color 2 "【ひろみ】どうしたの、ジロジロ見て・・・" 0 "君も食べたいんだ。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "外に出る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 2 "【ひろみ】もう帰るの？")
         (wait)
         (text #:color 7 "【" 0 "】まだ早いな・・・もう少し話をしよう。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 2 "【ひろみ】ごちそうさま、とっても楽しかったわ。")
         (wait)
         (if-else (== (: 264) 1)
           (<>
            (text #:color 7 "【" 0 "】俺もさ・・・じゃあ今度の日曜日、午前１１時に矢吹公園の入口で待ってるぜ。")
            (wait)
            (text #:color 2 "【ひろみ】遅刻しないでね。")
            (wait)
            (text #:color 7 "【" 0 "】大丈夫だよ、俺はこれでも時間にはうるさいんだ。")
            (wait)
            (text #:color 2 "【ひろみ】わかったわ・・・じゃあ、そろそろ行きましょ？")
            (wait))
           (<>))
         (text #:color 6 "【さとみ】ありがとうございましたー！！・・・パフェと塩水で２０００円になります。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 6 "【さとみ】２０００円です。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 6 "【さとみ】２５００円にしようかな。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 6 "【さとみ】３０００円です。")
         (wait)
         (cond
          ((< M 2000)
           (<>
            (text #:color 7 "【" 0 "】３０００円だろうが、５０００円だろうが、いくらだって同じだよ。")
            (wait)
            (text #:color 6 "【さとみ】どうして？")
            (wait)
            (text #:color 7 "【" 0 "】はっはっはっ！！俺様は貧乏だ。")
            (wait)
            (text #:color 6 "【さとみ】" 0 "っ！！２０００円でいいから、ちゃんと払いなさい。")
            (wait)
            (text #:color 7 "【" 0 "】悪いな、ツケといてくれ。")
            (wait)
            (text
             #:color
             4
             "【神の声】そのお金は私が出してしんぜよう・・・その代わり、『見えない女の子ポイント』を１つ下げといてやるぞえ。")
            (wait)
            (sound 1)
            (set-var I 58)
            (proc 26)
            (set-reg: 835 0)
            (set-var M (+ M 2000))
            (proc 11)
            (text #:color 7 "【" 0 "】誰だか知らないけど、俺ってついてるな・・・はっはっはっ！！")
            (wait)
            (sound 1)
            (set-var I 18)
            (proc 26)
            (set-reg: 835 0)
            (text #:color 4 "【神の声】ふぉっ、ふぉっ・・・本当にそうかな？")
            (wait)
            (text #:color 6 "【さとみ】あれれ！？・・・" 0 "、お金を持ってるじゃない・・・貧乏だなんて言っちゃって。")
            (wait)
            (text #:color 7 "【" 0 "】ほれ、２０００円。")
            (wait)
            (set-var M (- M 2000))
            (set-var A 1)
            (proc 13)
            (proc 11)
            (text #:color 6 "【さとみ】ありがとうございましたー！！")
            (wait)
            (set-reg: 111 (- (: 111) 1))))
          ((> M 1999)
           (<>
            (text #:color 7 "【" 0 "】ほれっ！！２０００円っ！！")
            (wait)
            (set-var M (- M 2000))
            (set-var A 1)
            (proc 13)
            (proc 11)
            (text #:color 6 "【さとみ】ありがとうございましたー！！")
            (wait)))
          (else (<>)))
         (field 14 1 1)
         (field 13 0 0)
         (field 13 1 1)
         (set-reg: 1001 0)
         (set-reg: 853 1)
         (set-reg: 267 1)
         (set-var N 9)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】そうだな・・・まだ来たばかりじゃないか。") (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 2 "【ひろみ】" 0 "君・・・私、そろそろ行かないと。")
         (wait)
         (text #:color 7 "【" 0 "】そうか、お客さんが来るんだっけ。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君も、パフェを頼めば？")
      (wait)
      (text #:color 7 "【" 0 "】いや、俺はいいんだ・・・。")
      (wait)
      (text #:color 2 "【ひろみ】どうして？")
      (wait)
      (text #:color 7 "【" 0 "】決まってるさ、そりゃあ俺が・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "糖尿病だから") (text "甘い物が嫌い") (text "虫歯が痛い")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】糖尿病だからさ。")
         (wait)
         (text #:color 2 "【ひろみ】トウニョウビョウ！？・・・うっそー！！")
         (wait)
         (text #:color 7 "【" 0 "】だろう？・・・いつからそんな病気になったんだ、俺は？")
         (wait)
         (text #:color 2 "【ひろみ】なんだかおジイさんみたい。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】甘い物が苦手なんだよ・・・だいたいパフェなんて、女子供の食べ物だぜ。")
         (wait)
         (text #:color 2 "【ひろみ】へえ・・・" 0 "君って、子供じゃなかったんだ。")
         (wait)
         (text #:color 7 "【" 0 "】失礼な、こう見えても俺は苦みばしった物が大好きな大人だよ。")
         (wait)
         (text #:color 2 "【ひろみ】ふーん、意外だわ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】虫歯なんだよ。")
         (wait)
         (text #:color 2 "【ひろみ】ちゃんと歯医者さんに行かないとだめじゃない。")
         (wait)
         (text #:color 7 "【" 0 "】歯医者さんに行けないほど、ひどい虫歯なんだ・・・もうボロボロ。")
         (wait)
         (text #:color 2 "【ひろみ】もしかして、" 0 "君って歯を磨かない人？")
         (wait)
         (text #:color 7 "【" 0 "】そうだなあ、最後に歯を磨いたのは去年のクリスマス・・・いや、お正月だったかな？")
         (wait)
         (text #:color 2 "【ひろみ】やだ・・・不潔。")
         (wait)
         (set-reg: 103 (- (: 103) 1))))
       (else (<>)))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【ひろみ】男の人と喫茶店に入るなんて、本当に久しぶりだわ。")
      (wait)
      (text #:color 7 "【" 0 "】あれれ！？・・・確かひろみさんには彼氏がいるんじゃあ？")
      (wait)
      (text #:color 2 "【ひろみ】私の彼氏ってね・・・ちょっと変わってるの。")
      (wait)
      (text #:color 7 "【" 0 "】変わってるって、まさか・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "女とか？") (text "ホモとか？") (text "ピーとか？")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】女とか？")
         (wait)
         (text #:color 2 "【ひろみ】女の人を彼氏って言う？")
         (wait)
         (text #:color 7 "【" 0 "】ははは、そりゃそうだ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ホモとか？")
         (wait)
         (text #:color 2 "【ひろみ】やだ・・・正常だと思うわよ。")
         (wait)
         (text #:color 7 "【" 0 "】だと思う？")
         (wait)
         (text #:color 2 "【ひろみ】だって・・・いいじゃない、そんな話は。")
         (wait)
         (text #:color 7 "【" 0 "】なんだよう、自分から変わってるって言ったんじゃないか。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】ピーとか？")
         (wait)
         (text #:color 2 "【ひろみ】ピー？")
         (wait)
         (text #:color 7 "【" 0 "】禁止用語なんだよ・・・だから、ピーとか？")
         (wait)
         (text #:color 2 "【ひろみ】ひ、ひどいわ・・・そんな言葉を口にできるなんて、" 0 "君ってひどいすぎる。")
         (wait)
         (text #:color 7 "【" 0 "】お、俺は何て言ったんだあ！！")
         (wait)))
       (else (<>)))
      (text #:color 2 "【ひろみ】あのね・・・私の彼氏って、喫茶店に行ったりする事が嫌いなの。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ他の場所に行けばいいじゃない。")
      (wait)
      (text #:color 2 "【ひろみ】だから、他人がいる場所が嫌いなのよ。")
      (wait)
      (text #:color 7 "【" 0 "】おいおい・・・それじゃ、どこでデートするんだ！？")
      (wait)
      (text #:color 2 "【ひろみ】いつも彼の部屋とか・・・誰もいない夜の公園とか。")
      (wait)
      (text #:color 7 "【" 0 "】な、なんだかいやらしいなあ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君は彼女がいるんでしょ？・・・こんな所を見られたら、怒られちゃうわね。")
      (wait)
      (text #:color 7 "【" 0 "】大丈夫だよ、だって・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "彼女はいない") (text "理解がある") (text "いつもの事さ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】彼女なんていないから。")
         (wait)
         (text #:color 2 "【ひろみ】だって、女の子を追いかけ回してて・・・彼女ができないの？")
         (wait)
         (text #:color 7 "【" 0 "】できないから、女の子を追いかけているんだよ。")
         (wait)
         (text #:color 2 "【ひろみ】・・・。")
         (wait)
         (text #:color 2 "【ひろみ】納得したわ。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】俺の彼女は理解があるんだ・・・俺が何をしようが、文句一つ言わないぜ。")
         (wait)
         (text #:color 2 "【ひろみ】ふーん・・・どんな女の子なの？")
         (wait)
         (text #:color 7 "【" 0 "】どんな女の子って・・・あれれ、どんな女の子だっけ？")
         (wait)
         (text #:color 2 "【ひろみ】やだ、自分の彼女を忘れないでよ。")
         (wait)
         (text #:color 7 "【" 0 "】それ以前の問題で・・・俺って彼女がいたか？")
         (wait)
         (text #:color 2 "【ひろみ】いないの？・・・女の子ばかり追いかけてるのに嘘みたい。")
         (wait)
         (text #:color 7 "【" 0 "】できないから、女の子を追いかけているんだよ。")
         (wait)
         (text #:color 2 "【ひろみ】・・・。")
         (wait)
         (text #:color 2 "【ひろみ】納得したわ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】はっはっはっはっ！！")
         (wait)
         (text #:color 2 "【ひろみ】え？")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっはっ！！")
         (wait)
         (text #:color 2 "【ひろみ】？？？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】はっはっはっ、いつもの事だよ・・・彼女は俺に惚れてるからな、俺が何をしようが文句を言わない、いや、言えない訳だ。")
         (wait)
         (text #:color 2 "【ひろみ】かわいそう・・・大事にしてあげればいいのに。")
         (wait)
         (text #:color 7 "【" 0 "】誰を？")
         (wait)
         (text #:color 2 "【ひろみ】彼女をよ。")
         (wait)
         (text #:color 7 "【" 0 "】誰の？")
         (wait)
         (text #:color 2 "【ひろみ】" 0 "君の。")
         (wait)
         (text #:color 7 "【" 0 "】あれれ、俺に彼女なんか・・・いたか？")
         (wait)
         (text #:color 2 "【ひろみ】いないの？・・・女の子ばかり追いかけてるのに嘘みたい。")
         (wait)
         (text #:color 7 "【" 0 "】できないから、女の子を追いかけているんだよ。")
         (wait)
         (text #:color 2 "【ひろみ】・・・。")
         (wait)
         (text #:color 2 "【ひろみ】納得したわ。")
         (wait)))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】しかし変わった彼氏だな・・・他人がいる場所が嫌いだなんて言ったら、どこにも行けないじゃないか。")
      (wait)
      (text #:color 2 "【ひろみ】ちょっと極端な言い方をしたけど・・・確かにそうよね。")
      (wait)
      (text #:color 7 "【" 0 "】ひっひっひっ、一回会ってみたいな・・・その彼氏と。")
      (wait)
      (text #:color 2 "【ひろみ】気味の悪い笑い方をしないでよ、人に見せるような彼氏じゃないんだから。")
      (wait)
      (text #:color 7 "【" 0 "】あ・・・同じ男として、その言い方は許せないな。")
      (wait)
      (text #:color 7 "【" 0 "】好きでつき合ってるんだから、そんな言い方ってないんでないかい？")
      (wait)
      (text #:color 2 "【ひろみ】好きなのかなあ・・・私。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 2 "【ひろみ】私ね・・・たまーに彼の事が好きなのか、わからなくなってくるの。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君、私の気持ち・・・わかる？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "わかる") (text "わからない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】わかる、うんうん、よくわかる。")
         (wait)
         (text #:color 2 "【ひろみ】私がわからない事なのに、" 0 "君にわかるの？")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】わからない。")
         (wait)
         (text #:color 2 "【ひろみ】もう・・・ちゃんと私の話を聞いてる？")
         (wait)
         (set-reg: 103 (- (: 103) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ひろみさん自身がわからないのに、俺にわかる訳がないじゃないか。")
         (wait)
         (text #:color 2 "【ひろみ】そうよね・・・その通りだわ。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】でも、自分の気持ちがはっきりしないのにつき合うなんて・・・女の子って器用なんだな。")
      (wait)
      (text #:color 2 "【ひろみ】最初からわからなかった訳じゃないからね。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】どうやって知り合ったの？・・・今後の参考として聞きたいな。")
      (wait)
      (text #:color 2 "【ひろみ】はははは・・・あまり人に言いたくないのよね。")
      (wait)
      (text #:color 7 "【" 0 "】どうして？・・・最初に会った場所が変な場所なの？")
      (wait)
      (text #:color 2 "【ひろみ】どこで会ったと思う？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "ラブホテル") (text "工事現場") (text "秘密クラブ") (text "わからない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】ラブホテルとか？")
         (wait)
         (text #:color 2 "【ひろみ】あのね・・・どうしてラブホテルで出会った赤の他人が、つき合うようになるの？")
         (wait)
         (text #:color 7 "【" 0 "】だって・・・わからないから適当に言ったんだよ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】工事現場とか？")
         (wait)
         (text #:color 2 "【ひろみ】工事現場！？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】彼が一心不乱ツルハシを振り回し、ひろみさんが鉄骨を軽々と背負ってアルバイトに励む・・・汗をぬぐった拍子に、ふと目と目が合う二人・・・。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、なんてロマンチックな出会いなんだ。")
         (wait)
         (text #:color 2 "【ひろみ】はははははっ！！どこがロマンチックなのよ。")
         (wait)
         (text #:color 7 "【" 0 "】だって・・・わからないから適当に言ったんだよ。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】秘密クラブとか？")
         (wait)
         (text #:color 2 "【ひろみ】秘密クラブって・・・なあに？")
         (wait)
         (text #:color 7 "【" 0 "】ほら、会員制のクラブで・・・マンションの一室で夜な夜な行われる、淫らなパーティ。")
         (wait)
         (text #:color 2 "【ひろみ】そんな場所に行った事はありません。")
         (wait)
         (text #:color 7 "【" 0 "】だって・・・わからないから適当に言ったんだよ。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】うーん、うーん、うーん、うーん、うーん、うーん。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、うーん、うーん、うーん、うーん、うーん。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、うーん、うーん、うーん、うーん、うーん。")
         (wait)
         (text #:color 2 "【ひろみ】" 0 "君、額に血管が浮き出てきたわよ。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、うーん、うーん、うーん、うーん、うーん。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、うーん、うーん、うーん、うーん、うーん。")
         (wait)
         (text #:color 7 "【" 0 "】うーん、うーん、うーん、うーん、うーん、うーん。")
         (wait)
         (text #:color 2 "【ひろみ】も、もう考えなくていいから・・・ね？")
         (wait)
         (text #:color 7 "【" 0 "】だめだ・・・わからない。")
         (wait)))
       (else (<>)))
      (text #:color 2 "【ひろみ】きっと想像もつかない場所よ。")
      (wait)
      (text #:color 7 "【" 0 "】教えてくれよ・・・いいだろ？")
      (wait)
      (text #:color 2 "【ひろみ】だめ・・・私の暗い過去がバレちゃうわ。")
      (wait)
      (text #:color 7 "【" 0 "】気になるなあ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 2 "【ひろみ】今日みたいないい天気の日には、仕事なんかしないでどこかに行きたいと思わない？")
      (wait)
      (text #:color 7 "【" 0 "】行きたくでも一人じゃつまらないよ。")
      (wait)
      (text #:color 2 "【ひろみ】私は彼氏はいるけど、一緒に行ってくれそうにないし・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【ひろみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】なんだか暗い話になってきたな。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 1))
     (<>
      (text #:color 2 "【ひろみ】私ね・・・彼氏と別れようと思ってるの。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 2 "【ひろみ】だから・・・彼氏と別れようかなって。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 2 "【ひろみ】でね、何かきっかけが欲しいわけ。")
      (wait)
      (text #:color 7 "【" 0 "】初めて話をしたのに、けっこう過激な事を言い出すなあ。")
      (wait)
      (text #:color 2 "【ひろみ】私は" 0 "君の事をよく見かけてたから・・・他人のような気がしないけど。")
      (wait)
      (text #:color 7 "【" 0 "】へえ・・・そんなものなのか？")
      (wait)
      (text #:color 2 "【ひろみ】だって、せっかくの夏なのに・・・部屋の中や夜の公園のデートじゃ、私まで暗くなってきちゃうもん。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ、明るい所でデートすればいいだろ？")
      (wait)
      (text #:color 2 "【ひろみ】人がいない明るい場所なんてないわ・・・もういいの、私は彼氏と別れるって決めたんだから。")
      (wait)
      (text #:color 7 "【" 0 "】部屋の中で、電気をつければ明るいさ。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君、真面目に話してないでしょ？")
      (wait)
      (set-reg: 16 2)))
    ((&& (== V 2) (== N 1) (== (: 50) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君・・・変な事を言っていい？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いい") (text "いやだ")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】いいよ。") (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】やだよ、変な事なら聞きたくない。")
         (wait)
         (text #:color 2 "【ひろみ】変な事って、変な意味じゃないわよ。")
         (wait)
         (text #:color 7 "【" 0 "】ややこしいな・・・いったい何なんだ？")
         (wait)))
       (else (<>)))
      (text #:color 2 "【ひろみ】あのね・・・今度の日曜日は暇？")
      (wait)
      (text #:color 7 "【" 0 "】今度の日曜日って言うと・・・１７日か。")
      (wait)
      (text #:color 7 "【" 0 "】暇だよ・・・日曜日じゃなくてもいつも暇だからな、俺は。")
      (wait)
      (text #:color 2 "【ひろみ】日曜日に・・・私とデートしない？")
      (wait)
      (text #:color 7 "【" 0 "】え！？")
      (wait)
      (text
       #:color
       2
       "【ひろみ】もう、何度も言わせないで・・・日曜日に『矢吹公園』でデートしない？・・・私、お弁当作って持って行くから。")
      (wait)
      (text #:color 7 "【" 0 "】（な、なんだ！？・・・彼女の方から誘って来たぞ！？）")
      (wait)
      (text #:color 2 "【ひろみ】ねえ・・・返事をして。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いいよ") (text "絶対にやだ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】もちろんいいよ・・・で、何時に待ち合せをする？")
         (wait)
         (text #:color 2 "【ひろみ】ふふっ・・・よかった。")
         (wait)
         (text #:color 2 "【ひろみ】じゃあね、１７日の午前１１時に・・・矢吹公園の入口で待ってる。")
         (wait)
         (text #:color 7 "【" 0 "】１７日の午前１１時に・・・矢吹公園の入口か。")
         (wait)
         (set-reg: 264 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】絶対にいやだ！！")
         (wait)
         (text #:color 2 "【ひろみ】・・・そう。")
         (wait)))
       (else (<>)))
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 264) 0))
     (<>
      (text #:color 2 "【ひろみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】顔は笑ってるが・・・元気がなくなってしまった。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 264) 1))
     (<> (text #:color 2 "【ひろみ】楽しみだわあ・・・早く日曜日にならないかしら？") (wait)))
    ((&& (== V 1) (== N 2) (== (: 17) 0))
     (<>
      (text #:color 2 "【ひろみ】" 0 "君って、長い髪が好きなんでしょ？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "うん") (text "いいや！！")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな、長い髪が好きだよ。")
         (wait)
         (text #:color 2 "【ひろみ】私ね、似合わないのよ・・・長い髪が。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そうなんだ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いいや！！実は俺、ショートが好きなんだ。")
         (wait)
         (text #:color 2 "【ひろみ】へえ・・・。")
         (wait)
         (set-reg: 103 (+ (: 103) 1))))
       (else (<>)))
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 2) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（ひろみさんは、ショートヘアだよな・・・。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 18) 0))
     (<>
      (text #:color 2 "【ひろみ】私の顔って、正面から見ると丸いでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】丸い方が、でかいのよりはいい。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君、ちっとも誉め言葉になってないわよ。")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 3) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】かわいい顔をしてるよな・・・。")
      (wait)
      (text #:color 2 "【ひろみ】え？・・・何か言った？")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】ひろみさんって、奇麗な手をしてるね・・・。")
      (wait)
      (text #:color 2 "【ひろみ】ありがとう・・・でも、ちゃんと家事はやってるのよ。")
      (wait)
      (set-reg: 19 1)))
    ((&& (== V 1) (== N 4) (== (: 19) 1))
     (<>
      (text #:color 7 "【" 0 "】（ひろみさんの手だ・・・この手でニギニギして欲しい。）")
      (wait)
      (text #:color 2 "【ひろみ】変な事を考えているでしょ？")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】ひろみさんと喫茶店で一緒にいるなんて・・・夢のようだぜ。")
      (wait)
      (text #:color 2 "【ひろみ】ちょっとオーバーだけど・・・確かに不思議な気持ちだわ。")
      (wait)
      (text #:color 7 "【" 0 "】不思議？")
      (wait)
      (text #:color 2 "【ひろみ】先負学園の有名人と、お茶を飲んでるなんて・・・やっぱり不思議よ。")
      (wait)
      (text #:color 7 "【" 0 "】いい意味での有名人だったら、どんなにうれしいか・・・。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 5) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】（絶対におっぱいは大きいと思う・・・。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】早く食べないと溶けちゃうぜ・・・。")
      (wait)
      (text #:color 2 "【ひろみ】いいの・・・こうやって、ジワジワと溶けた方が美味しいのよ。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 6) (== (: 21) 1))
     (<>
      (text #:color 7 "【" 0 "】気になるなあ・・・早く食べてよ。")
      (wait)
      (text #:color 2 "【ひろみ】" 0 "君がまばたきしてる間に、ちゃんと食べてるわよ。")
      (wait)))
    ((&& (== V 1) (== N 7) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】曲げてみようか？")
      (wait)
      (text #:color 2 "【ひろみ】ふふふっ・・・怒られちゃうわ、店の人に。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 7) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】純銀だったら、持って帰ってやる。") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))