(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\い
  #\る
  #\。
  #\、
  #\く
  #\ん
  #\一
  #\っ
  #\だ
  #\か
  #\哉
  #\の
  #\う
  #\て
  #\し
  #\み
  #\？
  #\よ
  #\を
  #\に
  #\た
  #\あ
  #\は
  #\ゃ
  #\が
  #\と
  #\れ
  #\ら
  #\ち
  #\お
  #\！
  #\さ
  #\も
  #\こ
  #\俺
  #\事
  #\そ
  #\ー
  #\で
  #\ま
  #\や
  #\ど
  #\わ
  #\言
  #\き
  #\合
  #\じ
  #\ね
  #\す
  #\似
  #\ぜ
  #\話
  #\前
  #\チ
  #\ッ
  #\り
  #\ト
  #\つ
  #\め
  #\ろ
  #\人
  #\け
  #\金
  #\ジ
  #\え
  #\ク
  #\服
  #\ひ
  #\ヤ
  #\ン
  #\ば
  #\達
  #\何
  #\ょ
  #\行
  #\君
  #\バ
  #\髪
  #\見)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "29.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "i.pd8")
 (proc 16)
 (set-arr~ @ 6 1)
 (image "r.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "ran.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "r.s4" (~ @ 2))
 (animate 0 0 2)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 23)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "ir.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 250) 0)
   (<>
    (text #:color 6 "【くるみ】あ・・・" 0 "さんだ。")
    (wait)
    (text #:color 7 "【" 0 "】やあやあ、お二人揃って・・・これからセックスでもするのかい？")
    (wait)
    (if (== (: 151) 0)
      (<>
       (text #:color 5 "【一哉】おい、" 0 "・・・どうして約束の時間に来なかったんだよ。")
       (wait)
       (text #:color 7 "【" 0 "】ははは・・・すっかり忘れてた。")
       (wait)
       (text #:color 5 "【一哉】まったくひどいヤツだぜ・・・３０分も待ったんだぜ。")
       (wait)
       (text #:color 6 "【くるみ】もしかして、私の誕生日のプレゼントの話？")
       (wait)
       (text
        #:color
        5
        "【一哉】もっとも、お前の代わりに一緒に選んでくれる人がいたからな・・・結果からすれば、来なくてよかったのかもしれない。")
       (wait)
       (text #:color 7 "【" 0 "】おいおい。")
       (wait)))
    (if (== (: 151) 1)
      (<>
       (text #:color 5 "【一哉】" 0 "、くだらない事を言うなよ・・・俺達は清い交際をしてるんだぜ。")
       (wait)
       (text
        #:color
        7
        "【"
        0
        "】へっ！！・・・一哉に『清い交際』なんて似合わないよ、だいたいそんな言葉を信じるやつが、地球上にいると思うか？")
       (wait)
       (text #:color 6 "【くるみ】" 0 "さん・・・私達、本当に何もしてないのよ。")
       (wait)
       (text #:color 7 "【" 0 "】でしょう？・・・俺もそうじゃないかと思ったんだ。")
       (wait)
       (text #:color 5 "【一哉】ちぇっ、調子のいいやつだ。")
       (wait)))))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "中に入る") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 5 "【一哉】なんだよ・・・まだいいじゃないか。")
         (wait)
         (text #:color 6 "【くるみ】そうよ、" 0 "さん・・・もう少しお話をしましょうよ。")
         (wait)))
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】じゃあな・・・いやらしい事をしちゃ駄目だぞ。")
         (wait)
         (text #:color 6 "【くるみ】しないもん・・・ね？")
         (wait)
         (text #:color 5 "【一哉】したいけど・・・できない。")
         (wait)
         (set-var N 9)
         (set-reg: 250 1)
         (set-reg: 175 1)
         (slot 1 2)
         (mes-jump "town1.mes")))
       ((&& (== N 2) (== (: 50) 0))
        (<>
         (text #:color 6 "【くるみ】まだ行かないで・・・もう少しここで話をしましょ？")
         (wait)
         (text #:color 7 "【" 0 "】なんだよう・・・お前ら、デートしてるんだろ？")
         (wait)
         (text #:color 5 "【一哉】金もないから、ブラブラしてるだけさ・・・ははは。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 5 "【一哉】俺達も一緒にお茶しようか？")
         (wait)
         (text #:color 7 "【" 0 "】いやだよ・・・俺はそこまで野暮じゃない。")
         (wait)
         (text #:color 5 "【一哉】じゃあ、くるみ・・・俺達は他の場所に行こうぜ。")
         (wait)
         (text #:color 6 "【くるみ】・・・つまんないの。")
         (wait)
         (set-reg: 250 1)
         (set-reg: 175 1)
         (slot 1 2)
         (mes-jump "tim_in.mes")))
       ((== N 3)
        (<>
         (text #:color 5 "【一哉】お前もヒマなんだな・・・。")
         (wait)
         (text #:color 7 "【" 0 "】大きなお世話だよ・・・ふん。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 12) 1) (== (: 14) 1) (== (: 50) 0))
     (<>
      (text #:color 5 "【一哉】あーあ・・・これからどこに行こうかな。")
      (wait)
      (text #:color 6 "【くるみ】一哉君が決めて。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 5 "【一哉】" 0 "、俺達と一緒にデートをするか？")
      (wait)
      (text #:color 7 "【" 0 "】バカな事を言うなよ・・・。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 236) 1) (== (: 10) 0))
     (<>
      (text #:color 5 "【一哉】あ、そうだ・・・忘れないうちに返すぜ。")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃんをか？")
      (wait)
      (text #:color 5 "【一哉】ばっかやろう・・・借りた金を返すと言ってるんだ、ほれ。")
      (wait)
      (text #:color 7 "【" 0 "】土下座して『ありがとうございました』って言ってみろ。")
      (wait)
      (text #:color 5 "【一哉】くるみの前で、俺にそんな事をさせようとするお前は・・・悪魔か？")
      (wait)
      (text #:color 7 "【" 0 "】ははは、冗談だよ・・・ちょっと本気だったけど。")
      (wait)
      (sound 1)
      (set-var I 58)
      (proc 26)
      (set-reg: 835 0)
      (set-var M (+ M 1000))
      (proc 11)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (sound 1)
      (set-var I 23)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 7 "【" 0 "】一哉、お前に貸した金は１０００円だったか？")
      (wait)
      (text #:color 5 "【一哉】" 0 "、男が金の事をグジグジ言うのはよくないな。")
      (wait)
      (text #:color 7 "【" 0 "】あ、そう・・・くるみちゃん、一哉はねブティックの夏子さんという人に・・・。")
      (wait)
      (text #:color 5 "【一哉】わああああっ！！" 0 "君、俺が悪かった・・・ほれ。")
      (wait)
      (sound 1)
      (set-var I 58)
      (proc 26)
      (set-reg: 835 0)
      (set-var M (+ M 9000))
      (proc 11)
      (text #:color 7 "【" 0 "】足りないなあ・・・利子が。")
      (wait)
      (sound 1)
      (set-var I 23)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 5 "【一哉】利子！？・・・ふ、ふざけるな！！")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】最初から素直に返してれば、こんな事にはならなかったのに・・・くるみちゃん、いい事を教えてあげる。")
      (wait)
      (text #:color 6 "【くるみ】・・・なに？")
      (wait)
      (text #:color 5 "【一哉】" 0 "・・・これで勘弁してくれ。")
      (wait)
      (sound 1)
      (set-var I 58)
      (proc 26)
      (set-reg: 835 0)
      (set-var M (+ M 1000))
      (proc 11)
      (text #:color 7 "【" 0 "】ふん・・・まあいいだろう。")
      (wait)
      (sound 1)
      (set-var I 23)
      (proc 26)
      (set-reg: 835 0)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 5 "【一哉】" 0 "、ここで何をしてるんだ？")
      (wait)
      (text #:color 7 "【" 0 "】何をしてるって・・・喫茶店に来ただけだぞ。")
      (wait)
      (text #:color 5 "【一哉】ははあ、誰かと待ち合せか？")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 5 "【一哉】なあ・・・面白くて、楽しくて、それでいてお金が全然かからないデートスポットを知らないか？")
      (wait)
      (text #:color 7 "【" 0 "】あるぜ。")
      (wait)
      (text #:color 5 "【一哉】ど、どこ！？")
      (wait)
      (text #:color 7 "【" 0 "】道端で夫婦漫才をやるんだよ・・・お金がかからないどころか、お金がもうかるかもしれないぜ。")
      (wait)
      (text #:color 6 "【くるみ】きゃきゃきゃっ！！・・・一哉君、やろうか？")
      (wait)
      (text #:color 5 "【一哉】俺と" 0 "を、同じレベルにしないでくれ・・・頼む。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 1))
     (<>
      (text #:color 5 "【一哉】くるみ・・・どこに行こうか？")
      (wait)
      (text #:color 6 "【くるみ】やだあ・・・そういう事は、男の人が決めるのよ。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、だらしないぞ一哉。")
      (wait)))
    ((&& (== V 2) (== N 7) (== (: 13) 0))
     (<>
      (text #:color 6 "【くるみ】ねえねえ、" 0 "さん・・・似合うかしら？")
      (wait)
      (text #:color 7 "【" 0 "】いつも似合ってるよ・・・俺はくるみちゃんの髪型が好きなんだ。")
      (wait)
      (text #:color 6 "【くるみ】髪型じゃなくて・・・一哉君からプレゼントしてもらった服の事よ。")
      (wait)
      (text #:color 7 "【" 0 "】そうだなあ・・・。")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "似合うよ") (text "似合わない") (text "捨てた方がいい")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】似合うな・・・くるみちゃんだけの為に、存在しているような服だ。")
         (wait)
         (text #:color 6 "【くるみ】わーい・・・うれしいなっ！！")
         (wait)
         (set-reg: 112 (+ (: 112) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】うーん・・・くるみちゃんには、ちょっと似合わないな。")
         (wait)
         (text #:color 5 "【一哉】おーーーいっ！！変な事を言うなよ・・・俺がプレゼントした服だぜ。")
         (wait)
         (text #:color 7 "【" 0 "】それがどうかしたか？")
         (wait)
         (text #:color 6 "【くるみ】そんなに・・・似合わないのかなあ？")
         (wait)
         (set-reg: 112 (- (: 112) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】ちっ！！捨てた方がいい程、まったく、全然、似合わないな。")
         (wait)
         (text #:color 5 "【一哉】" 0 "っ！！")
         (wait)
         (text #:color 6 "【くるみ】えーっ！？・・・ショックだわあ。")
         (wait)
         (text #:color 5 "【一哉】嘘、嘘・・・な、" 0 "？")
         (wait)
         (text #:color 7 "【" 0 "】全部本当の事だ・・・明日の朝一番で、ポリバケツに突っ込む事だな。")
         (wait)
         (text #:color 6 "【くるみ】ひっどーい。")
         (wait)
         (set-reg: 112 (- (: 112) 2))))
       (else (<>)))
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 7) (== (: 14) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん、またエッチな話を聞かせてね。")
      (wait)
      (text #:color 5 "【一哉】なんだ、そのエッチな話って？")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃんと、俺様の秘め事だ・・・邪魔するな。")
      (wait)
      (text #:color 6 "【くるみ】きゃきゃきゃっ！！・・・" 0 "さんってね、色々とエッチな話をしてくれるのよ、すっごく面白いの。")
      (wait)
      (text #:color 5 "【一哉】" 0 "・・・変な話をして、くるみを感化しないでくれよ。")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 7) (== (: 14) 1) (== (: 50) 0))
     (<>
      (text #:color 6 "【くるみ】" 0 "さんって・・・どうしてそんなに面白いのかなあ？")
      (wait)
      (text #:color 5 "【一哉】ただのバカだよ。")
      (wait)
      (text #:color 7 "【" 0 "】ありがとう、一哉。")
      (wait)))
    ((&& (== V 2) (== N 7) (== (: 50) 1))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん、今度またエッチな話をしてね。")
      (wait)
      (text #:color 5 "【一哉】" 0 "、変な事を教えるな・・・俺の楽しみがなくなる。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text #:color 5 "【一哉】なんだよ・・・髪の毛に何かついてるか？")
      (wait)
      (text #:color 7 "【" 0 "】髪の毛がついてる。")
      (wait)
      (text #:color 5 "【一哉】・・・。")
      (wait)
      (text #:color 6 "【くるみ】きゃきゃっ！！")
      (wait)
      (text #:color 5 "【一哉】・・・つまらん。")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】一哉・・・いい男だな。")
      (wait)
      (text #:color 5 "【一哉】よせよ、気持ち悪い。")
      (wait)
      (text #:color 7 "【" 0 "】言った俺の身にもなってくれ・・・もっと気持ち悪いぞ。")
      (wait)
      (text #:color 5 "【一哉】だったら言わなきゃいいじゃないか。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】灰色のシャツだな。")
      (wait)
      (text #:color 5 "【一哉】白だよ。")
      (wait)
      (text #:color 7 "【" 0 "】いーや、灰色だ。")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃん、ポコチンの裏側をネクタイって言うの・・・知ってる？")
      (wait)
      (text #:color 6 "【くるみ】えーっ！？・・・どうして、教えて？")
      (wait)
      (text #:color 7 "【" 0 "】一哉のイチモツを見ればいい。")
      (wait)
      (text #:color 6 "【くるみ】やだあ。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<>
      (text #:color 7 "【" 0 "】一哉・・・デートの時ぐらい、制服はやめたらどうだ？")
      (wait)
      (text #:color 5 "【一哉】うるさいな・・・くるみは、俺の制服姿が好きなんだよ。")
      (wait)
      (text #:color 7 "【" 0 "】そうか・・・くるみちゃんは、制服フェチだったのか。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん、フェチってなあに？")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃん、かわいい髪型だね・・・おぢさんは、ゾクゾクしちゃうよ、まったく。")
      (wait)
      (text #:color 5 "【一哉】" 0 "、お前は中年のオヤジか？")
      (wait)
      (text #:color 6 "【くるみ】オヤジって、そんな事を言うの？・・・うちのお父さんも言うのかなあ。")
      (wait)))
    ((&& (== V 1) (== N 9))
     (<>
      (text #:color 7 "【" 0 "】一哉、ちゃんと首筋をぺろぺろしてるか？")
      (wait)
      (text #:color 5 "【一哉】そんな事をしたら、くるみのオヤジさんに殴られちゃうよ。")
      (wait)
      (text #:color 6 "【くるみ】うちのお父さんね・・・私が外から帰ると、全身を調べるようにジロジロと見るの。")
      (wait)))
    ((&& (== V 1) (== N 10))
     (<>
      (text #:color 7 "【" 0 "】黒いリボンだ・・・くるみちゃん、よく似合ってるぜ。")
      (wait)
      (text #:color 6 "【くるみ】ありがとう・・・" 0 "さんに言われると、とってもうれしい。")
      (wait)
      (text #:color 5 "【一哉】俺がほめるのと、" 0 "がほめるのと・・・どっちがうれしい？")
      (wait)
      (text #:color 7 "【" 0 "】一哉、決り切った事を聞くな・・・俺に決ってるじゃないか。")
      (wait)))
    ((&& (== V 1) (== N 11))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃん・・・奇麗な腕をしてるね、ひっひっひっ。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん、またおぢさんごっこをするの？")
      (wait)
      (text #:color 5 "【一哉】またって・・・俺がいない所で、お前ら何をやってるんだ！？")
      (wait)
      (text #:color 7 "【" 0 "】だから・・・おぢさんごっこだよ。")
      (wait)))
    ((&& (== V 1) (== N 12))
     (<>
      (text #:color 7 "【" 0 "】あーあ・・・この身体を一哉が見ているかと思うと、人類なんか滅亡して欲しいと思うなあ。")
      (wait)
      (text #:color 5 "【一哉】オーバーなんだよ・・・それに俺は、くるみの身体を見た事なんかない。")
      (wait)
      (text #:color 6 "【くるみ】一哉君ね、私のお父さんが恐いのよ。")
      (wait)
      (text #:color 7 "【" 0 "】一哉・・・娘の彼氏と父親は戦うしかないんだよ、がんばれ。")
      (wait)))
    ((&& (== V 1) (== N 13))
     (<>
      (text #:color 7 "【" 0 "】（ソバカスがかわいいな・・・。）")
      (wait)
      (text #:color 5 "【一哉】" 0 "、人の彼女の顔をじっと見つめるなよ。")
      (wait)
      (text #:color 7 "【" 0 "】へっ・・・男のヤキモチか？")
      (wait)
      (text #:color 5 "【一哉】お前だけは特別だ・・・先負学園の超危険人物、女の敵だからな。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))