(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\よ
  #\。
  #\や
  #\っ
  #\な
  #\、
  #\だ
  #\ん
  #\で
  #\す
  #\こ
  #\あ
  #\う
  #\し
  #\ま
  #\も
  #\て
  #\ら
  #\か
  #\と
  #\？
  #\れ
  #\の
  #\じ
  #\に
  #\（
  #\が
  #\）
  #\く
  #\る
  #\そ
  #\さ
  #\り
  #\！
  #\ば
  #\ビ
  #\を
  #\触
  #\き
  #\は
  #\ど
  #\見
  #\オ
  #\同
  #\た
  #\デ
  #\わ
  #\め
  #\ゃ
  #\ね
  #\違
  #\ち
  #\せ
  #\お
  #\ン
  #\け
  #\ほ
  #\胸
  #\出
  #\Ｘ
  #\乳
  #\大
  #\私
  #\感
  #\近
  #\本
  #\物
  #\何
  #\首
  #\知
  #\分
  #\身
  #\刺
  #\激)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "u07.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "u07an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "u07.s4" (~ @ 2))
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 54)
 (proc 26)
 (set-reg: 835 0)
 (animate 0 8 0)
 (animate 4 8)
 (set-arr~ @ 7 0)
 (load "u06.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (set-reg: 331 0)
 (if (== (: 617) 1)
   (<>
    (text #:color 6 "【やよい】ね・・・違うでしょ？")
    (wait)
    (text #:color 7 "【" 0 "】（ポコチン立つな・・・ポコチン立つな・・・立たなければ、もっとすごいものが見れそうだ。）")
    (wait)
    (text #:color 6 "【やよい】ほら、ちゃんと見て・・・ビデオやグラビアと違いますよね？")
    (wait)
    (text #:color 7 "【" 0 "】同じだ。")
    (wait)
    (text #:color 6 "【やよい】こんなに近い距離に、本物の胸があるんですよ・・・同じじゃありません。")
    (wait)
    (text #:color 7 "【" 0 "】見てるぶんには・・・同じだ。")
    (wait)
    (text #:color 6 "【やよい】違います。")
    (wait)
    (text #:color 7 "【" 0 "】同じだよ・・・胸ぐらいビデオを見れば出てる。")
    (wait)
    (text #:color 6 "【やよい】" 0 "さん、本物なのよ・・・ちゃんと触れる事ができる本物の胸です。")
    (wait)
    (text #:color 7 "【" 0 "】じゃあ・・・触っていいの？")
    (wait)
    (text #:color 6 "【やよい】そ、それは駄目ですけど。")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】同じだな、やっぱり・・・その証拠に（Ｘ＝Ｘ（Ｙ＋２）、Ｙ＝２（Ｘ＋３）・・・）ほら、ここが（Ｘ＝Ｘ（２（Ｘ＋３）＋２））何の反応もないだろ？")
    (wait)
    (text #:color 6 "【やよい】見てる距離が遠いからそう思うんです・・・もっと近くで見れば、絶対に反応があります。")
    (wait)
    (text #:color 7 "【" 0 "】ないな。")
    (wait)
    (text #:color 6 "【やよい】あります。")
    (wait)
    (text #:color 7 "【" 0 "】絶対にない、ビデオと同じだ・・・ああ、俺は一生インポなんだ、うっうっうっ。")
    (wait)
    (text #:color 6 "【やよい】泣かないで・・・。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "u06.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "u06an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "u06.s4" (~ @ 2))
    (set-arr~ @ 7 0)
    (animate 0 8 0)
    (animate 4 8)
    (text #:color 6 "【やよい】ね、近くで見れば・・・違うでしょ？")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】アップになっても（フジサンロクニオオムナク・・・）胸ぐらいビデオでも（ヒトヨヒトヨニヒトミゴロ）見られる。")
    (wait)
    (text #:color 6 "【やよい】本当に何の反応もないですね・・・かわいそうな" 0 "さん。")
    (wait)
    (text #:color 7 "【" 0 "】（ううっ・・・だ、だめだ、血液が今にも流れ込みそうだあっ！！）")
    (wait)
    (text #:color 6 "【やよい】ほら、こんなに近くで見ても・・・駄目なのかしら？")
    (wait)
    (text #:color 7 "【" 0 "】だめ。")
    (wait)
    (text #:color 6 "【やよい】乳首だって、こんなに・・・ほら。")
    (wait)
    (animate 0 8 0)
    (animate 4 8)
    (text #:color 7 "【" 0 "】だめ・・・全然だめ。")
    (wait)
    (text #:color 6 "【やよい】重傷だわ、何とかしてあげないと・・・かわいそう。")
    (wait)
    (text #:color 7 "【" 0 "】だめ。")
    (wait)
    (text #:color 6 "【やよい】触ってください・・・そうすればビデオと違う事がわかるはずです。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (set-reg: 331 (+ (: 331) 1))
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 50) 0) (text "ビックになる"))
        (if (== (: 50) 1) (text "発射する"))))
      (cond
       ((&& (== N 1) (== (: 16) 0))
        (<> (text #:color 7 "【" 0 "】（まだまだ・・・ぐっと我慢だ。）") (wait) (set-reg: 10 1)))
       ((&& (== N 1) (== (: 16) 1))
        (<>
         (text #:color 7 "【" 0 "】（まだまだまだっ！！・・・ここが我慢のしどころだ。）")
         (wait)
         (set-reg: 10 2)))
       ((&& (== N 1) (== (: 16) 2))
        (<> (text #:color 7 "【" 0 "】（ま、まだだ・・・胸だけじゃ物足りないぜっ。）") (wait)))
       ((&& (== N 2) (== (: 17) 0))
        (<> (text #:color 7 "【" 0 "】（まだまだ・・・出さないぞ。）") (wait) (set-reg: 17 1)))
       ((&& (== N 2) (== (: 17) 1))
        (<> (text #:color 7 "【" 0 "】（いいや・・・まだ出したくない。）") (wait)))
       (else (<>)))))
    ((> (: 331) 14)
     (<>
      (text #:color 6 "【やよい】" 0 "さん・・・ど、どう？")
      (wait)
      (text #:color 7 "【" 0 "】（も、もうだめだあっっっっ！！）")
      (wait)
      (text #:color 6 "ボンッ！！")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "u07.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "u07an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "u07.s4" (~ @ 2))
      (set-arr~ @ 7 0)
      (animate 0 8 0)
      (animate 4 8)
      (set-reg: 50 1)
      (text #:color 6 "【やよい】今の音は・・・何かしら？")
      (wait)
      (text #:color 7 "【" 0 "】（ああ・・・爆発するように、一気に大きくなってしまった。）")
      (wait)
      (text #:color 6 "【やよい】まあ・・・すごい。")
      (wait)
      (text #:color 7 "【" 0 "】（はあ・・・ここまでか。）")
      (wait)
      (text #:color 6 "【やよい】すごいわ・・・りっぱです。")
      (wait)
      (text #:color 6 "【やよい】さあ、ここで出しなさい・・・そうすれば、痛みも取れるはずです。")
      (wait)
      (text #:color 7 "【" 0 "】出すって・・・どうやって？")
      (wait)
      (text #:color 6 "【やよい】やり方を知らないのですか？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "知らない") (text "知ってる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】知らない。")
         (wait)
         (text #:color 6 "【やよい】まあ・・・困ったわ。")
         (wait)
         (text #:color 6 "【やよい】手で、ここを握って・・・そう、それで上下にこするの。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】知ってるけど・・・。")
         (wait)
         (text #:color 6 "【やよい】早く・・・自分の手、握って・・・そう。")
         (wait)))
       (else (<>)))
      (text #:color 7 "【" 0 "】しこしこしこしこ・・・。")
      (wait)
      (text #:color 6 "【やよい】そうよ、上手だわ・・・私の身体を見ながらこすれば、だんだん気持ちよくなってきますから。")
      (wait)
      (text #:color 7 "【" 0 "】しこしこしこしこ・・・だ、駄目だ・・・刺激が足りない。")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "u06.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "u06an.pd8")
      (set-arr~ @ 6 0)
      (set-arr~ @ 7 0)
      (load "u06.s4" (~ @ 2))
      (set-arr~ @ 7 0)
      (animate 0 8 0)
      (animate 4 8)
      (text #:color 6 "【やよい】ほら・・・近くで見なさい。")
      (wait)
      (text #:color 7 "【" 0 "】しこしこしこしこしこ・・・。")
      (wait)
      (text #:color 6 "【やよい】私も自分で・・・乳首を触れば・・・んんっ・・・もっと刺激的ですよね？")
      (wait)
      (text #:color 7 "【" 0 "】しこしこしこ・・・だ、駄目だあ、まだ刺激が足りない。")
      (wait)
      (text #:color 6 "【やよい】精子を出せば、痛みもなくなります・・・がんばって、" 0 "さん。")
      (wait)
      (text #:color 7 "【" 0 "】しこしこしこ・・・も、もっと刺激が欲しい！！")
      (wait)
      (text #:color 6 "【やよい】ど、どうすればいいのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】上半身だけじゃなくて、下半身も見たいっ！！")
      (wait)
      (text #:color 6 "【やよい】か、下半身・・・！？")
      (wait)
      (text #:color 6 "【やよい】わかったわ・・・これでどうかしら？")
      (wait)
      (set-var A 30)
      (proc 12)
      (proc 11)
      (slot 1 7)
      (mes-jump "u08.mes")))
    ((&& (== V 11) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 6 "【やよい】ち、違うでしょ？・・・本物の乳首ですよ。")
      (wait)
      (text #:color 7 "【" 0 "】お、同じだあ。")
      (wait)
      (text #:color 6 "【やよい】ち、違うわよね・・・ビデオでは、こんな事ができません。")
      (wait)
      (text #:color 7 "【" 0 "】お、お、同じだあ。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 11) (== N 1) (== (: 10) 1))
     (<>
      (text #:color 6 "【やよい】ち、乳首が固くなる・・・ん。")
      (wait)
      (text #:color 6 "【やよい】" 0 "さん・・・大きくなりました？")
      (wait)
      (text #:color 7 "【" 0 "】お、同じだあ！！")
      (wait)
      (set-reg: 10 2)))
    ((&& (== V 11) (== N 1) (== (: 10) 2))
     (<>
      (text #:color 6 "【やよい】ビ、ビデオでは・・・ん・・・乳首は固くなりません。")
      (wait)
      (text #:color 7 "【" 0 "】（も、もう我慢できない・・・。）")
      (wait)
      (text #:color 6 "【やよい】ほら・・・こんなに。")
      (wait)
      (set-reg: 10 2)))
    ((&& (== V 11) (== N 1) (== (: 10) 3))
     (<>
      (text #:color 6 "【やよい】あんっ・・・歯を立てたらいけません。")
      (wait)
      (text #:color 7 "【" 0 "】（身体中の血液が・・・ポコチンに流れ込むう！！）")
      (wait)))
    ((&& (== V 10) (== N 2) (== (: 11) 0))
     (<>
      (text #:color 6 "【やよい】んっ・・・。")
      (wait)
      (text #:color 6 "【やよい】乳輪も・・・柔らかいでしょ？")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 10) (== N 2) (== (: 11) 1))
     (<>
      (text #:color 6 "【やよい】" 0 "さん・・・あんっ・・・直りそうですか？")
      (wait)
      (text #:color 7 "【" 0 "】お、同じだあ・・・ビデオと同じだあ。")
      (wait)
      (set-reg: 11 2)))
    ((&& (== V 10) (== N 2) (== (: 11) 2))
     (<> (text #:color 6 "【やよい】んんっ・・・私の方が、変になっちゃいそうです。") (wait)))
    ((&& (== V 9) (== N 3) (== (: 12) 0))
     (<>
      (text #:color 6 "【やよい】ね・・・ビデオじゃ触れないですから・・・んんっ・・・感じません？")
      (wait)
      (text #:color 7 "【" 0 "】ビ、ビ、ビデオと・・・同じだあ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 9) (== N 3) (== (: 12) 1))
     (<>
      (text #:color 6 "【やよい】んあ・・・ど、どうですか？")
      (wait)
      (text #:color 7 "【" 0 "】な、何も感じない・・・だめだあ。")
      (wait)
      (text #:color 6 "【やよい】もっと・・・もっと触ればきっとよくなります。")
      (wait)
      (set-reg: 12 2)))
    ((&& (== V 9) (== N 3) (== (: 12) 2))
     (<>
      (text #:color 6 "【やよい】あは・・・んん・・・どうですか？")
      (wait)
      (text #:color 7 "【" 0 "】お、お、大きくならない・・・。")
      (wait)
      (text #:color 6 "【やよい】もっと強くもめば・・・んっ・・・きっと大きく・・・あっ・・・なります。")
      (wait)
      (set-reg: 12 3)))
    ((&& (== V 9) (== N 3) (== (: 12) 3))
     (<>
      (text #:color 6 "【やよい】あっ・・・あっ・・・ん。")
      (wait)
      (text #:color 7 "【" 0 "】（なんて大きな胸なんだ・・・。）")
      (wait)))
    ((&& (== V 8) (== N 4) (== (: 13) 0))
     (<>
      (text #:color 6 "【やよい】そうです・・・私を彼女だと思って・・・ん。")
      (wait)
      (text #:color 6 "【やよい】あ・・・どうかしら・・・変化はありました？")
      (wait)
      (text #:color 7 "【" 0 "】（も、もう・・・だめだ。）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 8) (== N 4) (== (: 13) 1))
     (<>
      (text #:color 6 "【やよい】そう・・・女性の肌に触れば、" 0 "さんのここだって・・・ああっ・・・きっと元に戻ります。")
      (wait)
      (text #:color 6 "【やよい】あっ・・・いや・・・" 0 "さん、感じてますか？")
      (wait)
      (set-reg: 13 2)))
    ((&& (== V 8) (== N 4) (== (: 13) 1))
     (<>
      (text #:color 6 "【やよい】んっ・・・もっと触れば・・・きっと・・・んん。")
      (wait)
      (set-reg: 13 2)))
    ((&& (== V 8) (== N 4) (== (: 13) 2))
     (<>
      (text #:color 6 "【やよい】ああ・・・そう・・・もっと触って・・・色々な所を・・・。")
      (wait)
      (set-reg: 13 3)))
    ((&& (== V 8) (== N 4) (== (: 13) 3))
     (<>
      (text #:color 6 "【やよい】" 0 "さん・・・私にまかせてくれれば・・・絶対に大丈夫ですから・・・んんっ。")
      (wait)))
    ((&& (== V 8) (== N 5) (== (: 14) 0))
     (<>
      (text #:color 6 "【やよい】" 0 "さん・・・手を触って・・・感じます？")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 8) (== N 5) (== (: 14) 1))
     (<> (text #:color 6 "【やよい】" 0 "さん・・・触るなら、もっと刺激的な所を触った方がいいですよ。") (wait)))
    ((&& (== V 8) (== N 6) (== (: 15) 0))
     (<>
      (text #:color 6 "【やよい】ああ・・・優しくしないでいいから・・・自分が元気になる事だを考えて・・・。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 8) (== N 6) (== (: 15) 1))
     (<>
      (text #:color 6 "【やよい】" 0 "さん・・・私が感じても仕方がないですから・・・自分の好きな部分を触ってください。")
      (wait)
      (set-reg: 15 2)))
    ((&& (== V 8) (== N 6) (== (: 15) 2))
     (<> (text #:color 6 "【やよい】" 0 "さんは・・・髪を触ると感じるのですか？") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))