(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\い
  #\舞
  #\て
  #\に
  #\な
  #\っ
  #\の
  #\た
  #\、
  #\君
  #\か
  #\う
  #\と
  #\れ
  #\ん
  #\を
  #\で
  #\ら
  #\く
  #\も
  #\る
  #\ち
  #\私
  #\し
  #\ゃ
  #\こ
  #\二
  #\が
  #\健
  #\は
  #\？
  #\わ
  #\行
  #\（
  #\）
  #\だ
  #\話
  #\ホ
  #\テ
  #\ル
  #\そ
  #\じ
  #\帰
  #\え
  #\や
  #\お
  #\事
  #\パ
  #\言
  #\き
  #\あ
  #\俺
  #\よ
  #\何
  #\人
  #\信
  #\部
  #\屋
  #\ど
  #\会
  #\ま
  #\中
  #\一
  #\思
  #\す
  #\考
  #\時
  #\見
  #\ー)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "12.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "v05.pd8")
 (proc 16)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 24)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "w.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 772) 0)
   (<>
    (text #:color 7 "【" 0 "】あれ・・・。")
    (wait)
    (text #:color 7 "【" 0 "】まさか・・・。")
    (wait)
    (text #:color 7 "【" 0 "】舞ちゃん！？")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "12.pd8")
    (proc 15)
    (set-arr~ @ 6 1)
    (image "w.pd8")
    (proc 16)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "wan.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "w.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 24)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 3 "【舞】" 0 "君・・・。")
    (wait)
    (set-reg: 772 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "中に入る") (text "他の場所に行く") (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<> (text #:color 3 "【舞】お願い・・・帰らないで。") (wait)))
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】舞ちゃん・・・俺の部屋においで。")
         (wait)
         (text #:color 3 "【舞】うん・・・。")
         (wait)
         (slot 1 6)
         (mes-jump "v03.mes")))
       ((&& (== N 2) (== (: 50) 0))
        (<> (text #:color 3 "【舞】お願い・・・私の話を聞いて。") (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<>
         (text #:color 3 "【舞】" 0 "君、どこに行くの？")
         (wait)
         (text #:color 7 "【" 0 "】どこにも行かないさ・・・俺は舞ちゃんと一緒にいるよ。")
         (wait)))
       ((&& (== N 3) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（とにかく・・・舞ちゃんの話を聞こう。）") (wait)))
       ((&& (== N 3) (== (: 50) 1))
        (<> (text #:color 7 "【" 0 "】（早く部屋に戻ろうぜ・・・。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 3 "【舞】" 0 "君・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】誤解しないで・・・お願い。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】健二君とは・・・何もないの。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 10) 1))
     (<>
      (text #:color 3 "【舞】" 0 "君と一緒に遊園地に行った事が、秘書の口からパパに伝わって・・・私、外出禁止になってたの。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】しばらく誰とも会わせてくれなかったんだけど、健二君がパパに頼まれて・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ホテルに行ったの？")
      (wait)
      (text #:color 3 "【舞】違うの・・・健二君がパパに頼まれて、変な男から私を守って欲しいって言われたの。")
      (wait)
      (text #:color 3 "【舞】健二君と一緒なら、外出も許してくれるって言うから・・・私、" 0 "君に会いたくて。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】途中で健二君と別れて・・・" 0 "君に会いに行こうと思ってたの。")
      (wait)
      (text #:color 7 "【" 0 "】俺に・・・会いに？")
      (wait)
      (text #:color 3 "【舞】ええ・・・。")
      (wait)
      (set-reg: 10 2)))
    ((&& (== V 2) (== N 1) (== (: 10) 2))
     (<>
      (text #:color 3 "【舞】健二君と食事をするってパパに言って・・・健二君が車で迎えに来て。")
      (wait)
      (text #:color 3 "【舞】" 0 "君の家の近くで、降ろしてもらおうと思ったら・・・健二君、私の考えに気づいちゃって。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】それで健二君、怒って、いきなりホテルの駐車場に車を・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（健二のやつ・・・何があきらめろだ！？）")
      (wait)
      (set-reg: 10 3)))
    ((&& (== V 2) (== N 1) (== (: 10) 3))
     (<>
      (text #:color 3 "【舞】健二君、私を力ずくでホテルの中に入れようとして・・・私、大声を上げて抵抗したの。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】健二君、驚いちゃって・・・それでも、私をホテルの中に入れようと説得するの。")
      (wait)
      (text #:color 7 "【" 0 "】そこに俺が偶然来たって事か・・・。")
      (wait)
      (text
       #:color
       3
       "【舞】私、心臓が止まるかと思った・・・悪い事は何もしてないのに、会いたい人が目の前にいるのに・・・目を合わせる事ができなかった。")
      (wait)
      (text #:color 7 "【" 0 "】だったら・・・どうしてあの時、何も言ってくれなかったんだ？")
      (wait)
      (text #:color 3 "【舞】" 0 "君、私が何を言っても・・・きっと、信じてくれなかったわ。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "信じた") (text "信じない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】信じたさ・・・舞ちゃんが言う事だったら。")
         (wait)
         (text #:color 3 "【舞】私は・・・そうは思わなかったの。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 3 "【舞】他の男の人とホテルにいる所を見られて・・・何もないなんて、絶対に信じてくれないもの。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】確かに信じなかったかもしれない・・・。")
         (wait)
         (text #:color 3 "【舞】それが普通だと思う・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 3 "【舞】他の男の人とホテルにいる所を見られて・・・何もないなんて、絶対に信じてくれないもの。")
         (wait)))
       (else (<>)))
      (set-reg: 10 5)))
    ((&& (== V 2) (== N 1) (== (: 10) 5))
     (<>
      (text #:color 3 "【舞】" 0 "君、帰っちゃったあと、健二君も冷静になってくれて・・・私を家まで送ってくれたわ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text
       #:color
       3
       "【舞】健二君、"
       0
       "君と決着をつけるとか言ってた・・・でも私の気持ちなんて、健二君は全然考えてくれないの。")
      (wait)
      (text #:color 7 "【" 0 "】私の気持ち？")
      (wait)
      (text #:color 3 "【舞】他の男の人が私を好きになってくれても・・・私の好きな人は一人だけ。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・あなたなのよ。")
      (wait)
      (set-reg: 10 6)))
    ((&& (== V 2) (== N 1) (== (: 10) 6))
     (<>
      (text #:color 3 "【舞】私・・・逃げて来たの。")
      (wait)
      (text #:color 7 "【" 0 "】え！？")
      (wait)
      (text
       #:color
       3
       "【舞】外出禁止になってから、お稽古も車で通うようになって・・・"
       0
       "君に合う為には、お稽古の途中で逃げ出すしかなかった。")
      (wait)
      (text #:color 7 "【" 0 "】いつから・・・ここに？")
      (wait)
      (text #:color 3 "【舞】９時頃から、ここで待ってた。")
      (wait)
      (set-reg: 10 7)))
    ((&& (== V 2) (== N 1) (== (: 10) 7))
     (<>
      (text #:color 3 "【舞】" 0 "君・・・私、家に帰れない。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】そんな顔をしないで・・・。")
      (wait)
      (text #:color 7 "【" 0 "】でも・・・。")
      (wait)
      (text #:color 3 "【舞】明日になったら、ちゃんと帰るつもり・・・でも今日は帰りたくない。")
      (wait)
      (text #:color 7 "【" 0 "】（ど、どうする・・・" 0 "？）")
      (wait)
      (set-reg: 10 8)))
    ((&& (== V 2) (== N 1) (== (: 10) 8))
     (<>
      (cond
       ((== (: 11) 0)
        (<>
         (text #:color 3 "【舞】" 0 "君・・・一緒にいて欲しい。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・。")
         (wait)))
       ((== (: 11) 1)
        (<>
         (text #:color 3 "【舞】お願い・・・" 0 "君。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 12) 0) (text "ホテルに行こう"))
        (if (== (: 13) 0) (text "公園で話そう"))
        (if (== (: 14) 0) (text "喫茶店に行こう"))
        (text "部屋に行こう")
        (text "帰った方がいい")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・これからホテルに行かないか？")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・ホテルはいやなの。")
         (wait)
         (set-reg: 12 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・公園で話をして、夜を明かそう。")
         (wait)
         (text #:color 3 "【舞】いや・・・" 0 "君と二人きりでいたい。")
         (wait)
         (set-reg: 13 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】わかった・・・これから喫茶店で話をしよう。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・こんな時間にやってないわ。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そうか。")
         (wait)
         (set-reg: 14 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】舞ちゃん・・・俺の部屋に来ないか？")
         (wait)
         (text #:color 3 "【舞】うん・・・行きたい。")
         (wait)
         (set-reg: 10 9)))
       ((&& (== N 5) (== (: 15) 0))
        (<>
         (text #:color 7 "【" 0 "】舞ちゃん・・・帰った方がいい。")
         (wait)
         (text #:color 3 "【舞】いや・・・今日は絶対に帰らない。")
         (wait)
         (set-reg: 15 1)))
       ((&& (== N 5) (== (: 15) 1))
        (<>
         (text #:color 3 "【舞】帰れなんて言わないで・・・。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 11 1)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 10) 9))
     (<> (text #:color 3 "【舞】早く・・・" 0 "君の部屋に連れていって。") (wait)))
    ((== (: 50) 1)
     (<>
      (text #:color 3 "【舞】" 0 "君・・・誰かに見られたくない。")
      (wait)
      (text #:color 7 "【" 0 "】わかった、俺の部屋に行こう。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<> (text #:color 7 "【" 0 "】（髪を見てる場合じゃないな・・・舞ちゃんと話そう。）") (wait)))
    ((&& (== V 1) (== N 3))
     (<> (text #:color 7 "【" 0 "】（リボンをとは話せない・・・舞ちゃんと話をするんだ。）") (wait)))
    ((&& (== V 1) (== N 4))
     (<> (text #:color 7 "【" 0 "】（俺の目をじっと見てる・・・ホテルで会った時とは違うな。）") (wait)))
    ((&& (== V 1) (== N 5))
     (<> (text #:color 7 "【" 0 "】（いやらしい事を考えてる場合じゃないだろ？）") (wait)))
    ((&& (== V 1) (== N 6))
     (<> (text #:color 7 "【" 0 "】（いやらしい事を考えるのは、舞ちゃんとの話が終ったあとだ。）") (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（我慢だ、" 0 "君・・・舞ちゃんと話をしよう。）")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】（考えてみれば、こんな時間にセーラー服でいるなんて・・・ちょっと変だぜ。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))