(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\い
  #\。
  #\な
  #\の
  #\舞
  #\っ
  #\ん
  #\、
  #\だ
  #\て
  #\か
  #\う
  #\し
  #\に
  #\る
  #\は
  #\た
  #\が
  #\わ
  #\ら
  #\ゃ
  #\れ
  #\そ
  #\も
  #\あ
  #\ち
  #\と
  #\よ
  #\？
  #\で
  #\く
  #\言
  #\け
  #\さ
  #\（
  #\）
  #\君
  #\じ
  #\！
  #\ね
  #\ぜ
  #\ー
  #\を
  #\す
  #\私
  #\事
  #\り
  #\子
  #\ど
  #\み
  #\ま
  #\お
  #\こ
  #\思
  #\き
  #\園
  #\俺
  #\ば
  #\え
  #\変
  #\達
  #\パ
  #\遊
  #\生
  #\見
  #\め
  #\ラ
  #\地
  #\人
  #\目
  #\つ
  #\外
  #\オ
  #\や
  #\気
  #\意
  #\ぎ
  #\分
  #\誰
  #\何
  #\特
  #\別
  #\馬
  #\鹿
  #\自
  #\女
  #\フ
  #\ろ
  #\ス
  #\走
  #\通
  #\来
  #\日
  #\持
  #\友
  #\聞
  #\識
  #\金
  #\男
  #\ぶ
  #\ェ
  #\娘
  #\家
  #\歩
  #\ン)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "v12.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "v12an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "v12.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 24)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "v12.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (set-reg: 331 0)
 (if (== (: 762) 1)
   (<>
    (text #:color 3 "【舞】はあはあ・・・ああ、おもしろかった。")
    (wait)
    (text #:color 7 "【" 0 "】ふうふう・・・な、なにが？")
    (wait)
    (text #:color 3 "【舞】だってパパの秘書ったら・・・タイトスカートで走ろうとするから、転びそうになっちゃって。")
    (wait)
    (text #:color 7 "【" 0 "】ははは・・・内股だったぞ。")
    (wait)
    (text #:color 3 "【舞】あはははっ。")
    (wait)
    (text #:color 7 "【" 0 "】しかしびっくりしたなあ・・・舞ちゃんのパパがこの遊園地のオーナーだったんだ。")
    (wait)
    (text #:color 3 "【舞】私・・・学校の誰にも言ってないの。")
    (wait)
    (text #:color 7 "【" 0 "】どうして？")
    (wait)
    (text #:color 3 "【舞】だって・・・いやなんですもの。")
    (wait)
    (text #:color 7 "【" 0 "】そうかな、俺なんか・・・。")
    (wait)
    (set-reg: 101 1)
    (set-arr~ @ 7 0)
    (proc 18)
    (menu-show
     (<.> (text "うらやましい") (text "驚いた") (text "ねたましい") (text "何とも思わない")))
    (if (== N 1)
      (<>
       (text #:color 7 "【" 0 "】俺なんか、うらやましいと思うけど・・・。")
       (wait)
       (text #:color 3 "【舞】・・・。")
       (wait)
       (text #:color 3 "【舞】うらやましいだけなら・・・いいんだけど。")
       (wait)))
    (if (== N 2)
      (<>
       (text #:color 7 "【" 0 "】俺なんか、驚くばかりだぜ。")
       (wait)
       (text #:color 3 "【舞】驚くだけだったら、まだいいのよ・・・。")
       (wait)))
    (if (== N 3)
      (<>
       (text #:color 7 "【" 0 "】俺なんか・・・ねたましく思うな。")
       (wait)
       (text #:color 3 "【舞】・・・。")
       (wait)
       (text #:color 3 "【舞】そうよね、それが普通だと思うわ・・・。")
       (wait)
       (set-reg: 111 (- (: 111) 1))))
    (if (== N 4)
      (<>
       (text #:color 7 "【" 0 "】俺なんか・・・何とも思わないけど。")
       (wait)
       (text #:color 3 "【舞】・・・。")
       (wait)
       (text #:color 3 "【舞】私・・・" 0 "君のそういう所が好きなのよ。")
       (wait)
       (set-reg: 111 (+ (: 111) 1))))
    (text #:color 7 "【" 0 "】（うーん・・・舞ちゃんって、ただのお嬢様じゃないような？）")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<> (text "走る")))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 3 "【舞】" 0 "君、もうパパの秘書は追って来ないみたい・・・走らなくても大丈夫よ。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 3 "【舞】" 0 "君・・・もしかして、走りたいの？")
         (wait)
         (text #:color 7 "【" 0 "】いいや、走りたくない・・・疲れるだけだ。")
         (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 3 "【舞】小学校の頃にね、私の誕生日の日にパパとママに連れられて・・・この遊園地に来たの。")
      (wait)
      (text #:color 7 "【" 0 "】そう言えば、舞ちゃんの誕生日って・・・何月だっけ？")
      (wait)
      (text #:color 3 "【舞】１２月・・・その日も、すごく寒かったのを覚えてるわ。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 3 "【舞】回りには、いっぱいお付きの人達がいて・・・私達だけ、乗物に乗る時に並ばなくていいのよ。")
      (wait)
      (text #:color 7 "【" 0 "】そりゃそうだ・・・ここの持主だもんな。")
      (wait)
      (text #:color 3 "【舞】そうしたら、並んでる人達の中に・・・同級生がいて。")
      (wait)
      (text #:color 7 "【" 0 "】あらら・・・。")
      (wait)
      (text #:color 3 "【舞】それからだわ・・・友達が私を特別な目で見るようになったのは。")
      (wait)
      (text #:color 7 "【" 0 "】それって・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いじめられた") (text "尊敬された") (text "特別な目だった")))
      (cond
       ((== N 1)
        (<>
         (text #:color 3 "【舞】いじめられたって事？")
         (wait)
         (text #:color 3 "【舞】ううん、いじめられたと言うより・・・私と間隔をおくようになった感じかしら。")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・なんとなくわかるぜ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】尊敬されたって事？")
         (wait)
         (text
          #:color
          3
          "【舞】尊敬されたって言うか・・・今まで平気でふざけあってた友達が、私と間隔をおくようになった感じかしら？")
         (wait)
         (text #:color 7 "【" 0 "】うーん・・・なんとなくわかるぜ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】それって・・・特別な目って事？")
         (wait)
         (text #:color 3 "【舞】え？")
         (wait)
         (text #:color 7 "【" 0 "】だからあ、目が特別って事でしょ？")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・私の話、真面目に聞いてないでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】そ、そんな事はないさあ。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 3 "【舞】それ以来・・・遊園地が嫌いになったの。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん、色々とあるもんだな。")
      (wait)
      (text #:color 3 "【舞】先負学園の友達にも言ってないのよ・・・だから" 0 "君、誰にも言わないで。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "言う") (text "言わない") (text "内緒で言う")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】言うよ俺は・・・おしゃべりだから。")
         (wait)
         (text #:color 3 "【舞】もし誰かに喋ったら・・・" 0 "君とは口を聞かないわ。")
         (wait)
         (text #:color 7 "【" 0 "】（うーん、子供の頃の体験って・・・残るんだよなあ。）")
         (wait)
         (text #:color 3 "【舞】本当に口を聞かないんだからね。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】言わないさ・・・誰にもね。")
         (wait)
         (text #:color 3 "【舞】私がお願いしなくても、" 0 "君が言うはずがない・・・聞いた私が馬鹿だったわ。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】舞ちゃんには内緒だけど・・・みんなには言うよ。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、冗談で言ってるのよね？")
         (wait)
         (text #:color 7 "【" 0 "】そうだね、冗談だ・・・と思う。")
         (wait)
         (text #:color 3 "【舞】もう・・・。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       (else (<>)))
      (text #:color 7 "【" 0 "】舞ちゃんか、遊園地が嫌いって言った理由が・・・やっとわかったよ。")
      (wait)
      (text #:color 3 "【舞】私ね、いつも疎外感があるの・・・みんなが私を特別な目で見てるって。")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃん、それは・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "意識しすぎだ") (text "その通りだ") (text "馬鹿じゃないの")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】意識しすぎだと思うぜ・・・みんな、舞ちゃんを特別な目で見てないさ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】その通りだ・・・舞ちゃんは疎外されてるもんな。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】あ、嘘っ！！嘘っ！！・・・意識しすぎだよ、舞ちゃん。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】舞ちゃん、馬鹿じゃないの！？")
         (wait)
         (text #:color 3 "【舞】馬鹿って・・・どうして？")
         (wait)
         (text #:color 7 "【" 0 "】それってさ・・・自分が金持ちだって事を意識してるから、そんな考え方になるんだぜ。")
         (wait)
         (text #:color 3 "【舞】そ、そんな事はないわ。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】そうなのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】うんうん、きっとそうだ。")
         (wait)
         (text #:color 3 "【舞】ぷっ！！")
         (wait)
         (text #:color 7 "【" 0 "】はあ？")
         (wait)
         (text #:color 3 "【舞】あははっ！！・・・人から馬鹿って言われたの初めて。")
         (wait)
         (text #:color 7 "【" 0 "】とにかく舞ちゃんは、考えすぎの意識しすぎだぜ・・・もっと楽しい事だけを考えればいいんだ。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       (else (<>)))
      (text #:color 3 "【舞】確かにそうかもしれないけど・・・" 0 "君と健二くらいなのよ、私に気軽に話しかけてくれる人って。")
      (wait)
      (text #:color 7 "【" 0 "】女の子は？")
      (wait)
      (text #:color 3 "【舞】女の子は・・・ほとんどの子が、気軽に話しかけてくれる。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】だったら答えは出てるじゃない・・・男どもが気軽に話しかけないのは、ただ単に舞ちゃんがかわいすぎるからさ。")
      (wait)
      (text #:color 3 "【舞】かわいい子だったらたくさんいるわよ・・・美穂ちゃんとか、美沙ちゃんとか。")
      (wait)
      (text #:color 7 "【" 0 "】美穂に美沙は・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "ぶすぶすっ") (text "確かにかわいい") (text "身体だけ") (text "フェラが上手")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】ぶすぶすっ！！あいつらなんか、動物園で暮らせばいいんだ。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】" 0 "君、友達を悪く言わないで。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】言われてみれば・・・確かにかわいいかな？")
         (wait)
         (text #:color 3 "【舞】でしょう？")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】あいつらがかわいいのは、身体だけさ！！")
         (wait)
         (text #:color 3 "【舞】身体がかわいいって・・・どういう意味なの？")
         (wait)
         (text #:color 7 "【" 0 "】ようするに、セックス以外には存在してる価値がないって事だ。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・友達なんだから、悪く言わないで。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】フェラが上手なだけさ、あいつらは。")
         (wait)
         (text #:color 3 "【舞】フェラ？")
         (wait)
         (text #:color 7 "【" 0 "】舞ちゃん、フェラチオって言ってごらん？")
         (wait)
         (text #:color 3 "【舞】フェラチオ。")
         (wait)
         (text #:color 7 "【" 0 "】も、もう一度・・・言ってくれ。")
         (wait)
         (text #:color 3 "【舞】なんか・・・変だわ。")
         (wait)))
       (else (<>)))
      (set-reg: 11 2)))
    ((&& (== V 2) (== N 1) (== (: 11) 2))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんって、かわいいと思うぜ・・・男子生徒のあこがれだもんな。")
      (wait)
      (text #:color 3 "【舞】私が・・・お金持ちの娘じゃなくてもそう思ってくれるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃんがお金持ちじゃなかったら・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "相手にしない") (text "変わらない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】誰も相手にしない・・・あわわわわっ！！")
         (wait)
         (text #:color 3 "【舞】" 0 "君、なんて言ったの？")
         (wait)
         (text #:color 7 "【" 0 "】な、なんでもない・・・はっはっはっ！！")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】変わらないさ・・・何もね。")
         (wait)
         (text #:color 3 "【舞】そうだといいけど・・・。")
         (wait)))
       (else (<>)))
      (set-reg: 11 3)))
    ((&& (== V 2) (== N 1) (== (: 11) 3))
     (<>
      (text #:color 7 "【" 0 "】あのさあ、俺達はまだ１８歳だぜ・・・中年のオヤジじゃあるまいし、お金で女の子が好きなると思う？")
      (wait)
      (text #:color 3 "【舞】そうよね・・・" 0 "君の言う通りだと思う。")
      (wait)
      (text #:color 7 "【" 0 "】それにさ、舞ちゃんがかわいいのは外見だけじゃないから・・・みんなのあこがれなんだぜ。")
      (wait)
      (text #:color 3 "【舞】自分ではわからないもの。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ俺が説明してあげよう。舞ちゃんがかわいいのは、外見だけじゃなくて・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "脳みそ") (text "胸") (text "お尻") (text "性格") (text "しぐさ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】脳みそがかわいいんだ。")
         (wait)
         (text #:color 3 "【舞】脳みそがかわいいって・・・それじゃあ、馬鹿みたいだわ。")
         (wait)
         (text #:color 7 "【" 0 "】そうだね、何か違うな・・・。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】胸がかわいいんだ。")
         (wait)
         (text #:color 3 "【舞】ごめんね、小さくて・・・。")
         (wait)
         (text #:color 7 "【" 0 "】あれれ・・・なんか変だな。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】お尻がかわいいんだ。")
         (wait)
         (text #:color 3 "【舞】それって、外見じゃないのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】そうだよな・・・なんか変だぜ。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】性格がかわいいから・・・みんなあこがれるのさ。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】うれしいな・・・そう言われると。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】しぐさがかわいいから・・・みんなあこがれるのさ。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】しぐさって言われても・・・自分ではわからないわ。")
         (wait)))
       (else (<>)))
      (text
       #:color
       7
       "【"
       0
       "】とにかく、舞ちゃんは外見だけじゃないよ・・・これは先負学園男子生徒を代表して言ってるつもりだぜ。")
      (wait)
      (set-reg: 11 4)))
    ((&& (== V 2) (== N 1) (== (: 11) 4))
     (<>
      (text #:color 3 "【舞】でもね、本当の事を言うと・・・他の男の子達の事はいいの。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 3 "【舞】" 0 "君は、私のパパがこの遊園地のオーナーだってわかって・・・変わっちゃうのかしら？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "変わらない") (text "変わる")))
      (cond
       ((== N 1)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】変わらないさ・・・舞ちゃんが遊園地のオーナーの娘でも、アラブの石油王の娘でも、総理大臣の娘でもね。")
         (wait)
         (text #:color 3 "【舞】よかった・・・。")
         (wait)
         (set-reg: 111 (+ (: 111) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ変わるさ・・・なんたって、こんな大きな遊園地のオーナーの娘だもんな。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】遊園地に・・・来なければよかった。")
         (wait)
         (text #:color 7 "【" 0 "】なーんちゃって、嘘だってばっ！！")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (set-reg: 111 (- (: 111) 2))))
       (else (<>)))
      (set-reg: 11 5)))
    ((&& (== V 2) (== N 1) (== (: 11) 5))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】舞ちゃん、気にしないほうがいいぜ・・・お金持ちの家に生まれるのも、そうじゃない家に生まれるのも運命なんだから。")
      (wait)
      (text #:color 3 "【舞】ええ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】生まれて来る時に、自分で選べないだろ？")
      (wait)
      (text #:color 3 "【舞】そうよね・・・。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】舞ちゃんみたいに大きな家に住んでる人もいれば、普通の家に住んでる人もいるし、俺みたいに一人暮ししているやつだっているんだぜ。")
      (wait)
      (text #:color 3 "【舞】" 0 "君は・・・一人暮しなのよね。")
      (wait)
      (text #:color 7 "【" 0 "】そうだぜ・・・でも俺は毎日が楽しいし、いじけたりしてないぜ。")
      (wait)
      (text #:color 3 "【舞】" 0 "君って、いつも元気だから。")
      (wait)
      (text #:color 7 "【" 0 "】自分が生まれた家の事は、どうする事もできないけどさ・・・それ以外の部分って自分次第だろ？")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】運命は現実として受け止めてさ・・・あとはいかに、明るく楽しい事を考えられるかって事だな、うん。")
      (wait)
      (text #:color 3 "【舞】" 0 "君って・・・すごいわ。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ、だてに１８年間生きてないぜ。")
      (wait)
      (text #:color 3 "【舞】私、感動しちゃった・・・。")
      (wait)
      (set-reg: 11 6)))
    ((&& (== V 2) (== N 1) (== (: 11) 6))
     (<>
      (text #:color 3 "【舞】あのね、私達のクラスで" 0 "君の事を好きな女の子がいるの・・・名前は聞かないでね？")
      (wait)
      (text #:color 7 "【" 0 "】ちぇっ・・・。")
      (wait)
      (text #:color 3 "【舞】その女の子が言ってたの・・・" 0 "君には、他の男の子にはない魅力があるって。")
      (wait)
      (text #:color 7 "【" 0 "】うーん、その子は偉い。")
      (wait)
      (text #:color 3 "【舞】私・・・その子の言葉の意味が、わかったような気がする。")
      (wait)
      (set-reg: 111 (+ (: 111) 1))
      (set-reg: 11 7)))
    ((&& (== V 2) (== N 1) (== (: 11) 7))
     (<>
      (text #:color 7 "【" 0 "】なんか・・・だいぶ歩いてるぜ。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、もう少しよ・・・ほら。")
      (wait)
      (set-var A 30)
      (proc 12)
      (proc 11)
      (slot 1 6)
      (mes-jump "yuench6.mes")))
    ((&& (== V 1) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】（ああ、こんな近くで舞ちゃんに見つめられると・・・思わず抱きしめたくなるなあ。）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】（澄んだ目だよな・・・キラキラしているぜ。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】（あと３０センチ、舞ちゃんの顔に近づけば・・・キスしてる事になるな。）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】（かわいい顔だ・・・誰にも舞ちゃんを奪われたくない。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（黄色いリボンだ・・・舞ちゃんに似合ってる。）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 4) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】（黄色が好きな女の子って、子供っぽいって言うけど・・・本当かな？）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんと、二人で歩くなんて・・・夢のようだな。）")
      (wait)
      (text #:color 7 "【" 0 "】（まさか、夢じゃないだろうな・・・ためしにタマキンを握ってみるか。）")
      (wait)
      (text #:color 6 "ぎゅうっ！！")
      (wait)
      (text #:color 7 "【" 0 "】（・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（ゆ、夢じゃなあい・・・。）")
      (wait)
      (text #:color 3 "【舞】" 0 "君、どうしたの？・・・なんだか歩き方が変よ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 5) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・舞ちゃんとツーショットだぜ。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 16) 0))
     (<> (text #:color 7 "【" 0 "】（悪いな・・・俺様の肩だ。）") (wait) (set-reg: 16 1)))
    ((&& (== V 1) (== N 6) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（だからあ、これは『俺』の肩だよ。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（遊園地の中心へと続く遊歩道だ・・・レンガが敷き詰められている。）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 7) (== (: 17) 1))
     (<>
      (text #:color 7 "【" 0 "】（下ばかり見てると、舞ちゃんに変に思われるぞ。）")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・何か落としたの？")
      (wait)
      (text #:color 7 "【" 0 "】（ほら・・・ね。）")
      (wait)
      (set-reg: 17 2)))
    ((&& (== V 1) (== N 7) (== (: 17) 2))
     (<> (text #:color 7 "【" 0 "】（だからあ・・・下を見るのはよそうってば。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】（歩くたびに舞ちゃんの髪の毛が揺れる・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（シャンプーの香りが・・・鼻をくすぐるぜ。）")
      (wait)
      (set-reg: 18 1)))
    ((&& (== V 1) (== N 8) (== (: 18) 1))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの髪は・・・グラスファイバーのように細い。）")
      (wait)
      (text #:color 7 "【" 0 "】（ちょっと、たとえが悪かったな・・・反省しよう。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))