(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\る
  #\。
  #\く
  #\い
  #\な
  #\ん
  #\み
  #\う
  #\て
  #\っ
  #\、
  #\だ
  #\の
  #\た
  #\か
  #\そ
  #\あ
  #\し
  #\に
  #\は
  #\も
  #\ゃ
  #\さ
  #\？
  #\ち
  #\が
  #\こ
  #\で
  #\ら
  #\を
  #\よ
  #\ど
  #\と
  #\一
  #\き
  #\れ
  #\ま
  #\ぜ
  #\０
  #\け
  #\事
  #\哉
  #\行
  #\（
  #\）
  #\話
  #\ね
  #\じ
  #\ー
  #\君
  #\お
  #\俺
  #\わ
  #\す
  #\え
  #\園
  #\私
  #\ょ
  #\ば
  #\言
  #\ラ
  #\り
  #\回
  #\や
  #\変
  #\公
  #\聞
  #\隠
  #\好
  #\気
  #\歩
  #\つ
  #\電
  #\場
  #\所
  #\何
  #\生)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "01.pd8")
 (proc 15)
 (set-arr~ @ 6 1)
 (image "q.pd8")
 (proc 16)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "qan.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "q.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 23)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "q.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 502) 0)
   (<>
    (text #:color 7 "【" 0 "】あれれっ！！・・・くるみちゃんじゃないか。")
    (wait)
    (text #:color 6 "【くるみ】" 0 "・・・さん。")
    (wait)
    (text #:color 7 "【" 0 "】（うーん・・・ますます元気がないなあ。）")
    (wait)
    (text #:color 7 "【" 0 "】くるみちゃん、矢吹町をセーラー服姿で歩くなんて危ないぜ・・・俺みたいなやつがウヨウヨいるんだから。")
    (wait)
    (text #:color 6 "【くるみ】矢吹町に来るつもりはなかったんだけど・・・考え事をしてて、気がついたらここに来てたの。")
    (wait)
    (text #:color 7 "【" 0 "】（夢遊病者じゃあるまいし・・・まずくないかい？）")
    (wait)
    (text #:color 6 "【くるみ】あのね、一哉君たらね・・・電話をかけてもいないし、家に行ってもいないし。")
    (wait)
    (text #:color 6 "【くるみ】もうこのまま・・・ずっと会えないのかなって。")
    (wait)
    (text #:color 7 "【" 0 "】そ、そ、そ、そんな事はないさあ。")
    (wait)
    (text #:color 6 "【くるみ】どうしてドモるの？・・・" 0 "さんまで変よ。")
    (wait)
    (set-reg: 502 1)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 50) 0) (text "他の場所に行く"))
        (if (== (: 50) 1) (text "公園に行く"))
        (text "電車に乗る")
        (text "やめる")))
      (cond
       ((&& (== N 1) (== (: 49) 0))
        (<>
         (text #:color 6 "【くるみ】" 0 "さん・・・もうちょっとだけ一緒にいて。")
         (wait)
         (text #:color 7 "【" 0 "】う、うん・・・。")
         (wait)))
       ((&& (== N 1) (== (: 49) 1))
        (<>
         (text #:color 7 "【" 0 "】じゃあね、くるみちゃん・・・ばいばい。")
         (wait)
         (text #:color 6 "【くるみ】もうちょっと話を聞いて欲しかったんだけど・・・。")
         (wait)
         (text #:color 7 "【" 0 "】また今度ねゆっくり話をしようぜ・・・な？")
         (wait)
         (text #:color 6 "【くるみ】そう・・・それじゃあ。")
         (wait)
         (set-reg: 112 (- (: 112) 1))
         (set-var N 21)
         (slot 1 3)
         (mes-jump "town1.mes")))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】くるみちゃん、公園で話を聞くよ・・・いいだろ？")
         (wait)
         (text #:color 6 "【くるみ】ありがとう・・・" 0 "さん。")
         (wait)
         (text #:color 7 "【" 0 "】いいって事よ、それより早く行こうぜ。")
         (wait)
         (text #:color 6 "【くるみ】うん・・・。")
         (wait)
         (set-reg: 854 1)
         (set-reg: 508 1)
         (set-var N 21)
         (slot 1 3)
         (mes-jump "town1.mes")))
       ((&& (== N 3) (< M 300) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】（げっ・・・３００円すら、俺は持ってないのか！？）")
         (wait)
         (text #:color 7 "【" 0 "】（電車賃がなくて、先負町に帰れないなんて・・・口が割けても言えないぜ。）")
         (wait)))
       ((&& (== N 3) (== (: 49) 0) (== (: 50) 0))
        (<>
         (text #:color 6 "【くるみ】" 0 "さん・・・もうちょっとだけ一緒にいて。")
         (wait)
         (text #:color 7 "【" 0 "】う、うん・・・。")
         (wait)))
       ((&& (== N 3) (== (: 49) 1) (== (: 50) 0))
        (<>
         (text #:color 7 "【" 0 "】じゃあね、くるみちゃん・・・ばいばい。")
         (wait)
         (text #:color 6 "【くるみ】もうちょっと話を聞いて欲しかったんだけど・・・。")
         (wait)
         (text #:color 7 "【" 0 "】また今度ゆっくり話をしようぜ・・・な？")
         (wait)
         (text #:color 6 "【くるみ】そう・・・それじゃあ。")
         (wait)
         (set-reg: 112 (- (: 112) 1))
         (set-var A 30)
         (proc 12)
         (set-var M (- M 300))
         (proc 11)
         (set-var N 1)
         (mes-call "den.mes")
         (slot 1 2)
         (mes-jump "sakima.mes")))
       ((&& (== N 3) (== (: 50) 1))
        (<>
         (text #:color 6 "【くるみ】" 0 "さん・・・公園って電車で行くの？")
         (wait)
         (text #:color 7 "【" 0 "】いいや、歩いてすぐだぜ・・・電車には乗らない。")
         (wait)))
       ((&& (== N 4) (== (: 50) 0))
        (<> (text #:color 7 "【" 0 "】（そうだな・・・もう少しここにいるか。）") (wait)))
       ((&& (== N 4) (== (: 50) 1))
        (<> (text #:color 7 "【" 0 "】（なあ・・・本当は他の場所に行きたいんだろ？）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 6 "【くるみ】一哉君と私・・・もうだめかもしれない。")
      (wait)
      (text #:color 7 "【" 0 "】そ、そ、そ、そんな事はないさあ。")
      (wait)
      (text #:color 6 "【くるみ】ねえ・・・どうしてどもるの？")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さんまで変になっちゃいや。")
      (wait)
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 6 "【くるみ】一哉君・・・どうして急に変わっちゃったのかな？")
      (wait)
      (text #:color 7 "【" 0 "】か、変わってないさ・・・あいつは何も。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん、何か変・・・。")
      (wait)
      (text #:color 6 "【くるみ】・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん・・・私に何か隠してなあい？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "隠してない") (text "隠している")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】隠してないよ・・・何も隠してない。")
         (wait)
         (text #:color 6 "【くるみ】そう？・・・ならいいんだけど。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】隠してるよ・・・実は。")
         (wait)
         (text #:color 6 "【くるみ】でしょう？・・・言ってよ、お願い。")
         (wait)
         (text #:color 7 "【" 0 "】どうしようかなあ・・・。")
         (wait)
         (text #:color 6 "【くるみ】言ってくれないと・・・ここで泣いちゃうから。")
         (wait)
         (text #:color 7 "【" 0 "】実は・・・。")
         (wait)
         (text #:color 6 "【くるみ】うん・・・。")
         (wait)
         (text #:color 7 "【" 0 "】俺・・・くるみちゃんが好きなんだ。")
         (wait)
         (text #:color 6 "【くるみ】・・・。")
         (wait)
         (text #:color 6 "【くるみ】・・・ぽっ。")
         (wait)
         (text #:color 7 "【" 0 "】（うーん、彼女は純情な子だ。）")
         (wait)
         (text
          #:color
          6
          "【くるみ】冗談で言ってる事はわかるけど・・・そんなに正面から言われた事がないの・・・だから頬が熱くなっちゃう。")
         (wait)
         (set-reg: 112 (+ (: 112) 1))))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 6 "【くるみ】ずっと一哉君に会ってないでしょ？・・・顔もだんだん忘れちゃいそう。")
      (wait)
      (text #:color 7 "【" 0 "】くるみちゃんは・・・一哉の事が好きなんだよな。")
      (wait)
      (text #:color 6 "【くるみ】うん・・・大好き。")
      (wait)
      (text #:color 7 "【" 0 "】そうだよなあ・・・。")
      (wait)
      (text #:color 6 "【くるみ】でも・・・一哉君は、私の事が好きじゃないみたい。")
      (wait)
      (text #:color 7 "【" 0 "】そ、そ、そ、そんな事はないさあ。")
      (wait)
      (text #:color 6 "【くるみ】ほら、またどもる・・・" 0 "さんって嘘をつこうとすると、すぐ顔に出ちゃうんだから。")
      (wait)
      (text #:color 7 "【" 0 "】そんな事はない、一哉はくるみちゃんが好きだぜ。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 6 "【くるみ】一哉君・・・新しい彼女ができたに決まってる。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【くるみ】そうしたら私・・・どうしようかなあ。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 6 "【くるみ】死んじゃおうかな・・・。")
      (wait)
      (text #:color 7 "【" 0 "】おいおいっ・・・そんな事で死んでたら、俺なんか１００回ぐらい死んでるぜ。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さんって、そんなにフラれてるの？")
      (wait)
      (text #:color 7 "【" 0 "】細かいのを入れたら、そうだな・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "１００回") (text "２００回") (text "３００回")))
      (cond
       ((== N 1) (<> (text #:color 7 "【" 0 "】１００回はフラれてるぜ・・・俺なんて。") (wait)))
       ((== N 2) (<> (text #:color 7 "【" 0 "】２００回はフラれてるぜ・・・俺なんて。") (wait)))
       ((== N 3) (<> (text #:color 7 "【" 0 "】３００回はフラれてるぜ・・・俺なんて。") (wait)))
       (else (<>)))
      (text #:color 6 "【くるみ】すっごーい・・・よく生きてるね。")
      (wait)
      (text #:color 7 "【" 0 "】（くるみちゃんて、たまーにキツい事を言うよな・・・うん。）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 6 "【くるみ】でも私、一哉君がいない生活なんて・・・考えられないの。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 6 "【くるみ】一哉君と話もできなくて、一緒に歩く事もできない生活なんて・・・絶対にいや。")
      (wait)
      (text #:color 7 "【" 0 "】気持ちはわかるけど・・・。")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さん、どうして私・・・一哉君に・・・。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (text #:color 6 "【くるみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（困ったな・・・。）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 6 "【くるみ】あのね、あのね・・・一哉君って優しかったの・・・でも、最近はすごく冷たいの。")
      (wait)
      (text #:color 6 "【くるみ】冷たくされても、私は一哉君が好きだから・・・だから、だから・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん・・・泣きそうな雰囲気だ、困った。）")
      (wait)
      (text #:color 6 "【くるみ】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ね、ねえ・・・くるみちゃん。")
      (wait)
      (text #:color 6 "【くるみ】な・・・に？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "他の場所に行く") (text "逃げる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】あの・・・もし俺でよかったら話を聞くぜ。")
         (wait)
         (text #:color 6 "【くるみ】・・・ありがと。")
         (wait)
         (text #:color 7 "【" 0 "】どうする？")
         (wait)
         (text #:color 6 "【くるみ】話を・・・聞いて欲しい。")
         (wait)
         (text #:color 7 "【" 0 "】わかった・・・どこか話ができる場所に行こう。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】あの・・・さ。")
         (wait)
         (text #:color 6 "【くるみ】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】実は俺、用があるんだ。")
         (wait)
         (text #:color 6 "【くるみ】・・・。")
         (wait)
         (text #:color 6 "【くるみ】ごめんなさい、" 0 "さん・・・勝手に話を聞いてもらっちゃて。")
         (wait)
         (text #:color 7 "【" 0 "】また今度・・・な？")
         (wait)
         (text #:color 6 "【くるみ】・・・うん。")
         (wait)
         (wait)
         (set-reg: 49 1)))
       (else (<>)))
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 49) 1))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん、用があるんでしょ？")
      (wait)
      (text #:color 7 "【" 0 "】そ、そうだっな・・・。")
      (wait)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】えーと・・・どこに行きたい？")
      (wait)
      (text #:color 6 "【くるみ】" 0 "さんにまかせる・・・。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 17) 0) (text "ラブホテル"))
        (if (== (: 18) 0) (text "遊園地"))
        (if (== (: 16) 0) (text "公園"))
        (if (== (: 19) 0) (text "道路の上"))
        (if (== (: 20) 0) (text "天空の城"))))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】なあ・・・ラブホテルに行こうぜ。")
         (wait)
         (text #:color 6 "【くるみ】・・・。")
         (wait)
         (text #:color 6 "【くるみ】" 0 "さんって・・・ひどい。")
         (wait)
         (text #:color 7 "【" 0 "】じ、冗談だってばあ・・・やだなあ、もう。")
         (wait)
         (set-reg: 17 1)
         (set-reg: 112 (- (: 112) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・遊園地だったら、ここから歩いて行けるぜ。")
         (wait)
         (text #:color 6 "【くるみ】でも、遊園地ってうるさいし・・・もっと静かな所がいい。")
         (wait)
         (text #:color 7 "【" 0 "】そうだよな・・・確かにそうだ、うん。")
         (wait)
         (set-reg: 18 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】そうだ、ビックなサイズの公園があるじゃないか・・・あそこだったらここから歩いて行けるぜ。")
         (wait)
         (text #:color 6 "【くるみ】うん・・・。")
         (wait)
         (text #:color 7 "【" 0 "】よーし、公園に行こう。")
         (wait)
         (text #:color 6 "【くるみ】私・・・池のそばで話したい。")
         (wait)
         (text #:color 7 "【" 0 "】池のそば・・・ああ、あのボート乗り場のある。")
         (wait)
         (text #:color 6 "【くるみ】あそこでね・・・よく一哉君とお話したの。")
         (wait)
         (text #:color 7 "【" 0 "】わかった、そこに行こう。")
         (wait)
         (set-reg: 16 1)
         (set-reg: 50 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】道路の上なんてどう？")
         (wait)
         (text #:color 6 "【くるみ】だったら・・・ここで話をしてた方がいい。")
         (wait)
         (text #:color 7 "【" 0 "】はっはっはっ、同感だ・・・俺もそう思う。")
         (wait)
         (set-reg: 19 1)))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】天空の城なんて・・・どう？")
         (wait)
         (text #:color 6 "【くるみ】？？？")
         (wait)
         (text #:color 7 "【" 0 "】はずした？")
         (wait)
         (text #:color 6 "【くるみ】うん。")
         (wait)
         (set-reg: 20 1)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 6 "【くるみ】" 0 "さん・・・早く行きたい。")
      (wait)
      (text #:color 7 "【" 0 "】はっはっはっ、まかしなさい。")
      (wait)))
    ((&& (== V 1) (== N 2))
     (<>
      (text
       #:color
       7
       "【"
       0
       "】（この髪型を見てると・・・一哉がこの子に身体を求めるっていうのは、ちょっと無理があるような気がしてきたぞ。）")
      (wait)))
    ((&& (== V 1) (== N 3))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃんはかわいいんだから・・・もっと自分に自信を持てばいいんだよ。")
      (wait)))
    ((&& (== V 1) (== N 4))
     (<>
      (text #:color 7 "【" 0 "】リボンを取って、ロングヘアにしたら・・・きっと大人っぽく見えるぜ。")
      (wait)
      (text #:color 6 "【くるみ】駄目なの・・・お父さんが、学生は変な髪型をしちゃいけないって。")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、そうだった・・・くるみちゃんには、お父さんっていう障害もあったんだ。）")
      (wait)))
    ((&& (== V 1) (== N 5))
     (<>
      (text #:color 7 "【" 0 "】もったいないなあ。")
      (wait)
      (text #:color 6 "【くるみ】何が？")
      (wait)
      (text #:color 7 "【" 0 "】その肌が自分だけの為に存在してるなんて・・・ああもったいない。")
      (wait)
      (text #:color 6 "【くるみ】この肌は私の為だけじゃなくて・・・未来のお婿さんの為にも存在してるわよ。")
      (wait)
      (text #:color 7 "【" 0 "】お婿さんねえ・・・。")
      (wait)))
    ((&& (== V 1) (== N 6))
     (<> (text #:color 7 "【" 0 "】（こういうポーズを取る女の子は、警戒心が強いんだ・・・。）") (wait)))
    ((&& (== V 1) (== N 7))
     (<>
      (text #:color 7 "【" 0 "】くるみちゃん、おっぱい大きくなった？")
      (wait)
      (text #:color 6 "【くるみ】もう・・・お父さんみたいな事を言わないで。")
      (wait)
      (text #:color 7 "【" 0 "】げっ・・・そんな事を言うのか、くるみちゃんのお父さんって！？")
      (wait)))
    ((&& (== V 1) (== N 8))
     (<>
      (text #:color 7 "【" 0 "】（くるみちゃんだ・・・こんな小さい身体で、一生懸命悩んでるんだろなあ。）")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))