(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\い
  #\【
  #\】
  #\っ
  #\子
  #\夏
  #\。
  #\！
  #\ん
  #\な
  #\、
  #\て
  #\は
  #\え
  #\だ
  #\う
  #\の
  #\し
  #\か
  #\る
  #\た
  #\あ
  #\そ
  #\さ
  #\？
  #\れ
  #\ー
  #\が
  #\よ
  #\ら
  #\ゃ
  #\を
  #\に
  #\君
  #\も
  #\と
  #\わ
  #\こ
  #\で
  #\ね
  #\け
  #\じ
  #\ょ
  #\ど
  #\げ
  #\く
  #\き
  #\ち
  #\（
  #\）
  #\俺
  #\ほ
  #\ま
  #\や
  #\言
  #\り
  #\ば
  #\水
  #\ス
  #\変
  #\ッ
  #\す
  #\普
  #\通
  #\何
  #\ふ
  #\事
  #\女
  #\人
  #\ぼ
  #\ル
  #\私
  #\ク
  #\一
  #\つ
  #\気
  #\ご
  #\ひ
  #\ぐ
  #\ぜ
  #\ラ
  #\大
  #\髪
  #\胸
  #\プ
  #\休
  #\デ
  #\せ
  #\み
  #\び)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "j04.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "j04.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 539) 1)
   (<>
    (text #:color 2 "【夏子】きゃーっ！！・・・" 0 "君、気持ちいいーっ！！")
    (wait)
    (text #:color 7 "【" 0 "】（うーん、ベットの中で言って欲しい。）")
    (wait)
    (text #:color 2 "【夏子】そーれっ！！・・・" 0 "君っ！！")
    (wait)
    (text #:color 7 "【" 0 "】夏子さんって・・・奇麗だなごぼげほげほげほっ！！")
    (wait)
    (text #:color 2 "【夏子】あはははっ・・・喋ってると危ないわよ。")
    (wait)
    (text #:color 7 "【" 0 "】ちくしょう、このプールは『波がくるくるプール』だぞ。")
    (wait)
    (text #:color 2 "【夏子】楽しいわあ・・・こんなに楽しいなんてひさしぶりだわ。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.> (if (== (: 50) 1) (text "休む")) (text "水をかける") (text "水にもぐる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】よーし・・・デッキチェアの所に戻って休もう。")
         (wait)
         (text #:color 2 "【夏子】そうね・・・そうしましょう。")
         (wait)
         (set-var A 1)
         (proc 13)
         (proc 11)
         (slot 1 6)
         (mes-jump "yuench4.mes")))
       ((&& (== N 2) (== (: 50) 1))
        (<> (text #:color 2 "【夏子】きゃっ！！・・・" 0 "君、休むんでしょ？") (wait)))
       ((&& (== N 2) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】えいえいえいっ！！")
         (wait)
         (text #:color 2 "【夏子】きゃっ！！・・・" 0 "君やったわね！！")
         (wait)
         (text #:color 7 "【" 0 "】えいえいえいえいえいえいえいっ！！")
         (wait)
         (text #:color 2 "【夏子】" 0 "君っ・・・げほげほげほっ！！・・・息ができなくなるくらい水をかけないでよ。")
         (wait)
         (text #:color 7 "【" 0 "】えいえいえいえいえいえいえいえいえいっ！！")
         (wait)
         (text #:color 2 "【夏子】・・・いいかげんにしなさい。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 2) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】えいえいえいえいえいえいっ！！")
         (wait)
         (text #:color 2 "【夏子】私だって負けないわよ・・・えいえいえいえいえいっ！！")
         (wait)
         (text #:color 7 "【" 0 "】えいえいえいえいえいえいえいっ！！")
         (wait)
         (text #:color 2 "【夏子】えいえいえいえいえいえいえいっ！！")
         (wait)
         (text #:color 7 "【" 0 "】えいえいえいえいえいえいえいっ！！")
         (wait)
         (text #:color 2 "【夏子】えいえいえいえいえいえいえいっ！！")
         (wait)
         (text #:color 7 "【" 0 "】はあはあはあ・・・も、もうやめない？")
         (wait)
         (text #:color 2 "【夏子】はあはあ、そ、そうね・・・。")
         (wait)
         (set-reg: 10 2)))
       ((&& (== N 3) (== (: 10) 2))
        (<> (text #:color 7 "【" 0 "】（よそう・・・疲れるだけだ。）") (wait)))
       ((&& (== N 3) (== (: 50) 1))
        (<> (text #:color 2 "【夏子】" 0 "君・・・まだここで遊ぶ？") (wait)))
       ((&& (== N 3) (== (: 11) 0))
        (<>
         (text #:color 7 "【" 0 "】せーのっ！！")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 6 1)
         (image "kuro.pd8")
         (proc 15)
         (set-arr~ @ 7 0)
         (sound 1)
         (text #:color 2 "【夏子】" 0 "君・・・何をするの？")
         (wait)
         (text #:color 7 "【" 0 "】ぼこぼこぼこぼこ・・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】ごぼげべがぼごべっ！！")
         (wait)
         (set-arr~ @ 7 1)
         (set-arr~ @ 1 4096)
         (set-arr~ @ 9 (&& (~ @ 9) 65534))
         (set-arr~ @ 6 1)
         (image "j04.pd8")
         (set-arr~ @ 9 (// (~ @ 9) 1))
         (proc 24)
         (set-arr~ @ 7 0)
         (sound 1)
         (set-var I 36)
         (proc 26)
         (set-reg: 835 0)
         (text #:color 7 "【" 0 "】はあはあはあはあはあはあはあはあ・・・し、死ぬかと思った。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、すごい・・・１５分ももぐってたわよ。")
         (wait)
         (set-var A 15)
         (proc 12)
         (proc 11)
         (text #:color 7 "【" 0 "】俺・・・しばらく意識を失ってたんじゃないか？")
         (wait)
         (set-reg: 11 1)))
       ((&& (== N 2) (== (: 11) 1))
        (<> (text #:color 7 "【" 0 "】（よそうぜ・・・こんな場所で昇天したくない。）") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君ってえ・・・いい身体してるのね。")
      (wait)
      (text #:color 7 "【" 0 "】え？")
      (wait)
      (text #:color 2 "【夏子】何かスポーツやってるの？・・・それっ！！")
      (wait)
      (text #:color 7 "【" 0 "】う、うわっと！！")
      (wait)
      (text #:color 2 "【夏子】ねえねえ、何かスポーツやってるのって聞いたの！！・・・それっ！！")
      (wait)
      (text #:color 7 "【" 0 "】答えようとすると、水をかけるからだよ。")
      (wait)
      (text #:color 2 "【夏子】わかった、じゃあかけないから・・・答えて。")
      (wait)
      (text #:color 7 "【" 0 "】えーと・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "サッカー") (text "野球") (text "セックス") (text "放送部")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺、サッカーをやってたんだ。")
         (wait)
         (text #:color 2 "【夏子】へえ、格好いいじゃない・・・一哉君に聞いたけど、" 0 "君って脚が早いんですってね。")
         (wait)
         (text #:color 7 "【" 0 "】逃げる為だけに鍛えてあるからな。")
         (wait)
         (text #:color 2 "【夏子】あははははは！！")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】俺、野球をやってたんだ。")
         (wait)
         (text #:color 2 "【夏子】野球をやってたの？・・・ふーん、なんとなくイメージとは違うけど。")
         (wait)
         (text #:color 7 "【" 0 "】そうかな？")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】俺、セックスをやってたんだ。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君の学校って『セックスクラブ』があるわけ？")
         (wait)
         (text #:color 7 "【" 0 "】ううん、自主クラブ。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君らしいわね・・・そーれっ！！")
         (wait)
         (text #:color 7 "【" 0 "】げほげほっ！！")
         (wait)
         (text #:color 2 "【夏子】あはははっ・・・変な事を言った罰よっ！！")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】俺、放送部をやってたんだ。")
         (wait)
         (text #:color 2 "【夏子】放送部って・・・スポーツをするクラブなの？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】ああ、けっこう大変なんだぜ・・・朝礼の時にマイクスタンドを運んだり、ラッパスピーカーの位置を直したり。")
         (wait)
         (text #:color 2 "【夏子】それって・・・スポーツじゃないでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・そうだよね。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 2 "【夏子】気持ちいいわあ・・・こんなに楽しいのなら、もっと早く来ればよかった。")
      (wait)
      (text #:color 7 "【" 0 "】これからだって来れるじゃないか。")
      (wait)
      (text #:color 2 "【夏子】だって、もう８月２７日だもの・・・夏は終りじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】違うよ、夏子さんと俺の夏は・・・これから始まるんだ。")
      (wait)
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君って、本当に口がうまいのね・・・そーれっ！！")
      (wait)
      (text #:color 7 "【" 0 "】げほげほげほっ！！")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 2 "【夏子】ねえ、" 0 "君って・・・彼女がいるんでしょ？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "いる") (text "いない") (text "絶対にいない")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】いるよ、俺だって男だもんな。")
         (wait)
         (text #:color 2 "【夏子】そうよね、男だものね・・・それっ！！")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 2 "【夏子】どんな女の子なの？")
         (wait)
         (text #:color 7 "【" 0 "】えーとね、髪が長くて、奇麗で・・・真っ赤な水着が似合う女性。")
         (wait)
         (text #:color 2 "【夏子】あはははっ・・・それって、私みたいじゃない。")
         (wait)
         (text #:color 7 "【" 0 "】あれえ、夏子さんって俺の彼女じゃないんだっけ！？")
         (wait)
         (text #:color 2 "【夏子】" 0 "君にかかると、気がつかないうちに彼女にさせられそうね・・・それっ！！")
         (wait)
         (text #:color 7 "【" 0 "】げほげほっ！！・・・み、水を飲んだ。")
         (wait)
         (set-reg: 109 (+ (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いないよ・・・誰だ、そんな事を言ったのは。")
         (wait)
         (text #:color 2 "【夏子】一哉君。")
         (wait)
         (text #:color 7 "【" 0 "】あいつは嘘つきなんだ・・・夏子さんも気をつけた方がいい。")
         (wait)
         (text #:color 2 "【夏子】あはははっ・・・一哉君も同じ事を言ってたわよ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】絶対にいないよ。")
         (wait)
         (text #:color 2 "【夏子】うっそー、一哉君が言ってたわよ・・・" 0 "君は女の子に囲まれて生活をしてるって。")
         (wait)
         (text #:color 7 "【" 0 "】そりゃ嘘だ・・・俺はいつも一人で寂しい思いをしてるんだぜ。")
         (wait)))
       (else (<>)))
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・それっ！！")
      (wait)
      (text #:color 2 "【夏子】きゃあ、きゃあ！！・・・ひっどーい、髪がびしょびしょだわ。")
      (wait)
      (text #:color 7 "【" 0 "】髪がびしょびしょって・・・ここはプールだぜ。")
      (wait)
      (text #:color 2 "【夏子】あははは、そうだったわね・・・" 0 "君って、髪が濡れるとアルマジロみたい。")
      (wait)
      (text #:color 7 "【" 0 "】ア、アルマジロ！？・・・ぐわーんんんんっ。")
      (wait)
      (text #:color 2 "【夏子】もしかして、今のは傷ついた音？")
      (wait)
      (text #:color 7 "【" 0 "】もう・・・立ち直れない。")
      (wait)
      (text #:color 2 "【夏子】それだけかわいいって事よ・・・ふふふ。")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君、もぐりっこしない？")
      (wait)
      (text #:color 7 "【" 0 "】なんだよ、その『もぐりっこ』って。")
      (wait)
      (text #:color 2 "【夏子】どっちが水の中で息を長く止めてられるかって事よ。")
      (wait)
      (text #:color 7 "【" 0 "】いいよ・・・。")
      (wait)
      (text #:color 2 "【夏子】せーの・・・はいっ！！")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 6 1)
      (image "kuro.pd8")
      (proc 15)
      (set-arr~ @ 7 0)
      (sound 1)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【夏子】こちょこちょこちょ。")
      (wait)
      (text #:color 7 "【" 0 "】ごばばばばばばっ！！")
      (wait)
      (set-arr~ @ 7 1)
      (set-arr~ @ 1 4096)
      (set-arr~ @ 9 (&& (~ @ 9) 65534))
      (set-arr~ @ 6 1)
      (image "j04.pd8")
      (set-arr~ @ 9 (// (~ @ 9) 1))
      (proc 24)
      (set-arr~ @ 7 0)
      (sound 1)
      (set-var I 36)
      (proc 26)
      (set-reg: 835 0)
      (text #:color 7 "【" 0 "】ぶはあっ！！・・・な、何すんだよっ！！")
      (wait)
      (text #:color 2 "【夏子】あははははははっ！！")
      (wait)
      (text #:color 7 "【" 0 "】夏子さん・・・自分はもぐった？")
      (wait)
      (text #:color 2 "【夏子】ううん、見てただけ。")
      (wait)
      (text #:color 7 "【" 0 "】ひっどいの・・・。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】こうして夏子さんと一緒いるなんて・・・夢みたいだな。")
      (wait)
      (text #:color 2 "【夏子】どうして？")
      (wait)
      (text #:color 7 "【" 0 "】だってさ、夏子さんって・・・すごく奇麗だし。。")
      (wait)
      (text #:color 2 "【夏子】ありがとう・・・でも、私だって普通の女の子よ。")
      (wait)
      (text #:color 7 "【" 0 "】いーや、普通じゃない。")
      (wait)
      (text #:color 2 "【夏子】やだ・・・どうして普通じゃないの？")
      (wait)
      (text #:color 7 "【" 0 "】教えてあげない。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 2) (== N 1) (== (: 18) 0))
     (<>
      (text #:color 2 "【夏子】ねえ・・・教えて、どうして普通じゃないの？")
      (wait)
      (text #:color 7 "【" 0 "】それは・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 19) 0) (text "美人だから"))
        (if (== (: 20) 0) (text "かわいいから"))
        (if (== (: 21) 0) (text "胸が大きいから"))
        (if (== (: 22) 0) (text "性格が変だから"))
        (if (== (: 23) 0) (text "ハデだから"))
        (if (== (: 18) 0) (text "不思議な魅力"))))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】それは夏子さんが・・・美人だからさ。")
         (wait)
         (text #:color 2 "【夏子】美人だと普通じゃないの？")
         (wait)
         (text #:color 7 "【" 0 "】違うな・・・俺はいったい何が言いたいんだ？")
         (wait)
         (set-reg: 19 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】それは夏子さんが・・・かわいいからさ。")
         (wait)
         (text #:color 2 "【夏子】そう言われるるとうれしいけど・・・かわいいと普通じゃないのかしら？")
         (wait)
         (text #:color 7 "【" 0 "】なんか違うぞ・・・俺が言いたい事は、こんな事じゃない。")
         (wait)
         (set-reg: 20 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】それは・・・夏子さんの胸が大きいからさ。")
         (wait)
         (text #:color 2 "【夏子】え？")
         (wait)
         (text #:color 7 "【" 0 "】うーん、その胸の大きさは普通じゃないな。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、いやらしいわよ。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】そのくらい大きくなる為には、何人の男と身体を重ねたんだろう・・・って想像させる胸だな、うん。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君っ！！")
         (wait)
         (text #:color 7 "【" 0 "】乳輪も大きいでしょ？")
         (wait)
         (text #:color 2 "【夏子】" 0 "君・・・気が変になっちゃったの？")
         (wait)
         (text #:color 7 "【" 0 "】でしょう？・・・俺はいったい何を言いたかったんだろ？")
         (wait)
         (set-reg: 21 1)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】それは・・・夏子さんの性格が変だからさ。")
         (wait)
         (text #:color 2 "【夏子】ちょっとお、どういう事よ。")
         (wait)
         (text #:color 7 "【" 0 "】変だよ、絶対に変だ・・・夏子さんって変人だ。")
         (wait)
         (text #:color 2 "【夏子】私のどこが変人なのよ・・・顔は笑ってるけど、本当は怒ってるのよ。")
         (wait)
         (text #:color 7 "【" 0 "】だよねえ・・・夏子さんの性格が変だなんて、俺は何を言ってるんだろ？")
         (wait)
         (set-reg: 22 1)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 5)
        (<>
         (text #:color 7 "【" 0 "】それは夏子さんが・・・ハデだからさ。")
         (wait)
         (text #:color 2 "【夏子】私がハデ？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】ああ、ハデじゃなれければそんな水着は着ないさ・・・ああ、まるでウォータービジネスのおねーちゃんみたいだ。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君・・・ひどいわよ。")
         (wait)
         (text #:color 7 "【" 0 "】でしょう？・・・口が勝手に動くんだよ、まったく。")
         (wait)
         (set-reg: 23 1)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 6)
        (<>
         (text #:color 7 "【" 0 "】なんて言うか・・・夏子さんって不思議な魅力があるんだ。")
         (wait)
         (text #:color 2 "【夏子】だから普通じゃないの？")
         (wait)
         (text #:color 7 "【" 0 "】うん、他の女の人にはない魅力を持ってるから・・・普通じゃない。")
         (wait)
         (text #:color 2 "【夏子】そんなに私って・・・魅力的かしら？")
         (wait)
         (text #:color 7 "【" 0 "】どんな男でも、夏子さんに見つめられたら・・・ふにゃふにゃふにゃっ！！")
         (wait)
         (text #:color 2 "【夏子】ど、どうしたの！？")
         (wait)
         (text #:color 7 "【" 0 "】ってなってしまうだろう。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君・・・もしかして、私を口説いてる？")
         (wait)
         (text #:color 7 "【" 0 "】うん。")
         (wait)
         (text #:color 2 "【夏子】あはははっ・・・正直でいいわね。")
         (wait)
         (if-else (== (: 24) 0) (<> (set-reg: 109 (+ (: 109) 1))) (<>))
         (set-reg: 18 1)))
       (else (<>)))
      (set-reg: 24 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 0))
     (<>
      (text #:color 2 "【夏子】ふう・・・気持ちいいわ。")
      (wait)
      (text #:color 7 "【" 0 "】夏子さん、ちょっと休まないか？")
      (wait)
      (text #:color 2 "【夏子】そうね・・・そうしましょう。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<> (text #:color 2 "【夏子】" 0 "君、休まないの？") (wait)))
    ((&& (== V 1) (== N 2) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんの髪だ・・・なんて奇麗なんだ。）")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 2) (== (: 25) 1))
     (<> (text #:color 7 "【" 0 "】（この髪を・・・ベットの中で触りたい。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんの顔は・・・笑ってるな。）")
      (wait)
      (text #:color 7 "【" 0 "】（うーん、このままいい感じでいけば・・・ひっとすれば、ひっとするかもしれない。）")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 3) (== (: 26) 1))
     (<> (text #:color 7 "【" 0 "】（夏子さんは、子供のようにはしゃいでる・・・。）") (wait)))
    ((&& (== V 8) (== N 4) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・そーれっ！！")
      (wait)
      (text #:color 2 "【夏子】きゃっ！！・・・水をかけないでえ！！")
      (wait)
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君・・・今、胸を触らなかった？")
      (wait)
      (set-reg: 109 (- (: 109) 1))
      (set-reg: 27 1)))
    ((&& (== V 8) (== N 4) (== (: 27) 1))
     (<>
      (text #:color 7 "【" 0 "】（うーん・・・どうせ触るんだったら、正々堂々と触りたい。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（でも、正面きってにぎにぎしたら・・・張り倒されるのがオチだな、やめよう。）")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんの身体が動くたびに・・・胸がゆれてる。）")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 5) (== (: 28) 1))
     (<> (text #:color 7 "【" 0 "】（夏子さんだぜ・・・俺は今、夏子さんと一緒にいるんだあ。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんも、プールの水も・・・キラキラと輝いてるぜ。）")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 6) (== (: 29) 1))
     (<> (text #:color 7 "【" 0 "】（プールを見てても仕方がない・・・夏子さんを見ていたいんだ。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))