(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\な
  #\子
  #\い
  #\夏
  #\っ
  #\ん
  #\て
  #\の
  #\、
  #\だ
  #\は
  #\が
  #\し
  #\た
  #\う
  #\に
  #\る
  #\あ
  #\か
  #\も
  #\？
  #\と
  #\で
  #\を
  #\さ
  #\ち
  #\（
  #\）
  #\ら
  #\そ
  #\く
  #\こ
  #\よ
  #\れ
  #\ー
  #\君
  #\言
  #\わ
  #\ま
  #\俺
  #\え
  #\ゃ
  #\気
  #\！
  #\見
  #\ろ
  #\女
  #\ね
  #\ど
  #\じ
  #\す
  #\り
  #\ょ
  #\キ
  #\き
  #\ン
  #\事
  #\合
  #\着
  #\け
  #\脱
  #\奇
  #\麗
  #\本
  #\持
  #\ス
  #\ぎ
  #\ご
  #\私
  #\違
  #\思
  #\性
  #\ラ
  #\ズ
  #\ツ
  #\め
  #\ッ
  #\つ
  #\似
  #\悪
  #\男
  #\目
  #\欲
  #\冗
  #\談
  #\好
  #\替
  #\げ
  #\デ
  #\チ
  #\ェ
  #\変
  #\ぐ
  #\時
  #\神
  #\泳
  #\ず
  #\当
  #\ル
  #\ぞ
  #\水
  #\ア
  #\お
  #\み
  #\具
  #\教
  #\ぱ
  #\強
  #\引
  #\人)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "45.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "j11.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 25)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "j11an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "j11.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 36)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "j03.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 539) 1)
   (<>
    (text #:color 2 "【夏子】わあ・・・気持ちいい。")
    (wait)
    (text #:color 7 "【" 0 "】ウォータースライダーがあるぞ。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君、早く着替えましょう。")
    (wait)
    (text #:color 7 "【" 0 "】更衣室はどこかな？・・・もっとも俺は、ここでズボンとシャツを脱げば準備ＯＫだけど。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君、ちゃんと更衣室で着替えなさい。")
    (wait)
    (text #:color 7 "【" 0 "】へいへい。")
    (wait)
    (text #:color 2 "【夏子】あそこがそうじゃない？・・・私、水着に着替えてくるわね。")
    (wait)
    (text #:color 7 "【" 0 "】じゃあ、どこか場所を決めて・・・そこで待ってるよ。")
    (wait)
    (text #:color 2 "【夏子】えーと、あそこにデッキチェアがあるでしょ？・・・" 0 "君、着替えたらあのデッキチェアの所で待ってて。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君？")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君ったら・・・もう、どこを見てるのよ。")
    (wait)
    (text #:color 7 "【" 0 "】ははは、ついつい視線がおねーちゃん達の方に・・・。")
    (wait)
    (text #:color 2 "【夏子】仕方がない子ね・・・私、着替えてくるからね。")
    (wait)
    (text #:color 7 "【" 0 "】あ・・・俺も更衣室に行くってば。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "kuro.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (sound 1)
    (text #:color 7 "【" 0 "】よーし、ここが更衣室だぞ・・・着替えよう。")
    (wait)
    (text #:color 7 "【" 0 "】シャツを脱いで・・・ズボンを脱いで・・・。")
    (wait)
    (text #:color 7 "【" 0 "】あ、先に靴を脱がないとズボンが脱ぎにくいな・・・靴を脱いで、ズボンを脱いで。")
    (wait)
    (text #:color 7 "【" 0 "】くつ下を脱いで、パンツを脱いで・・・よーし。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "45.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "45an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "45.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 36)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】なんか・・・スカスカするな。")
    (wait)
    (text #:color 6 "【女の子】きゃーーーっ！！変態っ！！")
    (wait)
    (text #:color 3 "【女の子】きゃーーーっ！！この子、スッポンポンだわっ！！")
    (wait)
    (text #:color 7 "【" 0 "】し、しまったあ！！パンツを脱ぐ必要はなかったんだあ！！")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "kuro.pd8")
    (proc 15)
    (set-arr~ @ 7 0)
    (sound 1)
    (text #:color 7 "【" 0 "】はあはあはあ・・・あー、びっくりした。")
    (wait)
    (text #:color 7 "【" 0 "】パ、パンツをはいて・・・よーし、今度こそ大丈夫だぞ。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "45.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "45an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "45.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (sound 1)
    (set-var I 36)
    (proc 26)
    (set-reg: 835 0)
    (text #:color 7 "【" 0 "】はっはっはっ！！ほーら、平気だぞ。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text
     #:color
     7
     "【"
     0
     "】おちゃめな事をしてたから、余計な時間をくってしまった・・・夏子さんはもうデッキチェアの場所にいるかな？")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "j03.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "j03an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "j03.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】・・・いた。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君、遅いわよ・・・何をしてたの？")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君？")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 2 "【夏子】" 0 "君ったら！！")
    (wait)
    (text #:color 7 "【" 0 "】あ、ああ・・・ご、ごめん。")
    (wait)
    (text #:color 2 "【夏子】どうしたの・・・ぼーっとして。")
    (wait)
    (text #:color 7 "【" 0 "】（ぼーっとした理由は・・・夏子さんだよ。）")
    (wait)
    (text #:color 7 "【" 0 "】（こんなに奇麗だなんて・・・彼女は夏の女神みたいだ。）")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show (<.> (text "泳ぐ") (text "こんがり焼く")))
      (cond
       ((&& (== N 1) (== (: 50) 0))
        (<>
         (text #:color 2 "【夏子】こうしてると気持ちがいいの・・・しばらくここにいたい気分ね。")
         (wait)
         (text #:color 7 "【" 0 "】うん・・・夏子さんがそうしたいのなら。")
         (wait)))
       ((&& (== N 1) (== (: 50) 1))
        (<>
         (text #:color 2 "【夏子】そうね・・・" 0 "君、一緒に泳ぎましょう。")
         (wait)
         (set-var A 1)
         (proc 13)
         (proc 11)
         (slot 1 6)
         (mes-jump "yuench3.mes")))
       ((&& (== N 2) (== (: 50) 0))
        (<> (text #:color 2 "【夏子】こんがり焼くのは、泳いだあとにしない？") (wait)))
       ((&& (== N 2) (== (: 50) 1))
        (<> (text #:color 2 "【夏子】" 0 "君、そろそろ泳ぎに行かない？") (wait)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 10) 0))
     (<>
      (text #:color 2 "【夏子】なんだか恥ずかしいわね・・・" 0 "君に水着姿を見られるのって。")
      (wait)
      (text #:color 7 "【" 0 "】（恥ずかしいもんか・・・こんなに奇麗なんだから。）")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、私の水着・・・似合ってる？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (text "似合ってる")
        (text "似合ってる")
        (text "似合ってる")
        (text "似合ってる")
        (text "似合ってる")))
      (if-else (// (== N 1) (== N 2) (== N 3) (== N 4) (== N 5))
        (<>
         (text #:color 7 "【" 0 "】似合ってるよ・・・とっても。")
         (wait)
         (text #:color 2 "【夏子】ありがとう・・・そう言ってもらえると、安心しちゃうわね。")
         (wait))
        (<>))
      (set-reg: 10 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君、なんだか変よ・・・ぼーっとしてて、具合でも悪いの？")
      (wait)
      (text #:color 7 "【" 0 "】違うんだ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "見とれてた") (text "具合が悪い")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】違うんだ・・・夏子さんに見とれてた。")
         (wait)
         (text #:color 2 "【夏子】もう、口が上手ね。")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】確かに俺は口が上手かもしれない・・・だけど、夏子さんの姿を見た時に、俺は心の底から奇麗だなって思ったんだ。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 2 "【夏子】・・・うれしい。")
         (wait)
         (set-reg: 109 (+ (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】違うんだ・・・俺は具合が悪いんだ。")
         (wait)
         (text #:color 2 "【夏子】違わないじゃない・・・私も具合が悪そうって言ったのよ。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そうだったな。")
         (wait)
         (text #:color 2 "【夏子】せっかく楽しもうと思ったのに、" 0 "具合が悪いんじゃつまらないわ。")
         (wait)
         (text #:color 7 "【" 0 "】ははは、大丈夫だよ・・・５秒で復活するから。")
         (wait)
         (text #:color 2 "【夏子】本当に？")
         (wait)
         (text #:color 7 "【" 0 "】５、４、３、２、１、ほーら元気になっちゃった。")
         (wait)))
       (else (<>)))
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君って不思議な男の子よね・・・前にも言ったかしら？")
      (wait)
      (text #:color 7 "【" 0 "】俺はごくごく平凡な男だよ・・・別に特別ってわけじゃないさ。")
      (wait)
      (text #:color 2 "【夏子】そうかしら？・・・" 0 "君の目を見てると、他の男の子とは違う気がするけど。")
      (wait)
      (text #:color 7 "【" 0 "】それは・・・夏子さんを見る時だけ、そういう目になるのかもしれない。")
      (wait)
      (text #:color 2 "【夏子】え？")
      (wait)
      (text #:color 7 "【" 0 "】目は心の窓って言うでしょ？・・・だから、俺が夏子さんを見る目は、俺の気持ちがあらわれてるんだ。")
      (wait)
      (text #:color 2 "【夏子】へえ・・・どんな気持ちなの？")
      (wait)
      (text #:color 7 "【" 0 "】教えてあげない。")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君、教えてよ・・・私を見る目って、どんな気持ちがあらわれた目？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ決まってるさ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 14) 0) (text "愛情"))
        (if (== (: 15) 0) (text "食欲"))
        (if (== (: 16) 0) (text "性欲"))
        (if (== (: 13) 0) (text "あこがれ"))))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺が夏子さんを見る気持ちは・・・愛情のあらわれさ。")
         (wait)
         (text #:color 2 "【夏子】あははっ・・・" 0 "君は私の事を愛しちゃってるんだ。")
         (wait)
         (text #:color 7 "【" 0 "】（うーん、ちょっとハズした感じだな・・・。）")
         (wait)
         (text #:color 7 "【" 0 "】と、言うのは冗談で・・・本当の事は教えてあげない。")
         (wait)
         (set-reg: 14 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】俺が夏子さんを見る気持ちは・・・食欲のあらわれさ。")
         (wait)
         (text #:color 2 "【夏子】食欲！？")
         (wait)
         (text #:color 7 "【" 0 "】だって、夏子さんっておいしそうなんだもの・・・特にそのふととももやおっぱいなんか・・・。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君って・・・変態？")
         (wait)
         (text #:color 7 "【" 0 "】（うーん、思いっきりハズしてしまった・・・。）")
         (wait)
         (text #:color 7 "【" 0 "】と、言うのは冗談で・・・本当の事は教えてあげない。")
         (wait)
         (set-reg: 15 1)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】俺が夏子さんを見る気持ちは・・・性欲に決まってるじゃないか。")
         (wait)
         (text #:color 2 "【夏子】え！？")
         (wait)
         (text
          #:color
          7
          "【"
          0
          "】その高慢な顔をした夏子さんを、ロープでぐるぐるに縛って・・・強引に俺のポコチンをその淫らな穴にぶち込んでやるんだあっ！！")
         (wait)
         (text #:color 7 "【" 0 "】はあはあはあ・・・。")
         (wait)
         (text #:color 2 "【夏子】がっかりだわ・・・" 0 "君がそんな事を言うなんて。")
         (wait)
         (text #:color 7 "【" 0 "】（し、しまったあ・・・取りかえしがつかない程、ハズしてしまったぜ。）")
         (wait)
         (text #:color 7 "【" 0 "】と、言うのは冗談で・・・本当の事は教えてあげない。")
         (wait)
         (text #:color 2 "【夏子】冗談でも、" 0 "君にそんな事を言って欲しくないわ。")
         (wait)
         (set-reg: 109 (- (: 109) 1))
         (set-reg: 16 1)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】俺が夏子さんを見る目は・・・うまく言えないけど。")
         (wait)
         (text #:color 2 "【夏子】うまく言えないけど？")
         (wait)
         (text #:color 7 "【" 0 "】あこがれてるような気がする・・・夏子さんに。")
         (wait)
         (text #:color 2 "【夏子】私にあこがれてるの？・・・" 0 "君が？")
         (wait)
         (text #:color 7 "【" 0 "】変かな？")
         (wait)
         (text #:color 2 "【夏子】変じゃないけど・・・" 0 "君って、女の子がまわりにいっぱいいるんでしょう？")
         (wait)
         (text #:color 7 "【" 0 "】俺のまわりに女の子がいっぱい？・・・誰だよ、そんな事を言ったのは。")
         (wait)
         (text #:color 2 "【夏子】一哉君が言ってたわよ・・・女の子がいっぱいいるなら、あこがれる女性は他にもいるでしょ？")
         (wait)
         (text #:color 7 "【" 0 "】違うんだ・・・夏子さんは俺にとって特別なんだ。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 2 "【夏子】やだ・・・なんだか照れちゃうじゃない。")
         (wait)
         (set-reg: 13 1)))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君・・・暑いわね。")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 2) (== N 1) (== (: 18) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・。")
      (wait)
      (text #:color 2 "【夏子】・・・なに？")
      (wait)
      (text #:color 7 "【" 0 "】好きだ・・・夏子さんみたいな女性に・・・キスしてみたい。")
      (wait)
      (text #:color 2 "【夏子】ちょっと、ドキドキする事を言わないでよ・・・もう。")
      (wait)
      (text #:color 7 "【" 0 "】夏子さんだって、俺の事が・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "好きだ") (text "嫌いだ")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺の事が・・・好きなんだろ？")
         (wait)
         (text #:color 2 "【夏子】あはは・・・" 0 "君って自信家なのね。")
         (wait)
         (text #:color 2 "【夏子】でも、自信がある男の人って好きよ・・・男は少しぐらい強引じゃないとね。")
         (wait)
         (text #:color 7 "【" 0 "】（そうか・・・夏子さんは強引な人が好きなのか。）")
         (wait)
         (set-reg: 109 (+ (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】俺の事が・・・嫌いなんだ？")
         (wait)
         (text #:color 2 "【夏子】嫌いだったら、一緒にプールになんか来ないわよ。")
         (wait)
         (text #:color 7 "【" 0 "】だって・・・だって・・・。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、男は自分に自信を持たないとだめ・・・少しぐらい強引な人の方が私は好きよ。")
         (wait)
         (text #:color 7 "【" 0 "】（そうか・・・夏子さんは強引な人が好きなのか。）")
         (wait)))
       (else (<>)))
      (set-reg: 18 1)))
    ((&& (== V 2) (== N 1) (== (: 19) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さんって・・・夏の女神みたいだ。")
      (wait)
      (text #:color 2 "【夏子】あはは・・・ちょっと誉めすぎじゃない？")
      (wait)
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 2 "【夏子】本気でそう言ってくれたの？")
      (wait)
      (set-reg: 101 0)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "もろちん") (text "もちろん") (text "ちもろん") (text "ろちもん")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】もろちんさ・・・。")
         (wait)
         (text #:color 2 "【夏子】なに・・・もろちんって？")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・間違えた。")
         (wait)
         (text #:color 2 "【夏子】あはは、夏の女神だなんて冗談で言ったのよね・・・ちょっと言いすぎだもの。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 2 "【夏子】でも、本気で言ってくれたら・・・すごくうれしかったな。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】もちろんさ・・・嘘を言おうとしても、俺の口が『正直になれ』って命令するんだ。")
         (wait)
         (text #:color 2 "【夏子】あはは・・・夏の女神だなんて、ちょっと言いすぎよ。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 2 "【夏子】でも・・・本当にそう思ってくれたのなら、すごくうれしい。")
         (wait)
         (set-reg: 109 (+ (: 109) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】ちもろんさ・・・。")
         (wait)
         (text #:color 2 "【夏子】なに・・・ちもろんって？")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・間違えた。")
         (wait)
         (text #:color 2 "【夏子】あはは、夏の女神だなんて冗談で言ったのよね・・・ちょっと言いすぎだもの。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 2 "【夏子】でも、本気で言ってくれたら・・・すごくうれしかったな。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】ろちもんさ・・・。")
         (wait)
         (text #:color 2 "【夏子】なに・・・ろちもんって？")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】なんだ？・・・ろちもんって？")
         (wait)
         (text #:color 2 "【夏子】あはは、夏の女神だなんて冗談で言ったのよね・・・ちょっと言いすぎだもの。")
         (wait)
         (text #:color 2 "【夏子】・・・。")
         (wait)
         (text #:color 2 "【夏子】でも、本気で言ってくれたら・・・すごくうれしかったな。")
         (wait)))
       (else (<>)))
      (set-reg: 19 1)))
    ((&& (== V 2) (== N 1) (== (: 20) 0))
     (<>
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【夏子】なんだか・・・暑くなってきたわね。")
      (wait)
      (set-reg: 20 1)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1))
     (<>
      (text #:color 2 "【夏子】" 0 "君・・・そろそろ泳ぎましょうか？")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)))
    ((&& (== V 1) (== N 2) (== (: 21) 0))
     (<>
      (text #:color 7 "【" 0 "】（髪の毛が夏の日差しにキラキラ輝いてる・・・。）")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 2) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】（奇麗だな・・・。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんの顔を見てると・・・甘酸っぱいものがこみ上げてくる。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（別に気分が悪い訳じゃないぜ。）")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 3) (== (: 22) 1))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんって・・・こんなに奇麗だったかな？）")
      (wait)
      (text #:color 7 "【" 0 "】（夏子さんの顔を見つめてると・・・本気で惚れてしまいそうだ。）")
      (wait)))
    ((&& (== V 1) (== N 4) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】（なんか・・・ビーナスの胸って感じだ。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】（どうしたんだろ？・・・俺が女の人の胸を見る時って、必ず性欲のかたまりだったはずだけど・・・変な気分だな。）")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 4) (== (: 23) 1))
     (<>
      (text #:color 7 "【" 0 "】（この胸に触りたいと言うより・・・この胸の中で眠りたいって感じだ。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（俺は・・・いつからマザコンになったんだ？）")
      (wait)))
    ((&& (== V 1) (== N 5) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんにも、当然他の女の子と同じ物が存在してるはずだが・・・。）")
      (wait)
      (text #:color 7 "【" 0 "】（なんだか想像できないな・・・ツルツルの肌しか浮かんでこない。）")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 5) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】（だ、だめだ・・・想像できない。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんって・・・すごいプロポーションだな。）")
      (wait)
      (text
       #:color
       7
       "【"
       0
       "】（こんなにスタイルがよくて、顔が奇麗で、性格だって悪くない女性に・・・彼氏がいないわけがない。）")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 6) (== (: 25) 1))
     (<> (text #:color 7 "【" 0 "】（ウェストはきゅっとしまってる・・・奇麗だ。）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんの脚は長くて奇麗だ・・・太陽の光が、肌にまでキラキラ反射してる。）")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 7) (== (: 26) 1))
     (<> (text #:color 7 "【" 0 "】（奇麗だ・・・こんなに奇麗な脚を見た事がない。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】（この水着・・・夏子さんがデザインしたのかな？）")
      (wait)
      (text #:color 7 "【" 0 "】（それにしても過激だと思うぞ・・・スタイルのいい女性が着ないと、ほとんどギャグになりそうだ。）")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 8) (== (: 27) 1))
     (<> (text #:color 7 "【" 0 "】（泳いでいる時に、はずれないのだろうか・・・不思議だ。）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】（他の男達も夏子さんを見たら・・・俺と同じようなショックを受けるのかな？）")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 9) (== (: 28) 1))
     (<> (text #:color 7 "【" 0 "】（このまま夏子さんを見ていたい・・・時間よ、止まってくれ。）") (wait)))
    ((&& (== V 1) (== N 10) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】（デッキチェアになりたい・・・真剣にそう思うほど、夏子さんは魅力的だ。）")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 10) (== (: 29) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・デッキチェアがうらやましい。）") (wait)))
    ((&& (== V 1) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】（プールの水も・・・夏子さん同様、キラキラ輝いてる。）")
      (wait)
      (set-reg: 30 1)))
    ((&& (== V 1) (== (: 30) 1))
     (<> (text #:color 7 "【" 0 "】（夏だなあ・・・。）") (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))