(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\な
  #\。
  #\い
  #\っ
  #\子
  #\、
  #\う
  #\夏
  #\ん
  #\て
  #\の
  #\し
  #\る
  #\だ
  #\は
  #\た
  #\か
  #\？
  #\に
  #\が
  #\よ
  #\あ
  #\く
  #\そ
  #\も
  #\ー
  #\で
  #\さ
  #\ら
  #\と
  #\わ
  #\ゃ
  #\君
  #\ど
  #\を
  #\れ
  #\す
  #\ち
  #\け
  #\こ
  #\り
  #\え
  #\事
  #\一
  #\ね
  #\じ
  #\ご
  #\！
  #\お
  #\ま
  #\（
  #\）
  #\プ
  #\哉
  #\や
  #\ろ
  #\ル
  #\み
  #\人
  #\ぜ
  #\思
  #\イ
  #\ト
  #\気
  #\つ
  #\コ
  #\リ
  #\ポ
  #\ッ
  #\き
  #\言
  #\私
  #\本
  #\タ
  #\ラ
  #\俺
  #\ょ
  #\ン
  #\ス
  #\物
  #\出
  #\ば
  #\飲
  #\変
  #\食
  #\べ
  #\大
  #\ほ
  #\め
  #\ソ
  #\平
  #\パ
  #\方
  #\供
  #\ふ
  #\何
  #\売
  #\行
  #\げ
  #\ク
  #\せ
  #\怨
  #\前
  #\達
  #\性
  #\ぐ
  #\口
  #\聞
  #\話
  #\基
  #\的
  #\持
  #\間
  #\見
  #\ュ
  #\ず
  #\店)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "58.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 24)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "58an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "58.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (sound 1)
 (set-var I 61)
 (proc 26)
 (set-reg: 835 0)
 (set-arr~ @ 7 0)
 (load "j01.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 539) 1)
   (<>
    (text #:color 7 "【" 0 "】はあはあ、ぜえぜえ・・・。")
    (wait)
    (text #:color 7 "【" 0 "】はあはあ、ふうふう・・・。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "j11.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "j11an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "j11.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 2 "【夏子】" 0 "君・・何も走る事はないと思うけど。")
    (wait)
    (text #:color 7 "【" 0 "】い、いやあ・・・ノドがカラカラで、一刻も早くお茶をしたくてさ。")
    (wait)
    (text #:color 7 "【" 0 "】ほら、あそこに飲物とか売ってるし・・・早く行こうよ。")
    (wait)
    (text #:color 2 "【夏子】わかったわ・・・オイルを塗ってもらったし、私がおごってあげる。")
    (wait)
    (text #:color 7 "【" 0 "】わーい！！")
    (wait)
    (text #:color 2 "【夏子】" 0 "君、座って待ってて。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "58.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 24)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "58an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "58.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "j11.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "j11an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "j11.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 2 "【夏子】ごめんなさい・・・" 0 "君、何が飲みたいの？")
    (wait)
    (text #:color 7 "【" 0 "】俺は、コーラ２本とソフトクリームとポップコーン。")
    (wait)
    (text #:color 2 "【夏子】そ、そんなに・・・平気？")
    (wait)
    (text #:color 7 "【" 0 "】平気、平気・・・全然平気。")
    (wait)
    (text #:color 2 "【夏子】あははは・・・すごく丈夫な胃をしてるのね、今度こそ座って待ってて。")
    (wait)
    (text #:color 7 "【" 0 "】座ってって・・・ああ、あのパラソルのある場所か。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "46.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 9)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "46an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "46.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】うーん・・・夏子さんの水着姿、奇麗だったよなあ。")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 9 (&& (~ @ 9) 65534))
    (set-arr~ @ 6 1)
    (image "j01.pd8")
    (set-arr~ @ 9 (// (~ @ 9) 1))
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "j01an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "j01.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 2 "【夏子】" 0 "君・・・お待たせ。")
    (wait)
    (text #:color 2 "【夏子】えーと、コーラ２本とソフトクリームと・・・ポップコーンね。")
    (wait)
    (text #:color 7 "【" 0 "】あれれ、夏子さんはそれだけ？")
    (wait)
    (text #:color 2 "【夏子】これだけって・・・これが普通なの、" 0 "君がワイルドすぎるのよ。")
    (wait)
    (text #:color 7 "【" 0 "】ごくごくごくごくごくごくごっくん！！・・・ぷはー、おいしかった。")
    (wait)
    (text #:color 2 "【夏子】も、もう飲んじゃったの！？・・・す、すごい。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 50) 0) (text "おかわりする"))
        (if (== (: 50) 1) (text "外に出る"))))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<>
         (text #:color 7 "【" 0 "】夏子さん、おかわり！！")
         (wait)
         (text #:color 2 "【夏子】おかわりって・・・もうやめた方がいいんじゃない？")
         (wait)
         (text #:color 7 "【" 0 "】そうか・・・俺におごるのがいやなんだな。")
         (wait)
         (text #:color 2 "【夏子】違うってば、お腹をこわすわよ。")
         (wait)
         (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 7 "【" 0 "】夏子さん、おかわり！！")
         (wait)
         (text #:color 2 "【夏子】もうよしなさい。")
         (wait)
         (text #:color 7 "【" 0 "】ちぇっ・・・泣くぞ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 2 "【夏子】" 0 "君、すごく楽しかったわ・・・お礼のつもりだったのに、私の方が楽しんじゃったみたい。")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・俺も・・・うっ！！")
         (wait)
         (text #:color 2 "【夏子】うっ・・・て、なに？")
         (wait)
         (text #:color 7 "【" 0 "】な、なんでもない・・・外に出ようぜ。")
         (wait)
         (field 14 1 1)
         (field 13 0 0)
         (field 13 1 1)
         (set-reg: 1001 0)
         (set-var N 15)
         (set-reg: 543 1)
         (slot 1 3)
         (mes-jump "town1.mes")))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 2 "【夏子】ふう・・・楽しかった。")
      (wait)
      (text #:color 7 "【" 0 "】夏子さん、背中がヒリヒリしない？")
      (wait)
      (text #:color 2 "【夏子】平気よ、" 0 "君がたっぷりオイルを塗ってくれたから。")
      (wait)
      (text #:color 7 "【" 0 "】なんだったら、毎日塗ってあげてもいいよ。")
      (wait)
      (text #:color 2 "【夏子】あはは・・・そんな事をしたら、洋服がオイルでベトベトになっちゃうわ。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 12) 0))
     (<>
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】どうしたの？")
      (wait)
      (text #:color 2 "【夏子】うん・・・一哉君とくるみちゃん、どうなっちゃうのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】さあね、自然にまかすしかないんじゃない？")
      (wait)
      (text #:color 2 "【夏子】そうだけど・・・くるみちゃん、私の事を怨んでないかしら？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "怨んでいる") (text "怨んでない") (text "呪ってる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そりゃあ怨むさ・・・なんったて好きな男を取っちゃったんだもんな。")
         (wait)
         (text #:color 2 "【夏子】取ってないわよ、前にも言ったと思うけど、一哉君と私はただのお友達なの。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】平気じゃないか・・・くるみちゃんって、すごくいい子だし。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君、女ってね・・・どんなにいい子でも、男の事になると変わるもんなのよ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】怨むどころか、すでに呪ってたりして・・・ははは。")
         (wait)
         (text #:color 2 "【夏子】冗談じゃないわよ・・・恐くて眠れなくなっちゃうじゃない。")
         (wait)))
       (else (<>)))
      (set-reg: 12 1)))
    ((&& (== V 2) (== N 1) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】そこまで考えるなら、どうして一哉とデートなんかしてるんだよ。")
      (wait)
      (text #:color 2 "【夏子】だって・・・彼って母性本能をくすぐるじゃない。")
      (wait)
      (text #:color 7 "【" 0 "】（なるほど・・・夏子さんって母性本能の強いタイプなんだ。）")
      (wait)
      (text #:color 2 "【夏子】歳下の男の子から、相談があるって言われたら・・・断れないでしょう？")
      (wait)
      (text #:color 7 "【" 0 "】俺が相談があるって言ったら、やっぱり断れない？")
      (wait)
      (text #:color 2 "【夏子】あはははっ・・・" 0 "君って悩みがなさそうですもの。")
      (wait)
      (text #:color 7 "【" 0 "】ひ、ひどい・・・。")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 2) (== N 1) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】一哉のやつ・・・本気で夏子さんが好きなんだぜ。")
      (wait)
      (text #:color 2 "【夏子】私だって好きよ、もっとも友達としてだけど。")
      (wait)
      (text #:color 7 "【" 0 "】一哉はそう思ってないよ・・・絶対に。")
      (wait)
      (text #:color 2 "【夏子】そう考えると、もう会わない方がいいのかしら？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "その通り") (text "そんな事はない") (text "どっちでもいい")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そうだな・・・会わない方がいいんじゃないか？")
         (wait)
         (text #:color 2 "【夏子】でも私って、甘えられると断れないから・・・。")
         (wait)
         (text #:color 7 "【" 0 "】変わりに俺が言ってやろう。")
         (wait)
         (text #:color 2 "【夏子】だめ・・・" 0 "君の口から言ったら、一哉君すっごく傷ついちゃうわよ。")
         (wait)))
       ((== N 2)
        (<>
         (text
          #:color
          7
          "【"
          0
          "】そんな事はないさ・・・ようするに、夏子さんが友達として考えてる事を、一哉に伝えればいいだけだろ？")
         (wait)
         (text #:color 2 "【夏子】伝えてるんだけど・・・ね。")
         (wait)
         (text #:color 7 "【" 0 "】まあ、素直にそうですかとは言えないよな・・・一哉だって。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】どっちでもいいさ・・・俺には関係のない事だ。")
         (wait)
         (text #:color 2 "【夏子】関係ないって・・・私とこうしてるわけだし、一哉君はあなたの友達じゃない。")
         (wait)
         (text #:color 7 "【" 0 "】あ・・・そうか。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君って、けっこうクールなのね。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       (else (<>)))
      (set-reg: 14 1)))
    ((&& (== V 2) (== N 1) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（ポップコーンを食べようと思うんだが・・・どうやって食べようかな？）")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "喋りながら") (text "一口で食べる") (text "行儀よく食べる")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】一哉のやつ、ばりばりばりばりばり・・・あれでけっこうデリケートなんだぜ。")
         (wait)
         (text #:color 2 "【夏子】子供よね。")
         (wait)
         (text #:color 7 "【" 0 "】そうなんだ、一哉は子供さ。")
         (wait)
         (text #:color 2 "【夏子】違うわよ、" 0 "君の事・・・ほらあ、ぽろぽろポップコーンをこぼしちゃって。")
         (wait)
         (text #:color 7 "【" 0 "】ははは・・・ごめん。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】ごっ・・・くん。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君・・・一口で全部食べちゃったの！？")
         (wait)
         (text #:color 7 "【" 0 "】ああ、おいしかった。")
         (wait)
         (text #:color 2 "【夏子】" 0 "君って、すごいと思う・・・。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】いただきます。")
         (wait)
         (text #:color 2 "【夏子】え？")
         (wait)
         (text #:color 7 "【" 0 "】ポップコーンを食べますけど・・・よろしいですか？")
         (wait)
         (text #:color 2 "【夏子】別に断らなくてもいいのに。")
         (wait)
         (text #:color 7 "【" 0 "】それでは・・・ポリ。")
         (wait)
         (text #:color 7 "【" 0 "】ポリ。")
         (wait)
         (text #:color 7 "【" 0 "】ポリ。")
         (wait)
         (text #:color 7 "【" 0 "】ポリ。")
         (wait)
         (text #:color 2 "【夏子】ねえ、ポップコーンを一つづつ食べるのは・・・よしましょ？")
         (wait)
         (text #:color 7 "【" 0 "】ごちそうさまでした。")
         (wait)
         (set-reg: 109 (- (: 109) 1))))
       (else (<>)))
      (set-reg: 15 1)))
    ((&& (== V 2) (== N 1) (== (: 16) 0))
     (<>
      (text #:color 2 "【夏子】くるみちゃんって、どんな子なの？")
      (wait)
      (text #:color 7 "【" 0 "】一哉から聞いてるんだろ？")
      (wait)
      (text #:color 2 "【夏子】ほら・・・一哉君って、くるみちゃんの事を話したがらないのよ。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・そうなんだ。")
      (wait)
      (text #:color 2 "【夏子】あははっ・・・その変わり、" 0 "君の事はやたらに話したがるけどね。")
      (wait)
      (text #:color 7 "【" 0 "】ちぇっ、どうせロクな事を言ってないだろ？")
      (wait)
      (text #:color 2 "【夏子】ううん、そんな事はないわよ・・・一哉君から" 0 "君の悪口を聞いた事がないもの。")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 2) (== N 1) (== (: 17) 0))
     (<>
      (text #:color 2 "【夏子】ねえ・・・くるみちゃんってどんな子？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・いい子だぜ。")
      (wait)
      (text #:color 2 "【夏子】いい子だけじゃわからないわ・・・性格は？")
      (wait)
      (text #:color 7 "【" 0 "】性格ねえ・・・基本的には大人しいと思うけど。")
      (wait)
      (text #:color 2 "【夏子】けど？")
      (wait)
      (text #:color 7 "【" 0 "】そうだなあ・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show
       (<.> (text "気が強いタイプ") (text "根に持つタイプ") (text "我慢するタイプ") (text "瞬間湯沸器")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】基本的には大人しくて・・・でも、けっこう気が強いんじゃないか？")
         (wait)
         (text
          #:color
          2
          "【夏子】私もね、そんな気がするのよ・・・一哉君からちょっと聞いたけど、一度決めた事は曲げない性格だって言ってたわ。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】基本的には大人しくて・・・でも、けっこう根に持つタイプじゃないかな。")
         (wait)
         (text #:color 2 "【夏子】え、根に持つタイプなの！？・・・私が一番苦手なタイプだわ。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】基本的には大人しくて・・・なおかつ我慢するタイプなんじゃないかな。")
         (wait)
         (text #:color 2 "【夏子】そう・・・なんだかかわいそうになってくるわね。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】基本的には大人しく見えるけど・・・実は瞬間湯沸器なんだ。")
         (wait)
         (text #:color 2 "【夏子】瞬間湯沸器って・・・まさか、漫才師の『横△や○し』みたいな人って事！？")
         (wait)
         (text #:color 7 "【" 0 "】うんうん、ピッタリだな。")
         (wait)
         (text #:color 2 "【夏子】やだあ・・・信じられない。")
         (wait)))
       (else (<>)))
      (set-reg: 17 1)))
    ((&& (== V 2) (== N 1) (== (: 18) 0))
     (<>
      (text #:color 2 "【夏子】" 0 "君、もう一哉君の話はよしましょうよ・・・せっかくの気分が暗くなってきちゃう。")
      (wait)
      (text #:color 7 "【" 0 "】一哉の話題を出したのは、夏子さんの方だぜ・・・人のせいにしないでくれよう。")
      (wait)
      (text #:color 2 "【夏子】あ、そうだったわね・・・ごめんなさい。")
      (wait)
      (text #:color 7 "【" 0 "】（あれ・・・？）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（おや・・・？）")
      (wait)
      (text #:color 2 "【夏子】どうしたの？")
      (wait)
      (text #:color 7 "【" 0 "】い、いや・・・なんでもない。")
      (wait)
      (set-var A 1)
      (proc 13)
      (proc 11)
      (set-reg: 18 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 0))
     (<>
      (text #:color 2 "【夏子】さーて・・・そろそろ帰りましょうか。")
      (wait)
      (text #:color 7 "【" 0 "】う、うん・・・。")
      (wait)
      (text #:color 2 "【夏子】どうしたの？・・・額に汗をかいているわよ。")
      (wait)
      (text #:color 7 "【" 0 "】（なんだか・・・お腹が痛くなってきちゃった。）")
      (wait)
      (text #:color 2 "【夏子】行きましょ？")
      (wait)
      (text #:color 7 "【" 0 "】う、うん・・・。")
      (wait)
      (set-reg: 50 1)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<>
      (text #:color 2 "【夏子】どうしたの・・・行かないの？")
      (wait)
      (text #:color 7 "【" 0 "】行くよ・・・帰ろう。")
      (wait)
      (text #:color 2 "【夏子】なんか変ねえ・・・。")
      (wait)))
    ((== (: 50) 1)
     (<> (text #:color 7 "【" 0 "】（見てる時間はないぞ・・・そそうをする前に、早く帰った方がいいな。）") (wait)))
    ((&& (== V 1) (== N 2) (== (: 20) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんは・・・俺の事を見てるな。）")
      (wait)
      (text #:color 2 "【夏子】なに？・・・" 0 "君。")
      (wait)
      (text #:color 7 "【" 0 "】い、いいや・・・なんでもないよ。")
      (wait)
      (set-reg: 20 1)))
    ((&& (== V 1) (== N 2) (== (: 20) 1))
     (<> (text #:color 7 "【" 0 "】（夏子さんは・・・美人だ。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 21) 0))
     (<>
      (text #:color 2 "【夏子】プールに入ったから、今日はトリートメントしないと・・・私の髪ってすぐに傷むのよ。")
      (wait)
      (set-reg: 21 1)))
    ((&& (== V 1) (== N 3) (== (: 21) 1))
     (<> (text #:color 7 "【" 0 "】（黒くて長い髪、大きな黒い瞳・・・エキゾチックだなあ。）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 22) 0))
     (<>
      (text #:color 7 "【" 0 "】（水着姿が思い出される・・・。）")
      (wait)
      (text #:color 2 "【夏子】" 0 "君・・・変な事を考えてるでしょう？")
      (wait)
      (text #:color 7 "【" 0 "】ど、どうして！？")
      (wait)
      (text #:color 2 "【夏子】だって、口を半開きにしたままで・・・目がウツロになってたわよ。")
      (wait)
      (set-reg: 22 1)))
    ((&& (== V 1) (== N 4) (== (: 22) 1))
     (<> (text #:color 7 "【" 0 "】（ああ・・・今晩思い出しながら、イッパツ抜いてしまいそうだ。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 23) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんって、手にも表情があるんだよな・・・色っぽいぜ。）")
      (wait)
      (text #:color 2 "【夏子】やだ・・・黙ってないで、何か喋ってよ。")
      (wait)
      (set-reg: 23 1)))
    ((&& (== V 1) (== N 5) (== (: 23) 1))
     (<> (text #:color 7 "【" 0 "】（奇麗だな手だな・・・すりすりしたい。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 24) 0))
     (<>
      (text #:color 7 "【" 0 "】（夏子さんを見てると・・・学校の女の子達が子供に見えてしまうな。）")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】（そりゃそうだ、実際に歳下だもんな・・・うん。）")
      (wait)
      (set-reg: 24 1)))
    ((&& (== V 1) (== N 6) (== (: 24) 1))
     (<> (text #:color 7 "【" 0 "】（夏子さんは・・・好きな人がいないのかな？）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 25) 0))
     (<>
      (text #:color 7 "【" 0 "】（変な色をしたジュースに、カラフルなストローがささってるな。）")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、これっておいしいわよ。")
      (wait)
      (text #:color 7 "【" 0 "】なんのジュースなの？")
      (wait)
      (text #:color 2 "【夏子】とってもへるしいな、キュウリのジュースなの・・・飲んでみる？")
      (wait)
      (text #:color 7 "【" 0 "】どれどれ・・・じうじうじう。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 2 "【夏子】どう？")
      (wait)
      (text #:color 7 "【" 0 "】まずい。")
      (wait)
      (set-reg: 25 1)))
    ((&& (== V 1) (== N 7) (== (: 25) 1))
     (<>
      (text #:color 7 "【" 0 "】（まずいジュースに、カラフルなストローがささってる、ぺっぺっ。）")
      (wait)
      (text #:color 2 "【夏子】" 0 "君がまずいって言う事は・・・大人の飲物なのね、きっと。")
      (wait)))
    ((&& (== V 1) (== N 8) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、このパラソル・・・欲しくない？")
      (wait)
      (text #:color 2 "【夏子】こんな物をもらっても、使い道がないと思うけど。")
      (wait)
      (text #:color 7 "【" 0 "】そうかなあ・・・少なくても、パラソルとしては使えるぜ。")
      (wait)
      (text #:color 2 "【夏子】当り前じゃない・・・もう。")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 8) (== (: 26) 1))
     (<> (text #:color 7 "【" 0 "】（これがないと、日射病になれそうだ・・・。）") (wait)))
    ((&& (== V 1) (== N 9) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】パラソルを支えてる鉄の棒だ・・・表面にはメッキがしたあり、所々にサビが浮いている。")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、誰かに説明しているの？")
      (wait)
      (text #:color 7 "【" 0 "】もちろん夏子さんにだよ、はっはっはっ。")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 9) (== (: 27) 1))
     (<> (text #:color 7 "【" 0 "】傘で言えば『柄』の部分だな、うん。") (wait)))
    ((&& (== V 1) (== N 10) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】うーん、みんな楽しんでるかいっ！！")
      (wait)
      (text #:color 2 "【夏子】" 0 "君、人の事はいいの・・・せっかくのデートなんだからお話をしましょうよ。")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 10) (== (: 28) 1))
     (<>
      (text #:color 7 "【" 0 "】人の人生には、それぞれの物語がある・・・なるほどね。")
      (wait)
      (text #:color 2 "【夏子】へえ、詩人ね・・・" 0 "君って。")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、あそこの売店で飲物を買ったの？")
      (wait)
      (text #:color 2 "【夏子】そうよ・・・どうして？")
      (wait)
      (text #:color 7 "【" 0 "】あの店・・・この間、客が死んだんだぜ。")
      (wait)
      (text #:color 2 "【夏子】う、嘘っ！？・・・どうして！？")
      (wait)
      (text #:color 7 "【" 0 "】日本語って不思議だな・・・嘘と言いつつ、理由を聞きたがるのは何故だ？")
      (wait)
      (text #:color 2 "【夏子】もう・・・からかわないでよ。")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 11) (== (: 29) 1))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、あそこの売店で飲物を買ったんでしょ？")
      (wait)
      (text #:color 2 "【夏子】ううん、もっとずーっと遠くの売店。")
      (wait)
      (text #:color 7 "【" 0 "】ずーっと遠くの売店でも、客に死人が出たんだぜ。")
      (wait)
      (text #:color 2 "【夏子】いいかげんにしなさい。")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、ループコースターに乗ろうぜ。")
      (wait)
      (text #:color 2 "【夏子】苦手なのよ・・・すぐに酔っちゃうの。")
      (wait)
      (text #:color 7 "【" 0 "】じゃあ・・・俺に乗らない？")
      (wait)
      (text #:color 2 "【夏子】いやらしいわよ、" 0 "君。")
      (wait)
      (set-reg: 30 1)))
    ((&& (== V 1) (== N 12) (== (: 30) 1))
     (<>
      (text #:color 7 "【" 0 "】夏子さん、あのループコースターのレールの上を走ったら・・・俺とキスしてくれる？")
      (wait)
      (text #:color 2 "【夏子】一哉君から聞いてるけど、色々とおかしな事をするんですってね・・・" 0 "君って。")
      (wait)
      (text #:color 7 "【" 0 "】みんなが笑ってくれるなら、俺は何でもしちゃうぜ。")
      (wait)
      (text #:color 2 "【夏子】笑う前に心配しちゃうわよ。")
      (wait)
      (set-reg: 30 2)))
    ((&& (== V 1) (== N 12) (== (: 30) 2))
     (<> (text #:color 2 "【夏子】そこでじっとしてなさい。") (wait)))
    ((&& (== V 1) (== N 13) (== (: 31) 0))
     (<>
      (text #:color 7 "【" 0 "】子供の頃に買ってもらったポップコーンて・・・なんか特別な味がしたよな。")
      (wait)
      (text #:color 2 "【夏子】そうね・・・子供の頃の思い出って、そんな感覚があるものよ。")
      (wait)
      (text #:color 7 "【" 0 "】うん・・・。")
      (wait)
      (set-reg: 31 1)))
    ((&& (== V 1) (== N 13) (== (: 31) 1))
     (<>
      (text #:color 7 "【" 0 "】（ポップコーンをおふくろが買ってくれたんだっけ・・・確かデパートの屋上だったよな。）")
      (wait)
      (text #:color 2 "【夏子】" 0 "君・・・素敵な目をしてるわよ、ちょっと寂しそうで。")
      (wait)))
    ((&& (== V 1) (== N 14) (== (: 32) 0))
     (<>
      (text #:color 7 "【" 0 "】夏子さん・・・ここは遊園地だよね？")
      (wait)
      (text #:color 2 "【夏子】そうよ、変な" 0 "君・・・。")
      (wait)
      (text #:color 7 "【" 0 "】子供の頃、遊園地に来た事がある？")
      (wait)
      (text #:color 2 "【夏子】うん・・・あると思うけど、あまり覚えてないわね。")
      (wait)
      (set-reg: 32 1)))
    ((&& (== V 1) (== N 14) (== (: 32) 1))
     (<>
      (text #:color 7 "【" 0 "】遊園地だ・・・ここって色々な思い出をつくる場所なんだろうな。")
      (wait)
      (text #:color 2 "【夏子】そうね・・・。")
      (wait)))
    ((&& (== V 1) (== N 15) (== (: 33) 0))
     (<>
      (text #:color 7 "【" 0 "】なんだ、ありゃ？")
      (wait)
      (text #:color 2 "【夏子】ほら、ぐるぐる回って・・・遠心力でぱっと開く乗物じゃない？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】みんな・・・今の説明でわかったか？")
      (wait)
      (text #:color 2 "【夏子】もう・・・二度と教えてあげない。")
      (wait)
      (set-reg: 33 1)))
    ((&& (== V 1) (== N 15) (== (: 33) 1))
     (<>
      (text #:color 7 "【" 0 "】なんだろう、あの乗物は？")
      (wait)
      (text #:color 2 "【夏子】知らない。")
      (wait)
      (text #:color 7 "【" 0 "】ははは、怒っちゃったよ。")
      (wait)
      (text #:color 2 "【夏子】別に怒ってないわよ・・・" 0 "君が私の事をからかうからいけないの。")
      (wait)))
    ((&& (== V 1) (== N 16) (== (: 34) 0))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・緑が気持ちいいな。")
      (wait)
      (text #:color 2 "【夏子】緑って・・・女の子の名前？")
      (wait)
      (text #:color 7 "【" 0 "】そう解釈されると、すっごくいやらしい事を言ったみたいだ。")
      (wait)
      (set-reg: 34 1)))
    ((&& (== V 1) (== N 16) (== (: 34) 1))
     (<>
      (text #:color 7 "【" 0 "】うーん・・・夏子さんが気持ちいいっ！！")
      (wait)
      (text #:color 2 "【夏子】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】あれれ・・・受けなかったようだぞ。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))