(mes
 (meta (engine 'AI5) (charset "pc98") (dictbase 128))
 (dict
  #\・
  #\【
  #\】
  #\。
  #\い
  #\舞
  #\な
  #\っ
  #\の
  #\か
  #\て
  #\ん
  #\、
  #\し
  #\う
  #\だ
  #\た
  #\？
  #\る
  #\あ
  #\に
  #\は
  #\と
  #\ら
  #\ゃ
  #\ち
  #\が
  #\も
  #\れ
  #\君
  #\わ
  #\で
  #\き
  #\ま
  #\を
  #\よ
  #\く
  #\そ
  #\（
  #\）
  #\ー
  #\事
  #\！
  #\り
  #\俺
  #\す
  #\や
  #\け
  #\ッ
  #\ね
  #\ど
  #\私
  #\人
  #\言
  #\プ
  #\子
  #\じ
  #\お
  #\え
  #\パ
  #\ン
  #\好
  #\さ
  #\せ
  #\達
  #\手
  #\コ
  #\ょ
  #\ろ
  #\気
  #\つ
  #\ず
  #\夏
  #\こ
  #\ル
  #\ポ
  #\何
  #\一
  #\イ
  #\来
  #\女
  #\今
  #\乗
  #\話
  #\明
  #\ぜ
  #\緒
  #\色
  #\ト
  #\ひ
  #\変
  #\タ
  #\生
  #\分
  #\め
  #\ク
  #\恋
  #\み
  #\ラ
  #\げ
  #\美
  #\秘
  #\書
  #\ご
  #\屋
  #\誰
  #\ス)
 (set-arr~ @ 7 1)
 (set-arr~ @ 3 0)
 (set-arr~ @ 2 45056)
 (set-arr~ @ 7 0)
 (load "mouse.dat" 49152)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 9 (&& (~ @ 9) 65534))
 (set-arr~ @ 6 1)
 (image "46.pd8")
 (set-arr~ @ 9 (// (~ @ 9) 1))
 (proc 9)
 (set-arr~ @ 7 1)
 (set-arr~ @ 1 4096)
 (set-arr~ @ 6 1)
 (image "46an.pd8")
 (set-arr~ @ 6 0)
 (set-arr~ @ 7 0)
 (load "46.s4" (~ @ 2))
 (animate 0 0 0)
 (animate 1 0)
 (set-arr~ @ 7 0)
 (set-arr~ @ 7 0)
 (load "v06.a6" 47104)
 (set-reg: 10 0)
 (set-reg: 11 0)
 (set-reg: 12 0)
 (set-reg: 13 0)
 (set-reg: 14 0)
 (set-reg: 15 0)
 (set-reg: 16 0)
 (set-reg: 17 0)
 (set-reg: 18 0)
 (set-reg: 19 0)
 (set-reg: 20 0)
 (set-reg: 21 0)
 (set-reg: 22 0)
 (set-reg: 23 0)
 (set-reg: 24 0)
 (set-reg: 25 0)
 (set-reg: 26 0)
 (set-reg: 27 0)
 (set-reg: 28 0)
 (set-reg: 29 0)
 (set-reg: 30 0)
 (set-reg: 31 0)
 (set-reg: 32 0)
 (set-reg: 33 0)
 (set-reg: 34 0)
 (set-reg: 35 0)
 (set-reg: 36 0)
 (set-reg: 37 0)
 (set-reg: 38 0)
 (set-reg: 39 0)
 (set-reg: 40 0)
 (set-reg: 41 0)
 (set-reg: 42 0)
 (set-reg: 43 0)
 (set-reg: 44 0)
 (set-reg: 45 0)
 (set-reg: 46 0)
 (set-reg: 47 0)
 (set-reg: 48 0)
 (set-reg: 49 0)
 (set-reg: 50 0)
 (if (== (: 762) 1)
   (<>
    (text #:color 7 "【" 0 "】ふう・・・。")
    (wait)
    (text #:color 7 "【" 0 "】・・・。")
    (wait)
    (text #:color 7 "【" 0 "】ひっひっひっ・・・舞ちゃんの胸のふくらみを感じてしまった。")
    (wait)
    (text #:color 7 "【" 0 "】ああ、俺の胸に手がついてたら・・・どんなにいいか。")
    (wait)
    (text #:color 3 "【舞】胸に手って・・・何？")
    (wait)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "v06.pd8")
    (proc 25)
    (set-arr~ @ 7 1)
    (set-arr~ @ 1 4096)
    (set-arr~ @ 6 1)
    (image "v06an.pd8")
    (set-arr~ @ 6 0)
    (set-arr~ @ 7 0)
    (load "v06.s4" (~ @ 2))
    (animate 0 0 0)
    (animate 1 0)
    (set-arr~ @ 7 0)
    (text #:color 7 "【" 0 "】あわわわっ・・・な、なんでもないよ。")
    (wait)
    (text #:color 3 "【舞】はい、" 0 "君・・・コーラ。")
    (wait)
    (text #:color 7 "【" 0 "】あ、ありがと。")
    (wait)
    (text #:color 3 "【舞】今日つき合ってくれた、ささやかなお礼よ。")
    (wait)
    (text #:color 7 "【" 0 "】つき合ってくれたって・・・俺が誘ったんじゃないか。")
    (wait)
    (text #:color 3 "【舞】いいの・・・私は今日から変われるんだから。")
    (wait)
    (text #:color 7 "【" 0 "】変われる？")
    (wait)
    (text #:color 3 "【舞】そう、" 0 "君のおかげだわ。")
    (wait)))
 (while
  (== 1 1)
  (<>
   (proc 17)
   (menu-show (<>))
   (set-arr~ @ 20 (+ (&& (~ @ 20) 65280) 0))
   (set-arr~ @ 21 (+ 512 16))
   (set-arr~ @ 20 (// (&& (~ @ 20) 65399) 128))
   (set-arr~ @ 20 (&& (~ @ 20) 4095))
   (color 8)
   (set-arr~ @ 6 0)
   (set-arr~ @ 13 15 322 64 391)
   (clear)
   (cond
    ((== V 0)
     (<>
      (set-reg: 101 1)
      (proc 18)
      (menu-show
       (<.>
        (if (== (: 50) 0) (text "乗物に乗る"))
        (if (== (: 50) 1) (text "外に出る"))))
      (cond
       ((&& (== N 1) (== (: 10) 0))
        (<> (text #:color 3 "【舞】" 0 "君・・・少し休みましょうよ。") (wait) (set-reg: 10 1)))
       ((&& (== N 1) (== (: 10) 1))
        (<>
         (text #:color 3 "【舞】" 0 "君・・・私と話すのがいや？")
         (wait)
         (text #:color 7 "【" 0 "】そんな事はないよ・・・。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 3 "【舞】とっても楽しかった・・・。")
         (wait)
         (text #:color 7 "【" 0 "】俺もさ・・・今までで一番幸せな一日だったな。")
         (wait)
         (text #:color 3 "【舞】あのね・・・私・・・。")
         (wait)
         (text #:color 7 "【" 0 "】俺・・・舞ちゃんの事が・・・。")
         (wait)
         (text #:color 3 "【舞】私ね・・・" 0 "君の事を・・・。")
         (wait)
         (text #:color 6 "【美人秘書】お嬢様っ！！・・・やっと見つけましたわっ！！")
         (wait)
         (text #:color 3 "【舞】きゃっ！？・・・またパパの秘書だわ。")
         (wait)
         (text #:color 7 "【" 0 "】（な、なんてタイミングの悪いねーちゃんだっ！！）")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・逃げましょっ！！")
         (wait)
         (text #:color 7 "【" 0 "】ま、またか・・・。")
         (wait)
         (field 14 1 1)
         (field 13 0 0)
         (field 13 1 1)
         (set-reg: 1001 0)
         (set-var N 15)
         (set-reg: 763 1)
         (mouse 4 49152)
         (mouse 0)
         (slot 1 3)
         (mes-jump "town1.mes")))
       (else (<>)))))
    ((&& (== V 2) (== N 1) (== (: 11) 0))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん、変われるって・・・何が変われるの？")
      (wait)
      (text #:color 3 "【舞】私ね、" 0 "君みたいに生きるの・・・いつも明るく、くよくよしないで。")
      (wait)
      (text #:color 7 "【" 0 "】俺と同じに生きると、まわりから『馬鹿』って言われるぜ。")
      (wait)
      (text #:color 3 "【舞】あはは・・・それでもいいの。")
      (wait)
      (set-reg: 11 1)))
    ((&& (== V 2) (== N 1) (== (: 11) 1))
     (<>
      (text #:color 3 "【舞】" 0 "君って、昔からそうだったの？")
      (wait)
      (text #:color 7 "【" 0 "】馬鹿って事？")
      (wait)
      (text #:color 3 "【舞】もう、違うわよ・・・昔からそんなに明るかったの？")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "明るかった") (text "暗かった")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】明るかったなあ・・・自分でも不思議なくらい。")
         (wait)
         (text #:color 3 "【舞】持って生まれた性格なのね、きっと。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】昔は暗かったんだ・・・すっごく。")
         (wait)
         (text #:color 3 "【舞】本当？・・・信じられないわ。")
         (wait)
         (text #:color 7 "【" 0 "】うんうん、俺も信じられない。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・暗かったって嘘でしょ？")
         (wait)))
       (else (<>)))
      (set-reg: 11 2)))
    ((&& (== V 2) (== N 1) (== (: 11) 2))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん・・・お化け屋敷の中で、何を言おうとしたの？")
      (wait)
      (text #:color 3 "【舞】え・・・何の事かしら？")
      (wait)
      (text #:color 7 "【" 0 "】ずっと・・・の続き。")
      (wait)
      (text #:color 3 "【舞】ずっと・・・。")
      (wait)
      (text #:color 7 "【" 0 "】ずっと・・・？")
      (wait)
      (text #:color 3 "【舞】ずっと・・・内緒。")
      (wait)
      (text #:color 7 "【" 0 "】なんだそりゃ。")
      (wait)
      (set-reg: 11 3)))
    ((&& (== V 2) (== N 1) (== (: 11) 3))
     (<>
      (text #:color 3 "【舞】だって・・・恥ずかしいもの。")
      (wait)
      (text #:color 7 "【" 0 "】なにが恥ずかしいんだよう・・・。")
      (wait)
      (text #:color 3 "【舞】私・・・" 0 "君の胸に。")
      (wait)
      (text #:color 7 "【" 0 "】いやあ、あれは・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "うれしかった") (text "臭かった") (text "悲しかった")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】うれしかったなあ。")
         (wait)
         (text #:color 3 "【舞】私も・・・うれしかった。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】臭かったなあ。")
         (wait)
         (text #:color 3 "【舞】え！？")
         (wait)
         (text #:color 7 "【" 0 "】な、なんでもない・・・。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】悲しかったなあ・・・。")
         (wait)
         (text #:color 3 "【舞】どうして悲しいの？")
         (wait)
         (text #:color 7 "【" 0 "】・・・。")
         (wait)
         (text #:color 7 "【" 0 "】どうしてだろう？")
         (wait)))
       (else (<>)))
      (set-reg: 11 4)))
    ((&& (== V 2) (== N 1) (== (: 11) 4))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん・・・あと少しで夏も終りだね。")
      (wait)
      (text #:color 3 "【舞】ええ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】最後の夏か・・・。")
      (wait)
      (text #:color 3 "【舞】学生生活の最後の夏ね・・・。")
      (wait)
      (text #:color 7 "【" 0 "】来年は・・・どういう夏になってるんだろ？")
      (wait)
      (text #:color 3 "【舞】大丈夫、きっと素敵な夏よ。")
      (wait)
      (text #:color 7 "【" 0 "】へえ・・・いい事を言うな。")
      (wait)
      (text #:color 3 "【舞】さっき言ったでしょう？・・・" 0 "君と同じように、明るく考える事にしたの。")
      (wait)
      (set-reg: 11 5)))
    ((&& (== V 2) (== N 1) (== (: 11) 5))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんの好きなタイプって・・・どんな人なの？")
      (wait)
      (text #:color 3 "【舞】どうしてそんな事を聞くの？")
      (wait)
      (text #:color 7 "【" 0 "】そりゃあ・・・興味があるからさ。")
      (wait)
      (text #:color 3 "【舞】私の好きなタイプは・・・好きになった人がタイプよ。")
      (wait)
      (text #:color 7 "【" 0 "】ずるいや、それって。")
      (wait)
      (text #:color 3 "【舞】じゃあ・・・" 0 "君は？")
      (wait)
      (text #:color 7 "【" 0 "】俺は・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "上手な女の子") (text "明るい女の子") (text "優しい女の子")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】俺は・・・上手な女の子がいいな。")
         (wait)
         (text #:color 3 "【舞】何が上手なのか・・・よくわからないけど。")
         (wait)
         (text #:color 7 "【" 0 "】色々と上手な子だよ、料理とか・・・色々とね。")
         (wait)
         (text #:color 3 "【舞】やだ、" 0 "君って結婚相手の話しをしてるみたい。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】明るい女の子がいいな・・・いつもニコニコしている子。")
         (wait)
         (text #:color 3 "【舞】まるでこれからの私みたい。")
         (wait)
         (text #:color 7 "【" 0 "】舞ちゃんの場合は、今のままでも大好きだぜ。")
         (wait)
         (text #:color 3 "【舞】・・・。")
         (wait)
         (text #:color 3 "【舞】ありがとう・・・。")
         (wait)))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】優しい子がいいな・・・一緒にいると、気が休まる子がいい。")
         (wait)
         (text #:color 3 "【舞】美穂ちゃんとか？")
         (wait)
         (text #:color 7 "【" 0 "】美穂ちゃんか・・・ちょっと幼いかな。")
         (wait)
         (text #:color 3 "【舞】じゃあ、真子先生とか？")
         (wait)
         (text #:color 7 "【" 0 "】ちょっとアダルトすぎるかな。")
         (wait)
         (text #:color 3 "【舞】じゃあ・・・私とか？")
         (wait)
         (text #:color 7 "【" 0 "】うん・・・舞ちゃんがいい。")
         (wait)))
       (else (<>)))
      (set-reg: 11 6)))
    ((&& (== V 2) (== N 1) (== (: 11) 6))
     (<>
      (text #:color 3 "【舞】" 0 "君って、女の子に人気があるのに・・・どうして彼女がいないの？")
      (wait)
      (text #:color 7 "【" 0 "】いるさ、目の前に・・・。")
      (wait)
      (text #:color 3 "【舞】もう・・・本気にするわよ。")
      (wait)
      (text #:color 7 "【" 0 "】いいよ、本気にしても・・・ただし条件があるぜ。")
      (wait)
      (text #:color 3 "【舞】何かしら？")
      (wait)
      (text #:color 7 "【" 0 "】俺の事を本気で好きになってくれ・・・。")
      (wait)
      (text #:color 3 "【舞】そういう事を言う時の、" 0 "君の目って・・・。")
      (wait)
      (text #:color 7 "【" 0 "】天使のようだろ？")
      (wait)
      (text #:color 3 "【舞】ううん、獲物を狙う獣のよう。")
      (wait)
      (text #:color 7 "【" 0 "】ひ、ひどい・・・。")
      (wait)
      (text #:color 3 "【舞】あははっ・・・冗談だからね。")
      (wait)
      (set-reg: 11 7)))
    ((&& (== V 2) (== N 1) (== (: 40) 0))
     (<>
      (text #:color 3 "【舞】" 0 "君・・・ありがとう。")
      (wait)
      (text #:color 7 "【" 0 "】へ？")
      (wait)
      (text #:color 3 "【舞】私・・・すごく楽しいの。")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 3 "【舞】" 0 "君と一緒にいるだけで・・・すごく楽しい。")
      (wait)
      (text #:color 7 "【" 0 "】（言うんだ・・・舞ちゃんに『好きだ』って。）")
      (wait)
      (text #:color 3 "【舞】・・・。")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃん・・・。")
      (wait)
      (text #:color 3 "【舞】なに・・・" 0 "君？")
      (wait)
      (text #:color 5 "【ポップコーン売り】ポップコーンいかがすかあ・・・ポップコーンはいかがすかあ。")
      (wait)
      (text #:color 7 "【" 0 "】ポップコーン・・・食べる？")
      (wait)
      (text #:color 3 "【舞】ううん、私はいらない。")
      (wait)
      (set-reg: 40 1)))
    ((&& (== V 2) (== N 1) (== (: 40) 1))
     (<>
      (text #:color 7 "【" 0 "】（こ、今度こそ・・・言うんだ。）")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・そんなに見つめないで。")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃん・・・。")
      (wait)
      (text #:color 5 "【ホットドック売り】ホットドックはいかがすかあ・・・とっても太くて大きいホットドックはいかかですかあ。")
      (wait)
      (text #:color 7 "【" 0 "】ホットドック・・・食べる？")
      (wait)
      (text #:color 3 "【舞】ううん・・・私はいらないけど。")
      (wait)
      (set-reg: 40 2)))
    ((&& (== V 2) (== N 1) (== (: 40) 2))
     (<>
      (text #:color 7 "【" 0 "】（まわりには・・・誰もいないな。）")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・疲れたの？")
      (wait)
      (text #:color 7 "【" 0 "】舞ちゃん・・・俺は・・・。")
      (wait)
      (text #:color 5 "【いきなり現れたカップル】すいませーん・・・写真撮ってくれますかあ？")
      (wait)
      (text #:color 7 "【" 0 "】・・・。")
      (wait)
      (text #:color 5 "【いきなり現れたカップル】すいませーん・・・写真撮ってくれますかあ？")
      (wait)
      (text #:color 3 "【舞】" 0 "君、撮ってあげたら？")
      (wait)
      (text #:color 7 "【" 0 "】ほれ、カシャッ・・・これでいいだろ？")
      (wait)
      (text #:color 5 "【いきなり現れたカップル】ち、ちゃんとこっちを向いて撮ってくださいよう。")
      (wait)
      (set-reg: 40 3)))
    ((&& (== V 2) (== N 1) (== (: 40) 3))
     (<>
      (text #:color 7 "【" 0 "】ちぇっ・・・恋人達だらけだぜ。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、私達は？")
      (wait)
      (text #:color 7 "【" 0 "】お、俺達は・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "友達") (text "他人") (text "夫婦") (text "恋人")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】まだ・・・友達だな。")
         (wait)
         (text #:color 3 "【舞】友達なんだ・・・。")
         (wait)
         (text #:color 7 "【" 0 "】友達って事は、恋人同士になれる可能性があるだぜ。")
         (wait)
         (text #:color 3 "【舞】恋人かあ・・・。")
         (wait)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】他人だな・・・。")
         (wait)
         (text #:color 3 "【舞】私達って・・・他人なの？")
         (wait)
         (text #:color 7 "【" 0 "】そう、他人。")
         (wait)
         (set-reg: 111 (- (: 111) 1))))
       ((== N 3)
        (<>
         (text #:color 7 "【" 0 "】夫婦だな・・・俺達は。")
         (wait)
         (text #:color 3 "【舞】" 0 "君・・・それってプロポーズ！？")
         (wait)
         (text #:color 7 "【" 0 "】夫婦になるって事は、その前に恋人にならないと・・・ね、舞ちゃん？")
         (wait)
         (text #:color 3 "【舞】もっとストレートに言って欲しいわ。")
         (wait)))
       ((== N 4)
        (<>
         (text #:color 7 "【" 0 "】俺達だって恋人同士だよ・・・そうだろ？")
         (wait)
         (text #:color 3 "【舞】" 0 "君って、誰にでも言いそうだから・・・半分だけ信じてあげる。")
         (wait)
         (text #:color 7 "【" 0 "】誰にでも言わないさ・・・俺は舞ちゃんにしか言わない。")
         (wait)
         (text #:color 3 "【舞】って、誰にでも言うんでしょう？")
         (wait)
         (text #:color 7 "【" 0 "】（うーん・・・信用がゼロに等しいな。）")
         (wait)))
       (else (<>)))
      (set-reg: 40 4)))
    ((&& (== V 2) (== N 1) (== (: 11) 7))
     (<>
      (text #:color 3 "【舞】なんか・・・ずいぶんと話をした気分だわ。")
      (wait)
      (set-var A 1)
      (proc 13)
      (proc 11)
      (text #:color 7 "【" 0 "】そうだな・・・。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、これからどうするの・・・帰る？")
      (wait)
      (text #:color 7 "【" 0 "】うーん・・・。")
      (wait)
      (set-reg: 101 1)
      (set-arr~ @ 7 0)
      (proc 18)
      (menu-show (<.> (text "帰る") (text "まだ話しをする")))
      (cond
       ((== N 1)
        (<>
         (text #:color 7 "【" 0 "】そろそろ帰ろうか・・・。")
         (wait)
         (text #:color 3 "【舞】そうね・・・パパの秘書が捜してるかもしれないし。")
         (wait)
         (set-reg: 50 1)))
       ((== N 2)
        (<>
         (text #:color 7 "【" 0 "】いや・・・まだ話をしたいな。")
         (wait)
         (text #:color 3 "【舞】うん・・・わかった。")
         (wait)
         (text #:color 7 "【" 0 "】（" 0 "、舞ちゃんにびしっと言うんだ・・・。）")
         (wait)))
       (else (<>)))
      (set-reg: 11 8)))
    ((&& (== V 2) (== N 1) (== (: 50) 1))
     (<> (text #:color 3 "【舞】" 0 "君・・・帰らないの？") (wait)))
    ((&& (== V 2) (== N 1) (== (: 11) 8))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん・・・俺は。")
      (wait)
      (text #:color 3 "【舞】なに？")
      (wait)
      (text #:color 7 "【" 0 "】俺は・・・舞ちゃんの事が・・・。")
      (wait)
      (text #:color 6 "【美人秘書】お嬢様っ！！・・・やっと見つけましたわっ！！")
      (wait)
      (text #:color 3 "【舞】きゃっ！？・・・またパパの秘書だわ。")
      (wait)
      (text #:color 7 "【" 0 "】（な、なんてタイミングの悪いねーちゃんだっ！！）")
      (wait)
      (text #:color 3 "【舞】" 0 "君・・・逃げましょっ！！")
      (wait)
      (text #:color 7 "【" 0 "】ま、またか・・・。")
      (wait)
      (set-var N 15)
      (set-reg: 763 1)
      (mouse 4 49152)
      (mouse 0)
      (slot 1 3)
      (mes-jump "town1.mes")))
    ((&& (== V 1) (== N 2) (== (: 12) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの顔は・・・アイスクリームをなめててもかわいい。）")
      (wait)
      (set-reg: 12 1)))
    ((&& (== V 1) (== N 2) (== (: 12) 1))
     (<> (text #:color 7 "【" 0 "】（かわいいなあ・・・。）") (wait)))
    ((&& (== V 1) (== N 3) (== (: 13) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの髪の毛だったら・・・髪の毛だけでも好きになれそうだ。）")
      (wait)
      (set-reg: 13 1)))
    ((&& (== V 1) (== N 3) (== (: 13) 1))
     (<> (text #:color 7 "【" 0 "】（どうして好きな女の子の髪って・・・触りたくなるんだろう？）") (wait)))
    ((&& (== V 1) (== N 4) (== (: 14) 0))
     (<>
      (text #:color 7 "【" 0 "】（舞ちゃんの手を・・・握った事すらないぞ。）")
      (wait)
      (text #:color 7 "【" 0 "】（腕の中で抱きしめたのに・・・手を握った事がないなんて、ちょっと変だよな？）")
      (wait)
      (set-reg: 14 1)))
    ((&& (== V 1) (== N 4) (== (: 14) 1))
     (<> (text #:color 7 "【" 0 "】（かわいい手だな・・・。）") (wait)))
    ((&& (== V 1) (== N 5) (== (: 15) 0))
     (<>
      (text #:color 7 "【" 0 "】（クレープアイス・・・かな？）")
      (wait)
      (text #:color 7 "【" 0 "】（舞ちゃんは甘い物が好きなんだ・・・きっと。）")
      (wait)
      (set-reg: 15 1)))
    ((&& (== V 1) (== N 5) (== (: 15) 1))
     (<> (text #:color 7 "【" 0 "】（なかなか溶けない・・・不思議なアイスだ。）") (wait)))
    ((&& (== V 1) (== N 6) (== (: 16) 0))
     (<>
      (text #:color 7 "【" 0 "】（黄色いリボンと言えば、舞ちゃんと美穂ちゃんだな。）")
      (wait)
      (set-reg: 16 1)))
    ((&& (== V 1) (== N 6) (== (: 16) 1))
     (<> (text #:color 7 "【" 0 "】（寝る時も、リボンをしたままなのか？）") (wait)))
    ((&& (== V 1) (== N 7) (== (: 17) 0))
     (<>
      (text #:color 7 "【" 0 "】（ああ・・・俺は舞ちゃんを抱きしめたんだぜ。）")
      (wait)
      (text #:color 7 "【" 0 "】（あの時の感触を・・・忘れる事ができない。）")
      (wait)
      (set-reg: 17 1)))
    ((&& (== V 1) (== N 7) (== (: 17) 1))
     (<> (text #:color 7 "【" 0 "】（舞ちゃんを見てるだけで・・・甘酸っぱい気分になってくる。）") (wait)))
    ((&& (== V 1) (== N 8) (== (: 26) 0))
     (<>
      (text #:color 7 "【" 0 "】パラソルって・・・何でパラソルって言うんだろう？")
      (wait)
      (text #:color 3 "【舞】だって・・・パラソルだもの。")
      (wait)
      (set-reg: 26 1)))
    ((&& (== V 1) (== N 8) (== (: 26) 1))
     (<>
      (text #:color 7 "【" 0 "】和風に言うと、『日傘』かな？")
      (wait)
      (text #:color 3 "【舞】あはは・・・そうよね、きっと。")
      (wait)))
    ((&& (== V 1) (== N 9) (== (: 27) 0))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん、棒って好き？")
      (wait)
      (text #:color 3 "【舞】え？")
      (wait)
      (text #:color 7 "【" 0 "】だからあ、棒って好き？")
      (wait)
      (text #:color 3 "【舞】何の棒の事かしら？")
      (wait)
      (text #:color 7 "【" 0 "】（肉）棒。")
      (wait)
      (text #:color 3 "【舞】ごめんなさい、よく聞き取れなかったわ。")
      (wait)
      (set-reg: 27 1)))
    ((&& (== V 1) (== N 9) (== (: 27) 1))
     (<>
      (text #:color 7 "【" 0 "】パラソルを支えてるんだ・・・ずっと。")
      (wait)
      (text #:color 3 "【舞】" 0 "君って、変な事で感心するのね。")
      (wait)))
    ((&& (== V 1) (== N 10) (== (: 28) 0))
     (<>
      (text #:color 7 "【" 0 "】色々な人がいるな・・・。")
      (wait)
      (text #:color 3 "【舞】家族連れが多いわね・・・私達も、将来は子供連れて来るようになるのかしら？")
      (wait)
      (text #:color 7 "【" 0 "】・・・え！？")
      (wait)
      (text #:color 3 "【舞】や、やだ・・・一緒って意味じゃないわよ。")
      (wait)
      (text #:color 7 "【" 0 "】びっくりしたあ。")
      (wait)
      (set-reg: 28 1)))
    ((&& (== V 1) (== N 10) (== (: 28) 1))
     (<>
      (text #:color 7 "【" 0 "】一緒に子供連れで来る？")
      (wait)
      (text #:color 3 "【舞】" 0 "君、からかわないで。")
      (wait)))
    ((&& (== V 1) (== N 11) (== (: 29) 0))
     (<>
      (text #:color 7 "【" 0 "】売店だな・・・誰に断って店をやってんだ、おう。")
      (wait)
      (text #:color 3 "【舞】パパじゃないかしら？")
      (wait)
      (text #:color 7 "【" 0 "】ごもっとも。")
      (wait)
      (set-reg: 29 1)))
    ((&& (== V 1) (== N 11) (== (: 29) 1))
     (<>
      (text #:color 7 "【" 0 "】色々な売店がある・・・。")
      (wait)
      (text #:color 3 "【舞】たりなかったら、また買ってくるけど。")
      (wait)))
    ((&& (== V 1) (== N 12) (== (: 30) 0))
     (<>
      (text #:color 7 "【" 0 "】うっぷ・・・二度と乗りたくない。")
      (wait)
      (text #:color 3 "【舞】楽しかったわ・・・あんなに興奮したのは、ひさしぶりだもの。")
      (wait)
      (set-reg: 30 1)))
    ((&& (== V 1) (== N 12) (== (: 30) 1))
     (<>
      (text #:color 7 "【" 0 "】ループコースターだぜ・・・。")
      (wait)
      (text #:color 3 "【舞】お化け屋敷は恐かったけど、あとは全然恐くなかったわ・・・" 0 "君は？")
      (wait)
      (text #:color 7 "【" 0 "】お化け屋敷以外は、全部恐かった・・・。")
      (wait)))
    ((&& (== V 1) (== N 13) (== (: 31) 0))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃん、ポップコーンを自分で作った事がある？")
      (wait)
      (text #:color 3 "【舞】あのポンポンはじけるやつよね・・・知ってるけど、危ないからってやらせてもらえないの。")
      (wait)
      (text #:color 7 "【" 0 "】ふーん・・・。")
      (wait)
      (text #:color 3 "【舞】今度・・・" 0 "君の部屋に行って、やらせてもらおうかしら？")
      (wait)
      (text #:color 7 "【" 0 "】（うーん・・・俺の部屋でやせせてもらう、か。）")
      (wait)
      (set-reg: 31 1)))
    ((&& (== V 1) (== N 13) (== (: 31) 1))
     (<> (text #:color 7 "【" 0 "】（ポップコーンをやらせて・・・その後は俺がやらせてもらいたい。）") (wait)))
    ((&& (== V 1) (== N 15) (== (: 33) 0))
     (<>
      (text #:color 7 "【" 0 "】あれは・・・乗ってないぞ。")
      (wait)
      (text #:color 3 "【舞】" 0 "君、無理しなくていいわよ・・・。")
      (wait)
      (set-reg: 33 1)))
    ((&& (== V 1) (== N 15) (== (: 33) 1))
     (<>
      (text #:color 7 "【" 0 "】舞ちゃんが乗りたいのなら、乗る事を考える事を考えよう。")
      (wait)
      (text #:color 3 "【舞】あはは・・・" 0 "君、もういいの、ここお話しをしましょ？")
      (wait)))
    ((&& (== V 1) (== N 16) (== (: 34) 0))
     (<>
      (text #:color 7 "【" 0 "】夏の葉の色って・・・好きなんだ。")
      (wait)
      (text #:color 3 "【舞】どうして？")
      (wait)
      (text #:color 7 "【" 0 "】濃い緑色をしててさ・・・元気がありそうだから。")
      (wait)
      (text #:color 3 "【舞】" 0 "君と一緒ね。")
      (wait)
      (set-reg: 34 1)))
    ((&& (== V 1) (== N 16) (== (: 34) 1))
     (<>
      (text #:color 7 "【" 0 "】最後の夏か・・・。")
      (wait)
      (text #:color 3 "【舞】来年もまた夏は来るわ・・・。")
      (wait)
      (text #:color 7 "【" 0 "】いいや、今年の夏は・・・もう二度と来ない。")
      (wait)))
    ((&& (== V 1) (== (: 32) 0))
     (<>
      (text #:color 7 "【" 0 "】広いなあ・・・遊園地って。")
      (wait)
      (text #:color 3 "【舞】これだけ乗物があるんですもの・・・。")
      (wait)
      (set-reg: 32 1)))
    ((&& (== V 1) (== (: 32) 1))
     (<>
      (text #:color 7 "【" 0 "】いい天気だし、気分はいいし、目の前に舞ちゃんはいるし・・・幸せだなあ。")
      (wait)
      (text #:color 3 "【舞】目の前に" 0 "君はいるし、一緒にお話しができるし、" 0 "君に抱きしめてもらったし・・・。")
      (wait)
      (text #:color 3 "【舞】・・・幸せ。")
      (wait)
      (set-reg: 32 2)))
    ((&& (== V 1) (== (: 32) 2))
     (<>
      (text #:color 3 "【舞】また・・・遊びに来たいな。")
      (wait)
      (text #:color 7 "【" 0 "】ああ・・・。")
      (wait)))
    (else (<>)))))
 (set-arr~ @ 7 1))